[
    {
        "id": "displays",
        "content": "ディスプレイ Sigme の主な目的は、その目的のために存在するアプリケーション スイート全体を使用して、画面にコンテンツを表示することです。Sigme は、画面にコンテンツを表示するタイミングと方法を管理するための Displays という概念を提供します。 新しいディスプレイがコンテンツの受信を開始できるように、CMSで Authorized としてマークされていることを確認してください。ディスプレイの行メニューで Authorise を選択してください。 ディスプレイ管理 ディスプレイはCMSのメインメニューの ディスプレイ セクションにある ディスプレイ をクリックすることで管理されます。ディスプレイは、プレーヤーソフトウェアのインストール時に生成される ハードウェアキー によって一意に識別されます。このハードウェア・キーは、CMSで一意のディスプレイ・レコードを作成するために使用されます。 ディスプレイの追加 (コード) 機能は、プレーヤーをインストールした後、プレーヤーをCMSに簡単に接続するために使用できます。 プレーヤーは接続するためにフォームに入力する6文字のアクティベーションコードを表示します。 ディスプレイを フォルダ に保存すると、ディスプレイのユーザー\/ユーザー グループ インタラクション レベルを簡単に制御できるほか、整理方法も追加できます。 フォルダに保存されたディスプレイは、ユーザー\/ユーザー グループの宛先フォルダに適用されている表示、編集、削除 共有 オプションを継承します。 グリッドの下部にある [ 選択されたもの ] オプションを使用して、複数のディスプレイをフォルダに割り当てます。 グリッドは、選択するとフォルダ内のオブジェクトのみを表示するように更新されます。または、[すべてのフォルダ] を使用してルート フォルダ内の検索を含めます。 フォルダ アイコンをクリックして、ビューのオン\/オフを切り替えます。フォルダがビューから非表示になっている場合は、選択したフォルダのファイル パスが表示されます。 列の表示ボタンを使用して、管理に必要な情報を表示するための利用可能なオプションから選択します。 注目すべきオプションの一部を以下に示します: ID - ディスプレイの内部識別。 ディスプレイ - CMS 内で簡単に識別できるようにディスプレイに付けられたフレンドリ名 (ディスプレイ自体には表示されません)。 ステータス : チェック = プレーヤーは最新です (緑色で表示される場合もあります)。 クラウド アイコン = プレーヤーはログインしておらず、コンテンツのダウンロードを待機しています (上記のように、琥珀色で表示される場合もあります)。 クロス = プレーヤーは現在新しいコンテンツをダウンロード中で、ダウンロードがまだ完了していません (赤色で表示される場合もあります)。 承認済み - チェックまたはクロスで、ディスプレイが CMS でライセンスを付与されているかどうかを示します。これにより、承認されていないディスプレイが CMS に追加されるのを防ぎます。 列の表示 ボタンを使用して 商用ライセンス 列を含めると、ディスプレイの商用ライセンス ステータスを簡単に識別できます。 ログイン - ディスプレイが最近ログインしたかどうかを示すためにチェックマークを付けるか、×印を付けます。 最終アクセス - ディスプレイが最後にアクセスされた日時のスタンプ。 MAC アドレス - ディスプレイのメディア アクセス制御アドレス (プレーヤー ソフトウェアが送信可能な場合)。 行メニュー 各ディスプレイには、いくつかのアクション\/ショートカットを含む行メニューがあります。 選択したアクションにより、 承認 や ライセンスの確認 などの特定の フォームを自動的に送信 が可能になります。自動送信機能を持つアクションには、有効にするオプションが表示されます。 管理 各ディスプレイには独自の ダッシュボード があり、ディスプレイの現在のステータス、帯域幅の使用状況、ファイルのステータス、エラーが表示されます。 このダッシュボードは、ディスプレイの問題をトラブルシューティングするときに最初に確認する手順として役立ちます。 編集 編集 をクリックして、ディスプレイの構成オプションを管理します。 全般 タブを使用して、インストール中に生成される固有の ディスプレイ ハードウェア キー を表示し、 ディスプレイを承認 して使用可能なライセンス プール スロットを使用し、 デフォルト レイアウト を設定します。 ディスプレイの 緯度 や 経度 などのディスプレイの 詳細 を入力します。 広告キャンペーン 機能を使用している場合は、選択したすべてのディスプレイについて、このタブの 再生あたりのコスト と 再生あたりのインプレッション数 のフィールドに必ず入力してください。 広告のニーズを高めるために、次のような追加フィールドが含まれています: ディスプレイの物理アドレス ディスプレイはモバイルですか? 会場タイプ サポートされている言語 必要に応じて、選択したディスプレイの 参照 情報を入力します。追加すると、この情報はディスプレイ グリッドと API 経由で表示できます。 メンテナンス タブから、 電子メール アラート と グローバル タイムアウト 設定を制御します。 設定 タブを使用して、個々のディスプレイの ディスプレイ プロファイル設定 を上書きします。 詳細 タブを使用して、ディスプレイが消費できる 帯域幅 の量を決定するための制限を適用し、 キャッシュされたデータをクリア します。 ディスプレイ グリッドの下部にある 選択されたもの オプションを使用して、複数のディスプレイの帯域幅制限を簡単に設定できます。 削除 ディスプレイ を削除すると、 CMS から完全に削除されます。この操作を元に戻すことはできません。削除されたディスプレイは、 CMS への接続 手順を繰り返すことで CMS に再接続できます。これにより、新しい一意のディスプレイ レコードが作成されます。 ディスプレイを削除する代わりに 認証解除 して、必要に応じて後日再認証できるようにします。ディスプレイの行メニューを使用して、 認証 をクリックして 認証解除 に切り替えます。 これは、[全般] タブの [編集] フォームから [表示の承認] で [いいえ] を選択することで実行することもできます。 デフォルト レイアウト コンテンツがスケジュールされていない場合、またはスケジュールされたイベントが表示されないようにする問題がある場合は、何かが 常に 表示されるように、ディスプレイに デフォルト レイアウト が表示されます。 ディスプレイには、 CMS 設定 で設定されたグローバル デフォルト レイアウトが表示されます。これは、必要に応じてディスプレイごとに上書きできます。 行メニューまたは 編集 フォームから選択して、ドロップダウン メニューから使用するレイアウトを選択します。 このフィールドを空白のままにすると、グローバル デフォルト レイアウトが自動的に使用されます。 選択する独自のレイアウトを作成しますが、デザインは複雑なメディアや Web コンテンツを使用せず、シンプルにしておく必要があることに注意してください。 注意: 他にスケジュールされているコンテンツがなく、デフォルト レイアウトがダウンロード中の場合、または選択したデフォルト レイアウトに問題がある場合は、スプラッシュ スクリーンが表示されます。 ファイル\/レイアウトの割り当て ライブラリ ファイル と レイアウト をディスプレイに直接割り当てることができるため、プレーヤーのローカル ライブラリで常に使用できます。これは、レイアウトが API 統合に使用される場合、たとえば変更をトリガーする場合に、事前にレイアウトをプリロードするのに便利です。 割り当てるファイル\/レイアウトを選択し、[ 保存 ] をクリックします。 選択したファイル\/レイアウトは、次の収集間隔でディスプレイにダウンロードされます。XMR がインストールされている場合は、すぐにダウンロードされます。 ただし、これはライブラリ ファイルとレイアウトが表示されることを意味するものではなく、引き続き スケジュール する必要があります。 同じ手順に従い、上部のステージング領域からアイテムの選択を解除することで、ファイル\/レイアウトをディスプレイから割り当て解除できます。これらは、プレーヤーがスペースを必要とするとき、またはファイル\/レイアウトが不要になってから 30 日後に「クリーンアップ」されます。 コマンドの送信 コマンドの送信 機能は、定義済みのコマンドを選択することで、XMR 経由でプレーヤーに実行されます。これは、たとえばプレーヤーに「再起動」コマンドを送信する場合に便利です。 このタイプの コマンド は、 コマンド イベント をスケジュールすることによっても実行できます。 ディスプレイを別の CMS に転送 この機能を使用するには、まだ設定していない場合は、まず 2 要素認証 を使用して Google Authenticator をアクティブ化する必要があります。 アクティブ化したら、転送するディスプレイの行メニューを使用して、[ 別の CMS に転送 ] を選択します。 以下の説明に従って、すべてのフォーム フィールドが入力されていることを確認します。 このディスプレイを転送する完全な CMS URL を入力します。 転送先の CMS アドレスの CMS シークレット キー を入力します。 アプリに表示される 2要素認証コード を入力します。 提供された詳細が認証されると、ディスプレイは「新しい」CMSへの登録を試みます。ディスプレイが正常に転送されると、ディスプレイは「古い」CMSとの通信を停止し、ディスプレイ グリッドの 承認済み 列のチェックマークが「チェック」から「X」に変わります。 グリッドの下部にある 選択したもの オプションを使用して、転送する複数のディスプレイを選択します。 マップ ビュー マップ ビューを使用して、ディスプレイの場所とステータスを確認します。 フォルダ切り替えの横にあるアイコンをクリックして、 マップ ビュー に切り替えます: マーカー クラスター内のディスプレイのステータスは、識別しやすいように円グラフで表示されます: ログインしたユーザーは、アクセスを許可されているディスプレイのステータスのみを表示できます。 リスト ビューのグリッドのフィルター フィールドを使用して、表示するディスプレイを分離します! ステータス アイコンをクリックすると、選択したディスプレイに関する詳細情報が表示されます: リスト アイコンをクリックすると、ディスプレイ グリッド ビューに戻ります。 次へ… 表示グループ",
        "page_url": "output\/ja\/displays.html"
    },
    {
        "id": "displays_command_functionality",
        "content": "コマンド機能 Sigme のコマンド機能は、ユーザーが XMR 経由で、 スケジュール で、または レイアウト に含めるように選択するコマンド セットを構成するために使用されます。 コマンドには、すべてのプレーヤーに適用するコマンド文字列、またはプレーヤーごとに異なるコマンド文字列を含めることができます。これは、ネットワークが混在している場合や異なるディスプレイに接続されている場合、またはプレーヤー ハードウェアがわずかに異なる場合に特に便利です。 コマンド レコード が作成され、 ディスプレイ プロファイル 、 スケジュールされたイベント 、 シェル コマンド ウィジェット で使用できる「汎用コマンド」を作成できます。 コマンドを使用すると、RS232、Android インテント、Philips SoC (システム オン チップ) の機能に簡単にアクセスできます。 コマンド管理 コマンドは、メイン CMS メニューの ディスプレイ セクションの コマンド から作成および管理されます。 コマンドの行メニューを使用して、 共有 オプションを編集、削除、および設定します。 コマンドの追加 コマンドの追加 ボタンをクリックし、関連するフォーム フィールドに入力します: コマンド ドロップダウン メニューを使用して、次のいずれかのオプションを選択して構成します: フリー テキスト コマンド文字列を入力します コマンド文字列は、最後に実行されたコマンドを表し、シェルへの直接呼び出しにすることも、 ヘルパー を指定することもできます。以下の「ヘルパー」セクションを参照してください。 Philips Android Phillips Commercial Display の統合は、Android v2 R200 から利用できます。 以下のコマンドを使用して、一部の市販のフィリップス ディスプレイの側面にある LED を制御できます: tpv_led|off tpv_led|red tpv_led|green tpv_led|blue tpv_led|white Android v2 R215 以降では、以下のコマンドを使用して画面のバックライトの電源をオン\/オフにするための統合が追加されました: tpv|backlighton tpv|backlightoff 以下のコマンドは、特定の Android 4 モデルでのみ使用できます。 2016 モデル 10BDL3051T tpv|screenoff tpv|screenon screenoff は画面をオフにして低電力状態にし、その後 screenon でオンに戻すことができます。 その他のすべてのモデルでは、 screenoff は完全に電源をオフにするため、現場での再起動が必要になるため、 backlighton\/off を使用してください。 v2 R215 からは、ミュート\/ミュート解除コマンドも追加されました: tpv|mute tpv|unmute 注意: backlighton\/off はオーディオをミュートしないため、オーディオを再生している場合は、上記の mute\/unmute コマンドも同時にスケジュールする必要があります。 RS232 コマンド文字列で rs232 プレフィックスを使用することで、プレーヤーで RS232 コマンドを実行できます。コマンドの形式は rs232|<接続文字列>|<コマンド> です。 Windows では、接続文字列は次の形式で指定する必要があります: <COM#>、<ボー レート>、<データ ビット>、<パリティ|なし、奇数、偶数、マーク、スペース>、<ストップ ビット|なし、1、2、1Point5>、<ハンドシェイク|なし、XOnXOff、RequestToSend、RequestToSendXOnXOff>、<HexSupport|0、1、デフォルト 0> 注意: コマンドを HEX 形式で送信する必要がある場合は、コマンド文字列でバイト文字列を指定する必要があります。たとえば、 7E 00 00 FF 00 00 00 00 00 00 00 00 00 00 00 00 FF です。これはプレーヤーによってバイト ストリームに変換されます。接続文字列の HexSupport 要素を 1 に設定する必要があります。 Android では、接続文字列は次の形式で指定する必要があります: <DeviceName>、<Baud Rate>、<Data Bits>、<Parity>、<StopBits>、<FlowControl> 各設定は対応する数字で表されます: DATA_BITS_5 = 5; DATA_BITS_6 = 6; DATA_BITS_7 = 7; DATA_BITS_8 = 8; PARITY_NONE = 0; PARITY_ODD = 1; PARITY_EVEN = 2; PARITY_MARK = 3; PARITY_SPACE = 4; STOP_BITS_1 = 1; STOP_BITS_15 = 3; STOP_BITS_2 = 2; FLOW_CONTROL_OFF = 0; FLOW_CONTROL_RTS_CTS = 1; FLOW_CONTROL_DSR_DTR = 2; FLOW_CONTROL_XON_XOFF = 3; コマンド自体は、接続の詳細を使用して RS232 経由で送信される文字列です。 Android インテント Android ディスプレイ プロファイルでは、 intent ヘルパーを使用して、コマンドの実行時に呼び出されるインテントを指定できます。コマンドの形式は、 intent|<type|activity,service,broadcast>|<activity>|[<extras>] です。 [<extras>] は、 Android v2 R206 から使用可能なオプションのパラメータで、インテントに追加データを提供するために使用されます。これは、少なくとも 1 つのオブジェクトを含む配列を含む JSON 形式の文字列である必要があります。オブジェクトの形式は以下のとおりで、1 行にする必要があります。 { \"name\": \"<extra name>\", \"type\": \"<type|string,int,bool,intArray>\", \"value\": <上記の型の値> } たとえば、一部のデバイスでは、ファームウェアをプログラムしてオン\/オフの時間を設定できます。 [{ \"name\": \"timeon\", \"type\": \"intArray\", \"value\": [2018, 7, 28, 8, 40] }, { \"name\": \"timeoff\", \"type\": \"intArray\", \"value\": [2018, 7, 28, 21, 40] }] これはコマンドで次のように設定されます: intent|broadcast|activity|[{ \"name\": \"timeon\", \"type\": \"intArray\", \"value\": [2018, 7, 28, 8, 40] }, { \"name\": \"timeoff\", \"type\": \"intArray\", \"value\": [2018, 7, 28, 21, 40] }] Windows プレーヤーでは、インテント ヘルパーを含むコマンドは無視されます。 ヘルパー コマンド ヘルパー は、より高度なアクションを実行するためにコマンド文字列に追加できるプレフィックスです。プレフィックスのないコマンドは、プレーヤーを実行するオペレーティング システムのシェルで実行されます。Windows では cmd.exe 、Android では shell です。 検証 検証文字列 は、 コマンド 出力との比較に使用され、一致した場合はコマンドが成功したと見なされます。検証文字列は完全に一致する必要があります。 これは、Windows と Android のプレーヤーが混在するネットワークで「再起動」というコマンドを使用する場合に役立ちます。Windows での「再起動」のコマンド文字列は shutdown \/r \/t 0 で、Android では reboot です。 同じことは、混合されていないネットワークでも役立ちます。HDMI\/RS232 経由で接続されたさまざまなモニターを備えた Windows プレーヤーのネットワークを想像してください。異なるディスプレイ設定プロファイルで表されるさまざまなブランドのモニターを使用して、「モニター オン」という単一のコマンドを作成できます。各モニターには、モニターのオン\/オフを切り替えるための異なるコマンド文字列を設定できます。 使用可能 コマンドを使用できるディスプレイの種類を選択します。空白のままにすると、すべての種類のディスプレイにコマンドが適用されます。 コマンド および 検証 文字列は、 ディスプレイ プロファイル を編集し、[ コマンド ] タブを使用することで上書きできます。 コマンド XMR を送信 行メニューを使用して、ディスプレイ\/ディスプレイ グループから XMR 経由でコマンドを実行します。 コマンドのスケジュール コマンドをスケジュール して、特定の時間に実行されるようにします メイン CMS メニューから スケジュール をクリックします。 スケジュール グリッドの上部から イベントの追加 を選択します。 イベント タイプ ドロップダウンから コマンド を選択します。 フォーム フィールドに入力し、使用する コマンド と 開始時刻 を選択します。 スケジュールされたコマンドはプレーヤーで 1 回実行され、 開始 の日付と時刻のみが必要です。コマンドは、選択した時刻から最大 10 秒後に実行できます。 シェル コマンド シェル コマンド ウィジェット を使用して、レイアウト アクティビティに基づいて外部コマンドを実行します。 コマンドをソースとするシェル コマンドは、通常のシェル コマンドと同じように動作します。コマンドは、ウィジェットがレイアウトに表示されるときに実行されます。 シェル コマンドは、すべてのプレーヤーにオプションが提供されるコマンド文字列にすることもできます。これにより、ユーザーは 1 回限りの使用のために「アドホック」コマンドを追加できます。 管理者は、可能な場合は定義済みコマンドを作成することをお勧めします。 モニターのオン\/オフ HDMI-CEC HDMI-CEC は、HDMI コネクタを備えたほぼすべての新しい大画面テレビに実装されているバスです。このバス (通常の HDMI ケーブル内で物理的に接続) は、電源オン、電源オフ、音量調整、ビデオ ソースの選択、およびテレビのリモコンからアクセスできる多くの機能を実行できる制御信号をサポートします。また、HDMI バス上の他のほとんどのハードウェアを制御することもできます。 メーカーの仕様が多数あるため、Sigme は HDMI-CEC への直接インターフェイスを提供していませんが、バッチ ファイルを使用して HDMI-CEC を制御することは可能です。 シリアル\/RS232 業界グレードのモニターには、モニター パネルのオン\/オフを切り替えるためのシリアル インターフェイスが備わっていることがよくあります。Sigme は、RS232 コマンド ヘルパーを使用して、これらのコマンドをモニターに送信できます (通常は HEX モードで)。 以下のモニターとコマンドがテストされています: NEC E464 電源オン - rs232|COM1,9600,8,None,One,None,1|01 30 41 30 41 30 43 02 43 32 30 33 44 36 30 30 30 31 03 73 0d 電源オフ - rs232|COM1,9600,8,None,One,None,1|01 30 41 30 41 30 43 02 43 32 30 33 44 36 30 30 30 34 03 76 0d Sharp LC-42D69U 電源オン - rs232|COM1,9600,8,なし,1,なし,1|50 4F 57 52 31 20 20 20 0D 電源オフ - rs232|COM1,9600,8,なし,1,なし,1|50 4F 57 52 00 20 20 20 0D LG 55LK520 電源オン - rs232|COM1,9600,8,なし,1,なし,1|6B 61 20 30 30 20 30 31 0D 電源オフ - rs232|COM1,9600,8,なし,1,なし,1|6B 61 20 30 30 20 30 30 0D 各ブランドの他のモデルでも同じコマンドを使用する必要があることに注意してください。",
        "page_url": "output\/ja\/displays_command_functionality.html"
    },
    {
        "id": "displays_groups",
        "content": "ディスプレイ グループ Sigme システムの拡大に合わせて、特定の ディスプレイ をグループ化してディスプレイ グループを作成し、スケジュールと管理を容易にします。 ディスプレイ グループには、単一の ディスプレイ と他の ディスプレイ グループ の両方を含めることができます。これにより、単純な スケジュール だけで多数のディスプレイをターゲットにすることができます。 ディスプレイ グループの管理 ディスプレイ グループは、CMS のメイン メニューのディスプレイ セクションの [ ディスプレイ グループ ] をクリックして CMS で管理されます。 [ ディスプレイ グループの追加 ] ボタンを使用して新しいディスプレイ グループを作成し、必要なフォーム フィールドに入力します。 ディスプレイ グループは フォルダー に保存して、ディスプレイ グループのユーザー\/ユーザー ユーザー グループ レベルのインタラクションを簡単に制御できるほか、整理するための追加の方法も提供されます。 フォルダに保存されたディスプレイ グループは、ユーザー\/ユーザー グループの宛先フォルダに適用された表示、編集、削除 共有 オプションを継承します。 ディスプレイは、手動で追加するか、フィルター条件を使用して動的グループとして制御するかのいずれかの方法でディスプレイ グループに割り当てる必要があります。 動的グループ メンバーシップ メンバーをこのグループに動的に割り当てるには: フォームの [動的グループ] チェックボックスをオンにして、追加のフォーム フィールドを表示します。 動的グループのフィルター条件は正規表現の形式ですが、単純な文字列比較にすることもできます。式はカンマで区切る必要があり、 - プレフィックスで否定できます。 たとえば、「a」を含み「b」を含まないすべてのディスプレイは a,-b になります。 複数のタグが割り当てられているディスプレイでは、追加の OR\/AND フィルターを使用して条件タグをフィルターできます。 [ 保存 ] をクリックします。 さらにディスプレイ グループを作成する場合は、[保存] をクリックする代わりに [ 次へ ] をクリックしてフォームを開いたままにし、新しいディスプレイ グループの作成を続けます。 手動グループ メンバーシップ このグループにメンバーを手動で割り当てるには: [動的グループ] チェックボックスをオフにしたまま、[ 保存 ] をクリックします。 新しいディスプレイ グループ レコードの行メニューを使用して、[ メンバー ] を選択します。 各ディスプレイのチェックボックスを使用して、グループのメンバーシップを制御します。 関係ツリー タブを使用して、編集中の表示グループの祖先と子孫を表示します。現在の表示グループは太字で表示されます。親表示グループ (現在の表示グループより上) は、現在の表示グループと子表示グループにスケジュールを渡します。子表示グループ (現在の表示グループより下) は、親表示グループと現在の表示グループからスケジュール情報を継承します。 クリックして 保存 します。 ネストされたグループ 表示グループをネストして、複雑な構造とターゲットを絞ったスケジュールを作成できます。 グループ構造の例 サイト 1 サイト 1 - 建物 A サイト 1 - 建物 A - レベル 1 サイト 1 - 建物 A - レベル 2 サイト 1 - 建物 B ディスプレイ メンバーシップは最下位レベルのグループに設定され、それらのグループは次のレベルに属し、そのレベルは最上位レベルの親「サイト 1」に属します。 CMS では、循環参照 (ループを作成する割り当て、つまりサイト 1 にサイト 1 - 建物 A があり、サイト 1 - 建物 A にサイト 1 がある) の作成は許可されません。 ディスプレイ グループに設定された スケジュール 、 メディア ファイル 、および レイアウト割り当て は、グループに割り当てられたすべてのメンバーに適用されます。 行メニュー 各ディスプレイ グループには、いくつかのアクション\/ショートカットを含む行メニューがあります。 ディスプレイが手動で割り当てられたディスプレイ グループのメンバーシップを管理するには、[ メンバー ] をクリックします。 編集 を使用して、動的メンバーシップに使用される基準を表示し、必要に応じて変更します。 ライブラリ ファイルとレイアウト をディスプレイ グループに直接割り当てて、プレーヤーのローカル ライブラリで常に使用できるようにします。 グリッドの下部にある 選択されたもの オプションを使用すると、複数のディスプレイ グループに対して一括操作を簡単に実行できます。 次へ… ディスプレイ同期グループ",
        "page_url": "output\/ja\/displays_groups.html"
    },
    {
        "id": "displays_metrics",
        "content": "レポート Sigme は、ユーザーが CMS 内でさまざまなレポートを表示できるように 機能 が有効になっている便利な メトリック を提供します。 レポートは、 ディスプレイ のパフォーマンスと使用状況、および詳細な 再生証明 と ライブラリ の使用状況レポートを分析するための一元化された領域を提供します。これらのレポートは、メイン CMS メニューの [ レポート ] セクションの [ すべてのレポート ] から表示できます。 ディスプレイ ディスプレイ レポート: ディスプレイ統計: 帯域幅 CMS は、コンテンツのために XMDS に接続するとき、およびディスプレイ情報をレポートするときに、各ディスプレイが使用する 帯域幅 を記録します。 範囲を選択して [ 適用 ] をクリックします。ディスプレイ フィールドを空のままにすると、ディスプレイごとの帯域幅チャートの合計が表示されます。 1 つのディスプレイだけにフィルターして [ 適用 ] をクリックすると、プレーヤーが XMDS に対して行った各呼び出しが個別に表示されます。 1 つのディスプレイだけにフィルターすると、帯域幅がどこで使用されたかをよりよく理解できます。 ご存知ですか… ディスプレイ ごとに帯域幅制限を設定できます! すべてのレポート ボタンを使用してレポートダッシュボードに戻るか、 レポート ドロップダウンメニューを使用して別の「ディスプレイ」レポートを選択して表示します。 接続\/切断時間 CMS は、すべてのディスプレイ\/ディスプレイグループのオン\/オフラインイベントを記録して、ディスプレイの可用性に関する内訳を提供します。 接続時間レポートには、接続率 (緑で表示) と切断率 (青で表示) の内訳が表示されます 範囲 と グループ化 時間または月日を選択します。 すべてを表示するにはディスプレイ\/ディスプレイグループフィールドを空のままにするか、表示するディスプレイ\/ディスプレイグループを選択します。 [ 適用 ] をクリックします 概要 には、ディスプレイ\/ディスプレイ グループの指定された日付間の詳細な内訳と、接続\/切断された日数が表示されます: 再生証明 各 ディスプレイ は、表示内容に関する再生証明レポートを提供するために情報を収集できます: レイアウト - 表示されている選択したレイアウトのすべてのインスタンスを表示します。 メディア - 表示されている選択したメディア ファイルのすべてのインスタンスを表示します。 ウィジェット - レイアウト内に含まれる選択したウィジェットに関するレポートを表示します。(テキストなどのライブラリ メディア ファイルを含まないウィジェットも含まれます)。 イベント - プレーヤーが外部センサーからの収集をサポートしている場合、イベント統計が記録され、レポートに表示されます。 プレイ証明レポートを収集するには、 ディスプレイ プロファイル設定 で [ 統計レポートを有効にする ] が有効になっており、[集計レベル**] が設定されていることを確認してください。 個別 - 統計は各項目の開始時と終了時に個別に記録され、各収集間隔で CMS に返送されます。 時間ごと - 各項目を 1 回記録し、1 時間中の再生回数と再生時間の合計を含め、1 時間の期間が経過した後の次の収集間隔で CMS に返送されます。 日次 - 各項目を 1 回記録し、その日のプレイ回数とプレイ時間の合計が記録され、その日の終了後の次の収集間隔で CMS に返されます。 プレーヤーは「完了した記録」のみを集計し、ウィジェットの期間の終了時に収集が行われるため、ウィジェットの期間が 3 時間の場合、ウィジェットの有効期限が切れると統計が記録されます。 CMS 設定 で、プレイ証明の収集をデフォルトで有効にすることができます。 プレイ証明 レポート: プレイ証明: エクスポート 選択したディスプレイとタイムスケールの CSV にエクスポートされたプレイ証明データを表示します。 再生証明: レポート ドロップダウンから 範囲 を選択するか、独自の日付と時刻を指定して、必要に応じてフィルター フィールドを使用します。 [適用] をクリックします [すべてのレポート] をクリックしてレポート ダッシュボードに戻るか、[レポート] ドロップダウンを使用して利用可能な再生証明レポートから選択します。 チャート: レイアウト、メディア、またはイベント別の概要\/分布 チャートには、選択したレイアウト、メディア、またはイベントの合計時間と再生回数が表示されます。 [範囲] を選択します。 [タイプ] を選択し、ドロップダウンを使用して選択したタイプをさらに指定します。 [適用] をクリックします。 タブを使用して、各レポートの チャート と 表形式 データを切り替えます。 表形式データは CSV としてエクスポートできます。 ライブラリ ライブラリ レポート: ライブラリの使用状況 CMS のすべてのユーザーのライブラリの使用状況を表示するか、フィルターを使用して個々のユーザー\/ユーザー グループの使用状況の概要を表示します。 スケジュール レポートは、 日次 、 週次 、 月次 、または 年次 ベースで実行するようにスケジュールできます。 チャート: 分布 および チャート: サマリー レポート では、 スケジュール ボタンをアクティブにするために、 タイプ と名前付きレイアウト\/メディア\/イベントを選択する必要があります。 スケジュール ボタンをクリックし、特定のレポート タイプに必要なフォーム フィールドに入力します。 メールを送信しますか? チェックボックスをオンにすると、レポートの PDF をユーザーにメールで送信できます。 オプションで、メイン メニューの 管理 セクションの 設定 ページの 全般 タブを使用して、エクスポートされたレポートに表示される ロゴ を無効にできます。 スケジュールされたレポートは、 メール アドレス フィールドに入力された追加のメール アドレスにメールで送信することもできます。CMS 設定の ネットワーク タブで 送信メール アドレス が設定されていることを確認してください。 レポート スケジュール 所有者\/タイプ別にすべてのスケジュールを表示するには、 レポート スケジュール ボタンをクリックします。 各レポートには、ショートカットと追加のアクションを含む行メニューがあります。 保存済みレポート すべての実行レポートを表示するには、[ 保存済みレポート ] をクリックします。 自分の実行レポートのみを表示するには、チェックボックスを使用します。 行メニューを使用して、保存済みレポートの表示、スケジュール、PDF としてのエクスポート、または削除を行います。 レポート スケジュール と 保存済みレポート には、CMS メニューの [ レポート ] セクションから直接アクセスすることもできます。",
        "page_url": "output\/ja\/displays_metrics.html"
    },
    {
        "id": "displays_settings",
        "content": "ディスプレイ設定 インストールして CMS に接続すると、 ディスプレイ設定プロファイル を使用してディスプレイを自動的に管理および構成できます。各ディスプレイにはデフォルトのプロファイルがあり、管理者は要件に合わせてこれをカスタマイズできます。 使用可能なプロファイルは、メイン CMS メニューの ディスプレイ セクションの ディスプレイ設定 をクリックすると表示されます: 各プロファイルには、 名前 、 タイプ 、および デフォルト かどうかを示すフラグがあります。デフォルト プロファイルは、対応するタイプのディスプレイに自動的に割り当てられます。 プロファイルの追加\/編集 新しいプロファイルを 追加 するには: プロファイルの追加 ボタンをクリックし、新しいプロファイルに 名前 を付けて、 ディスプレイ タイプ を選択します。 選択したタイプのすべてのディスプレイの デフォルト プロファイル として使用する場合は、ボックスを使用します。 デフォルト プロファイル として選択できるプロファイルは、ディスプレイ タイプごとに 1 つだけです。 新しいプロファイルに必要なすべての設定を完了します。 既存のプロファイルを 編集 するには: 選択したプロファイルの行メニューから 編集 をクリックします。 フォームを使用して、使用可能な設定を調整します。 簡単にするために、行メニューを使用してプロファイルを コピー すると、必要に応じて調整して新しいプロファイルをすばやく作成できます。 注目すべき設定のいくつかを以下に示します: 収集間隔 全般 タブにある 収集間隔 ドロップダウン メニューを使用して、プレーヤーが新しいコンテンツ\/スケジュールを確認する頻度を決定します。これは、プレーヤーが CMS と通信した後、ここで設定された時間までに再度変更を確認することを意味します。 シナリオ: プレーヤーの収集間隔が 24 時間に設定されている場合、プレーヤーは変更、保留中のアクション、および次の 24 時間の収集を待機します。この期間内に変更が行われた場合、プレーヤーは再度確認するまでその変更を認識しません。 プレーヤーのディスプレイ プロファイルが変更された場合、プレーヤーは以前の接続間隔に従って接続した後にのみ変更を認識します。 シナリオ: 収集間隔が 24 時間に設定されているプレーヤーが午後 12 時にチェックを行った場合、翌日の午後 12 時まで変更の有無はチェックされません。24 時間の間隔が経過すると、新しい変更が更新され、この時点から新しいプロファイルに基づいて変更が収集されます。 プレーヤーのアクションが必要な場合、CMS は XMR インスタンスと通信するように設定できます。管理者にお問い合わせください。 本番環境では 5 分以上の間隔を設定することをお勧めします。通常は 15 ～ 30 分の設定が適切です。 統計レポートを有効にする [ 全般 ] タブのさらに下にあるボックスを使用して、選択した ディスプレイ プロファイル を使用するすべての ディスプレイ の Proof of Play レポート の統計収集を有効\/無効にします。 有効にした場合、[ 集計レベル ] ドロップダウンを使用して、すべてのレイアウト、メディア、ウィジェット アイテムに適用される Proof of Play 統計の収集レベルを設定します。 個別 - デフォルトでは、指定されたときに統計が収集されます。 時間ごと - デフォルトでは、統計は時間ごとに収集されます。 毎日 - デフォルトでは統計が毎日収集されます。 ディスプレイの地理的位置がわかっている場合は、チェックボックスをオンにして、各プレイ証明レコードに対して位置を記録します。モバイルディスプレイを使用しているユーザーは、必要に応じてこの設定をオンにできます。 プレーヤーは 完了したレコードのみ を集計し、ウィジェットの期間の終了時に収集が行われるため、ウィジェットの期間が 3 時間の場合、ウィジェットの有効期限が切れると統計が記録されます。 ダウンロードおよび更新ウィンドウ ネットワーク タブで、CMS からの ダウンロード とプレーヤーへの 更新 の時間ウィンドウを設定します。 ダウンロードウィンドウのタイミング 開始時刻と終了時刻を選択して、CMS に接続し、行われた変更をダウンロードします。 ダウンロードウィンドウの設定外でコンテンツに変更を加えた場合、プレーヤーは変更をダウンロードできず、代わりに割り当てられたデフォルトのレイアウトまたはスプラッシュ画面が表示される可能性があります。 ウィンドウを常に開いたままにするには、デフォルトの 00:00 - 00:00 のままにしてください。 更新ウィンドウのタイミング アプリケーションの更新をインストールするには、開始時間と終了時間を選択します。 新しいプレーヤー バージョンなどの更新をプレーヤーにダウンロードする時間を定義します。これには、プレーヤーに更新される新しいスケジュールや既存のスケジュールの変更も含まれます。コンテンツの変更は、設定された更新ウィンドウのタイミング中に更新されません。 この設定は、割り当てられたレイアウトまたは遅延公開されたレイアウトと組み合わせて使用するのが最適です。これにより、レイアウトは更新ウィンドウ中に公開されます。 HTTPS を強制 ネットワーク タブからチェックボックスを使用して、HTTPS を使用してディスプレイを CMS に接続します。 このオプションは、必要に応じて個々のディスプレイに対して上書きできます。 営業時間 定義済みの Dayparts を設定して、ディスプレイの 営業時間 を設定します。 Windows、Android、Linux プレーヤーの場合は ネットワーク タブを使用し、ドロップダウン メニューから使用する時間帯を選択します。 webOS および Tizen プレーヤーの場合は 全般 タブを使用し、ドロップダウン メニューから使用する時間帯を選択します。 ディスプレイがオフラインのときに送信されるような「電子メール アラート」は、指定された営業時間外には送信されません。 変更されたレイアウトを期限切れにする 詳細 タブにあるこのチェックボックスを使用すると、プレーヤーが CMS から更新を受け取ったときに、レイアウトの再生を直ちに期限切れにしてカットするように Sigme に指示できます。 長時間のレイアウトに便利です! 複数のデコーダーを使用する ビデオ コンテンツで ギャップレス再生 を行うには、デバイスに複数のデコーダーが必要です。この設定は [詳細設定] タブにあり、自動的に [デバイスのデフォルト] が使用されます。 再生で問題が発生した場合は、ドロップダウンを使用して [オン] に設定してください。 デバイスのタッチ機能を有効にする (Android のみ) ディスプレイを タッチ スクリーン として使用する場合は、[詳細設定] タブからこのオプションを有効にします。 このオプションを有効にすると、プレーヤーに 1 回限りのメッセージが表示されますが、手動で閉じる必要があります。 無効のままにしておくと、画面をタッチすると [アクション バー モード] オプションに従ってアクション バーが表示されます。 プロファイルの削除 行メニューを使用してディスプレイ プロファイルを削除します。 タイプごとに デフォルト が 1 つ残っていることを確認してください。 設定プロファイル デフォルト プロファイル は、同じタイプのすべてのディスプレイにその設定を自動的に適用します。 ディスプレイ をオーバーライドして、デフォルト以外のプロファイルを使用できます。 メイン CMS メニューのディスプレイ セクションの ディスプレイ をクリックします。 オーバーライドするディスプレイを選択し、行メニューから 編集 をクリックします。 設定 タブで、ドロップダウンを使用して、ディスプレイで使用する 設定プロファイル を選択します。 各設定は、個々のディスプレイ要件に合わせてオーバーライドすることもできます。 次へ… レポート",
        "page_url": "output\/ja\/displays_settings.html"
    },
    {
        "id": "displays_sync_groups",
        "content": "同期グループ 同期グループには、同期されたコンテンツを表示するディスプレイが含まれます。 同期イベント をスケジュールするときに、コンテンツを同期して、ミラーリングまたはビデオ ウォール構成の 2 つ以上のディスプレイで再生できます。 コンテンツ同期キー を使用して、異なるレイアウトの プレイリスト を同期します。 ディスプレイ は、まず 同期グループ に割り当てる必要があります。 メイン CMS メニューの ディスプレイ セクションの 同期グループ をクリックします。 同期グループの追加 ボタンを選択します。 同期グループは フォルダー に保存でき、ディスプレイのユーザー\/ユーザー グループ レベルのインタラクションを簡単に制御できるほか、整理するための追加の方法も提供されます。 同期グループ内のすべてのディスプレイは、指定されたパブリッシャー ポートで TCP 経由で LAN IP アドレスを使用して通信する必要があります。これはデフォルトで 9590 に設定されていますが、そのポートが予約されている場合は変更できます。 最適な同期のために、有線ネットワークと高性能の同様のデバイスを使用することをお勧めします。 保存時に、 メンバーシップの管理 フォームを使用して、このグループに含めるディスプレイを選択します。 注意: ディスプレイは、同時に 1 つの同期グループにしか属せません。 保存時に、編集フォームのドロップダウンを使用して、同期グループの リード ディスプレイ にするディスプレイを選択します。 保存 をクリックして メインの CMS メニューから スケジュール をクリックし、 同期イベントの追加 を選択すると、コンテンツを同期グループにスケジュールできるようになりました。 メンバーシップの編集\/管理 行メニューを使用して同期グループを管理します。 代替リード ディスプレイを設定するには、 編集 を選択します グループのメンバーであるディスプレイを管理するには、 メンバー を選択します。 次へ… 同期イベントのスケジュール設定",
        "page_url": "output\/ja\/displays_sync_groups.html"
    },
    {
        "id": "index",
        "content": "Sigme ユーザー マニュアル リビジョン: 4 Sigme ソフトウェアは、コンテンツが作成\/アップロードされ、ディスプレイにスケジュールされる中央の コンテンツ管理システム (CMS) で構成されています。 プレーヤー アプリケーションは、CMS から新しいコンテンツをダウンロードし、画面に表示するスケジュールを設定します: プレーヤー アプリケーションは、各画面に接続されたハードウェア上で実行されます。 プレーヤーは定期的に CMS に接続し、ダウンロードする必要がある新しいコンテンツや編集されたコンテンツ、スケジュールを確認します。 このユーザー ドキュメントは、コア コンセプトと CMS 機能を網羅し、Sigme の機能をユーザーに説明して紹介するために作成されました。ページは、CMS 内でのユーザー ロールに一致する関連ドキュメントを簡単に見つけられるように、明確で整然としたセクションに分類されています。 すべてのユーザーは、このマニュアルの ツアー セクションから始めることをお勧めします。これにより、ユーザーが 初回アクセス を行い、 CMS の操作 を開始するのに役立ちます。 重要: このユーザー マニュアルでは、CMS 内のすべての 機能と共有 オプションに完全にアクセスできる スーパー管理者 として、CMS の完全な概要を説明します。ユーザー アクセスに関して質問がある場合は、管理者にお問い合わせください。 全ての人にデジタルサイネージを！ Sigme は、スキル レベルや技術的知識に関係なく、「全ての人にデジタルサイネージを！」を基本理念とする柔軟で強力なアプリケーションを提供します。 Sigme ソフトウェアは、次の 5 つのコア コンセプトを中心としています: ユーザー ユーザー は管理者によって CMS に追加され、安全にログインするための ユーザー名 と パスワード が付与されます。 企業環境では、Sigme を Active Directory や ADFS などの SAML ID プロバイダーと統合することもできます。 Sigme は、3 つの ユーザー タイプ に加えて、 ユーザー グループ と、CMS 内のすべてのシステムおよびユーザー オブジェクトへのマルチレベルの 機能と共有 アクセスをサポートしています。 ディスプレイ ディスプレイ は、プレーヤーから CMS への接続であり、コンテンツとスケジュール情報をグループ化します。各ディスプレイは CMS で一意に識別されるため、各ディスプレイには独自の メディア コンテンツ、 レイアウト デザイン、 スケジュール が用意され、それぞれが一意に識別された レポート 統計情報とともに利用できます。 メディア メディアはディスプレイに表示するコンテンツで、通常は次の 2 つのカテゴリに分けられます。 ファイル ベースのメディア - ライブラリ にアップロードされ保存されるメディア (画像やビデオ ファイルなど) レイアウト ベースのメディア - レイアウトに直接構成されたメディアで、関連付けられたファイルはありません (RSS フィードや天気予報など) Sigme は、さまざまなソースからの動的なサードパーティ コンテンツを統合する強力な ウィジェット を使用します。 レイアウト レイアウト は、ディスプレイに表示される完全なコンテンツ デザインです。強力な レイアウト エディタ を使用すると、ユーザーは Sigme CMS を離れることなく、目を引くコンテンツを簡単に作成できます。その後、レイアウトを キャンペーン に追加して、スケジュール時に順番に再生することができます。 スケジュール スケジュール は非常に柔軟で、単一のディスプレイだけでなく ディスプレイ グループ へのスケジュールもサポートしています。ディスプレイは、スケジュールされた新しいコンテンツを定期的にチェックし、再生前に新しいアイテムをダウンロードします。 デフォルト レイアウト は、他に何もスケジュールされていない場合に表示されるようにディスプレイに割り当てる必要があります。 コア ワークフロー Sigme では、ユーザーに 2 つの主要なワークフロー オプションが提供されます: レイアウト エディター からコンテンツを作成する ビデオ \/ 画像 ファイルまたは保存された プレイリスト を選択して直接 スケジュール : 次へ… 初めてのユーザー アクセス",
        "page_url": "output\/ja\/index.html"
    },
    {
        "id": "layouts",
        "content": "レイアウト レイアウトは、コンテンツで構成された完全な画面デザインであり、1 つまたは複数のディスプレイにスケジュールされます。レイアウトには、要素、ウィジェット、ライブラリ メディアの組み合わせを使用して表示する 1 つ以上のコンテンツ項目を含めることができます。 レイアウトで複数の項目のシーケンス (画像スライドショーなど) を表示するには、 プレイリスト を使用します。 Sigme では、システムで使用できるレイアウトの数や、ユーザーが使用できるレイアウトの数に制限はありません。 レイアウトの追加 メイン CMS メニューの [デザイン] セクションで [レイアウト] を選択します。 グリッドの上部にある [レイアウトの追加] ボタンをクリックして、 レイアウト エディタ を使用してデザインの作成を開始します。 ご存知ですか… .Layouts と ライブラリ ファイル は、 ディスプレイ または ディスプレイ グループ に直接 割り当て できるため、プレーヤーのローカル ライブラリでいつでも使用できます。事前にレイアウトをプリロードして、スケジュールできるようにしておくのに便利です。 解像度 レイアウトは、意図したディスプレイ解像度に合わせて設計されており、一致する解像度のディスプレイで表示されると最適に機能します。異なる解像度のディスプレイに表示される場合は、動的にサイズが変更されるため、画面スペースが使用されない可能性があります。 16:9 のテレビ画面に接続された 4:3 解像度で設計されたレイアウトをプレーヤーに送信すると、コンテンツの両側に 2 つの空のバーが表示されます。 レイアウトの解像度は、 レイアウト エディタ 内のプロパティ パネルから選択します。 Sigme には、ほとんどのデジタル サイネージ アプリケーションに対応するデフォルトの解像度の選択肢が用意されています。 管理者は、メイン CMS メニューの [ デザイン ] セクションの [ 解像度 ] ページから解像度を追加\/編集したり、有効\/無効にしたりできます。 テンプレートの使用 テンプレート は、デザイン プロセスを高速化する簡単な方法であり、企業のイメージ\/標準を維持するのに最適です。 テンプレートは、レイアウト エディター内の ツールボックス から選択されます。 テンプレートを選択すると、現在作業中のレイアウトが選択したテンプレートに置き換えられます。(この操作は元に戻せないため、注意して使用する必要があります) 公開されたレイアウト もテンプレートとして保存できます。 レイアウト グリッド 作成されたレイアウトは、メイン CMS メニューの [ デザイン ] セクションの [ レイアウト ] から表示できます。 各レイアウトには、アクション\/ショートカットのメニューにアクセスするための行メニューがあります。このリストは、レイアウトがドラフト状態か公開状態かによって異なります。以下に注目すべき設定を示します。 [編集] をクリックすると、名前、フォルダ、タグなどを変更するためのフォームが開きます。 レイアウト グリッド の下部にある [ 選択済み ] オプションを使用して、タグの割り当てを一括編集します。 ドラフト ステータスのレイアウト デザイン - レイアウト エディタを開いてレイアウトを編集します。 公開 - 今すぐ公開するか、将来の公開日時を選択します。 管理者は、CMS 設定 ページのデフォルト設定を使用して、最後の編集から 30 分後にドラフト レイアウトを自動的に 公開 できます。 破棄 - すべての変更が破棄され、レイアウトは以前の公開バージョンに戻ります。 ドラフト レイアウトのプレビュー - 現在の ドラフト ステータスのレイアウトのプレビューを再生します。 公開ステータスのレイアウト デザイン - レイアウトを 読み取り専用モード で開き、レイアウトをチェックアウトして編集を有効にします。 チェックアウト - レイアウトを編集するための下書きを作成します。 ユーザーは「自動送信」チェックボックスをオンにして、 チェックアウト が選択されるたびにこのフォームが 自動的に送信 されるようにすることができます。 キャンペーンに割り当て - レイアウトを既存の キャンペーン に追加します。 コピー - 簡単に変更できるようにコピーを作成します。含まれるすべての メディア アイテムを含めるように選択して、新しいレイアウトを作成するためのベースとして使用し、時間を節約します。 レイアウトをコピーすると、レイアウトが最後に公開された時点の正確なコピーが作成されます。変更内容を保存するには、コピーを作成する前にレイアウトを公開してください。 廃止 - レイアウトを廃止しても、レイアウトに関連付けられている既存のキャンペーン\/スケジュールには影響しません。廃止されたレイアウトは新しいスケジュール オプションからは非表示になりますが、既存のスケジュールには影響せず、ディスプレイには引き続き表示されます。 エクスポート - 関連するすべてのウィジェット\/メディア\/データセット構造を ZIP ファイルに含めて、簡単に共有できるようにします。 レイアウトをエクスポートすると、割り当てられたすべての レイアウト 、 プレイリスト 、および メディア タグ がエクスポートされます。レイアウトのインポート時にこれらのタグを追加するには、[タグのインポート] オプションを選択します。 ‘エクスポート’ 機能 を追加すると、レイアウトとそのコンテンツに設定されている共有オプションに関係なく、ユーザー\/ユーザー グループがエクスポートできるようになります。 FAQ ユーザーはいつ新しいレイアウトを作成する必要がありますか? ユーザーはいつ既存のレイアウトに追加する必要がありますか? レイアウトは、システムで非常に柔軟に機能します。レイアウトの推奨される使用方法は、同時にスケジュールする必要がある一連の関連コンテンツに必要なデザインとメディアのみを含めることです。 シナリオ : 火災安全のデモンストレーションを示すビデオと重要なテキスト、および今後の制作の広告を示すビデオと画像がある場合、これらに別々のレイアウトを用意するのが自然です。 作成できるレイアウトの数に制限はありますか? Sigme では、システムで使用できるレイアウトの数や、ユーザー\/ユーザー グループが使用できるレイアウトの数に制限はありません。 廃止されたレイアウトを表示するにはどうすればいいですか? レイアウト グリッドから、[詳細] タブの [廃止] フィルターを使用します。行メニューを使用して、レイアウトを廃止解除します。 次へ… レイアウト エディター",
        "page_url": "output\/ja\/layouts.html"
    },
    {
        "id": "layouts_ad_campaigns",
        "content": "広告キャンペーン Sigme が入力した基準を満たすために必要な再生回数を計算し、自動的にスケジュール設定を処理する広告キャンペーンを作成します。 この機能にフルアクセスできる各ユーザー\/ユーザー グループに対して、 広告キャンペーンへのアクセス 機能 を有効にします。 広告キャンペーンを作成する メイン CMS メニューの デザイン セクションの キャンペーン をクリックします。 グリッドの上部にある キャンペーンの追加 ボタンをクリックします。 ドロップダウン メニューから [ 広告キャンペーン ] を選択し、フォーム フィールドに入力します: フォルダー は、ユーザー オブジェクトを整理、検索し、他のユーザー\/ユーザー グループと簡単に 共有 するために使用されます。フォルダーに保存された広告キャンペーンは、そのフォルダーに適用されたアクセス オプションを継承します。 ユーザーがレイアウト\/レイアウト コンテンツにもアクセスできるようにする場合は、これも同じフォルダーに保存してください。 CMS で簡単に識別できるように、広告キャンペーンに タグ を含めた 名前 を付けます。 タグとフォルダは、キャンペーン グリッドの下部にある 選択されたもの オプションを使用して、複数のキャンペーンに割り当てることもできます。 ドロップダウンを使用して、この広告キャンペーンの ターゲット タイプ を 再生 、 予算 、または インプレッション に設定します。 選択したターゲット タイプに関連して、この広告キャンペーンの合計 ターゲット 数を含めます。 [ 保存 ] をクリックします。 次に、Sigme が再生頻度を計算できるように条件を設定する必要があります。 グリッドから、 広告キャンペーン の行メニューを使用して、[ 編集 ] を選択します: 広告キャンペーンの 開始 および 終了 の日付と時刻を入力します。(これは必須の情報であり、 空白のままにすることはできません ) この広告キャンペーンを再生する利用可能な ディスプレイ および ディスプレイ グループ を選択します。(これは必須の情報であり、 空白のままにすることはできません ) ディスプレイ で、この広告キャンペーンを再生する選択したディスプレイの ディスプレイの詳細 が正しく入力されていることを確認し、 再生あたりのコスト および 再生あたりのインプレッション数 フィールドが入力されていることを確認してください。 [ 保存 ] をクリックします。 正確なレポートと再生を確実に行うには、ここで選択したすべてのディスプレイ\/ディスプレイ グループで 再生の証明 を オン に設定する必要があります。 レイアウトの追加 ドロップダウン メニューを使用してレイアウトを割り当てます。 レイアウトを選択すると、さらにスケジュール オプションが利用可能になります: この広告キャンペーンでこのレイアウトをアクティブにする 曜日 を選択します。 このレイアウトを特定の定義済みの時間にのみ表示する場合は、既存の 時間帯 から選択します。 広告キャンペーンには、必要に応じて異なる時間帯が割り当てられた同じレイアウトの複数のインスタンスを含めることができます。 たとえば、定義済みの「午前」時間帯と定義済みの「夕方」時間帯に同じレイアウトを表示する必要がある場合は、レイアウトを 2 回追加し、それぞれに必要な時間帯を個別に定義します。 マップ上にエリアを描画して、モバイル ディスプレイに ジオフェンス ベースの再生を提供し、定義されたエリアに入るとコンテンツが表示されます。 同じマップに複数のエリアを定義できます。 保存 をクリックして。 レイアウトがキャンペーンに追加され、必要に応じて行メニューを使用して編集\/削除できます。 レイアウトを選択し、スケジュール オプションを定義して、広告キャンペーンの作成を続けます。 正確なレポートと再生を確実に行うには、広告キャンペーンに追加されるすべてのレイアウトで 再生の証明 を オン に設定する必要があります。 Sigme は、入力されたターゲットを満たすために必要な再生基準を満たすように自動的にスケジュールします。 広告キャンペーンは、 スケジュール でロックされたエントリとして表示できます。このエントリは、スケジューラ自体からは編集できません。 アジェンダ を使用すると、広告キャンペーンのより詳細な再生ビューを表示し、含まれるレイアウトをプレビューできます。 広告キャンペーンの進行状況は、キャンペーン グリッドと広告キャンペーンを開いたときに表示されます。ただし、キャンペーン用に選択されたすべてのディスプレイとレイアウトで再生証明がオンに設定されている必要があります。また、選択されたすべてのディスプレイで再生あたりのコストと再生あたりのインプレッションのフィールドが入力されています。 注意 : 上記の情報が省略されている場合、レポートは再生、支出、インプレッション、ターゲットを反映するように更新できず、すべて 0 値が表示されます。広告キャンペーン自体もターゲットの増加に追いつこうとするため、レイアウトがますます頻繁に再生され、目標を達成するために表示されるコンテンツがレイアウトのみになります。 [参照] タブを使用すると、選択したキャンペーンの参照情報を提供できます。追加すると、この情報はキャンペーン グリッドと API 経由で表示できます。",
        "page_url": "output\/ja\/layouts_ad_campaigns.html"
    },
    {
        "id": "layouts_campaigns",
        "content": "キャンペーン Sigme には 2 つの キャンペーン タイプがあります: レイアウト リスト - 順序付きリスト内のレイアウトのコレクション。 広告キャンペーン - 広告キャンペーンを作成できます ( 機能 が有効)。 レイアウト リストを作成する レイアウト リスト キャンペーン を使用すると、ユーザーは、定義された順序でレイアウトのグループの再生を設定できます。 レイアウトをプレゼンテーション デッキの 1 つのスライドと考えると、キャンペーンはプレゼンテーション全体です。 メイン CMS メニューの [ デザイン ] セクションの [ キャンペーン ] をクリックします。 グリッドの上部にある [ キャンペーンの追加 ] ボタンをクリックします。 ドロップダウンから レイアウト リスト を選択し、フォーム フィールドに入力します: フォルダー は、ユーザー オブジェクトを整理、検索し、他のユーザー\/ユーザー グループと簡単に 共有 するために使用されます。フォルダーに保存されたキャンペーンは、そのフォルダーに適用されたアクセス オプションを継承します。 ユーザーがレイアウト\/レイアウト コンテンツにもアクセスできるようにする場合は、これも同じフォルダーに保存してください。 CMS で簡単に識別できるように、キャンペーンに 名前 を付けます。オプションの タグ も含めます。 タグとフォルダは、キャンペーン グリッドの下部にある 選択済み オプションを使用して、複数のキャンペーンに割り当てることもできます。 サイクル ベースの再生 サイクル ベースの再生 を有効にして キャンペーン をスケジュールすると、設定された再生回数に対して 1 つのレイアウトが表示されます。再生回数が達成されるまで、スケジュール ループごとに同じレイアウトが表示されます。 有効にしたら、 再生回数 を指定して、キャンペーン内の次のレイアウトに移動する前にレイアウトを何回「再生」するかを決定します。 リスト再生順序 サイクル ベース再生が有効になっていないキャンペーンの場合、 リスト再生順序 オプションを使用して、同じ表示順序の別のキャンペーンと同時にスケジュールされたときに、キャンペーンに割り当てられたレイアウトがどのように再生されるかを指定できます。 ラウンド ロビン - 各キャンペーンのレイアウトが交互に再生されます。 ブロック - レイアウトは、キャンペーンから完全に再生されてから、次のキャンペーンに移動します。 キャンペーンにレイアウトを追加する 保存 すると、フォームが再度開き、追加のタブが表示されます。 レイアウト タブを使用して、追加するレイアウトを選択します。 + アイコンを使用して、追加する レイアウト を選択します。 選択したレイアウトは、フォームの上部にある「ステージング領域」に追加されます。 レイアウトはここからドラッグ アンド ドロップで 並べ替え できます。 レイアウトを削除するには、 - アイコンをクリックします。 変更を保存するには、 保存 をクリックします。 [参照] タブを使用すると、選択したキャンペーンの参照情報を提供できます。追加すると、この情報はキャンペーン グリッドと API 経由で表示できます。 キャンペーン グリッドの行メニューを使用すると、キャンペーンのコピーを簡単に作成できるほか、選択したユーザー\/ユーザー グループの 共有 オプションを有効にできます。 レイアウトは、 レイアウト グリッドからキャンペーンに直接割り当てることができます。レイアウトの行メニューを使用して追加し、[ キャンペーンに割り当て ] をクリックします。レイアウトは、デフォルトで選択したキャンペーンの最後に割り当てられます。",
        "page_url": "output\/ja\/layouts_campaigns.html"
    },
    {
        "id": "layouts_editor",
        "content": "レイアウト エディタ レイアウト エディタは、Sigme における コンテンツ作成 の中心です。新しいレイアウトが追加されるたびに、または既存のレイアウトのデザイン変更が必要になるたびに、レイアウト エディタが使用されます。 {version} テンプレート を選択すると、現在作業中のレイアウトが選択したテンプレートに置き換えられます。この操作は元に戻せないため、注意して使用する必要があります。 } レイアウト コンテンツの配置 柔軟なドラッグ アンド ドロップ、回転、サイズ変更ツールを使用して、コンテンツを必要な場所に正確に配置します。 右下の [スナップ ボタン] を使用して、 グリッドにスナップ 、 境界線にスナップ 、または 要素にスナップ を選択すると、レイアウトにアイテムを追加するときに簡単に配置できます。 レイアウトに追加された複数のアイテムをブロックで移動します。 背景をクリックして押したままにします。 ドラッグして四角形のアウトラインを作成します。 移動する必要があるすべてのアイテムが四角形内に含まれていることを確認します。 クリックすると、レイアウト上のアイテムのブロックの位置が変更されます: ブロックの外側の任意の場所をクリックすると、配置した個別のアイテムに戻ります。 レイヤーコントロール 左下にある レイヤーコントロール から、レイアウトに追加されたすべてのアイテムのレイヤーとアイテムの持続時間を表示します: レイヤーコントロールを使用すると、他のアイテムの背後に配置されているアイテムを簡単に選択して編集できます! コンテキスト メニュー レイアウトに追加されたアイテムには、選択したアイテムを右クリックするとアクセスできる追加のメニューがあります: 表示されるオプションは、選択したアイテムによって異なります! ウィジェットには、ウィジェット名\/タイプの下に表示される追加のオプションがあります: オプションには、 オーディオ ファイルをウィジェットに添付することや、 共有 オプションを制御して、ユーザー\/ユーザー グループの選択したアイテムを表示、編集、削除することが含まれます。 プレビュー 再生 ボタンをクリックして、レイアウトの完全な プレビュー を再生します。 レイアウトを開始する前に、すべての メディア をブラウザにダウンロードして検証する必要があります。この処理中は若干の遅延が発生する場合があります。 再生を押す前に、プレビュー ウィンドウの右上隅にあるアイコンをクリックして全画面で表示してください。",
        "page_url": "output\/ja\/layouts_editor.html"
    },
    {
        "id": "layouts_editor_data_widgets",
        "content": "データ ウィジェット データ ウィジェットは、 要素 を使用してレイアウトに情報を表示するために外部データ ソースに依存します。 機能の概要 データ ソース駆動型コンテンツ。 個別の要素により柔軟性が実現します。 表示するフォールバック データを提供します。 データ スロットを使用してデータのページングを制御します。 簡単に複製できるようにグループを作成します。 同じレイアウト上の代替ソースからデータを取得します。 事前に作成されたデザインを活用します。 各データ ウィジェットには、データ ソースによって供給される一連の 要素 があり、ユーザーは、厳格な 静的テンプレート 設計に縛られることなく、返されるデータの配置を柔軟に行うことができます。 データ ウィジェット をクリックすると、使用可能なすべての 要素 が表示されます。 注: データ要素はレイアウト エディターからのみ使用でき、 プレイリスト エディター では使用できません。ただし、ユーザーは静的テンプレートを使用してデータ ウィジェットを追加できます。 } 構成 各要素には、追加された後に プロパティ パネル から利用できる構成可能なオプションのセットがあります: 感嘆符アイコンが表示され、ユーザーに何をすべきかが示されます。上記の例では、ICS フィードの URL がまだ入力されていません! 構成 タブから設定されたオプションは、同じウィジェット タイプのレイアウトに追加されたすべての要素に適用されます。 ウィジェットに関連付けられた代替データ ソースからデータを選択するには、 新しい構成 を作成します! 外観 外観 タブには、要素から返されるデータの外観を構成するオプション、およびトランジション効果と データ スロット 構成が含まれています。 フォールバック データ 選択したデータ ウィジェットの フォールバック データ を作成し、どのような条件でそれを表示するかを指定します: [ 新規追加 ] をクリックします。 フォーム フィールドに必要な情報を入力します。 保存します。 フォールバック データ オプションは、選択したデータ ウィジェットによって異なります。 詳細 [詳細] タブは、名前の設定、特定の期間の指定、再生証明統計の収集レベルの設定、アイテムを繰り返してすべての データ スロット を埋めるために使用します。 配置 [ 配置 ] タブ (グリッド アイコン) を使用して、正確な配置とレイヤーを設定します。 要素には独自のキャンバス レイヤー があり、これを使用して、プレイリストやビデオなどの他のネイティブにレンダリングされた要素との関係で要素が表示される場所を決定できます。 データ スロット 同じ 要素 を複数追加する場合は、各要素に使用する データ スロット を指定して、返されるデータのページングを処理します。 たとえば、上の画像では、 カレンダー ウィジェット から 2 つの 説明要素 が追加されています。1 つの データ スロットは 1 で、もう 1 つの データ スロットは 2 です。10 個の (カレンダー イベント) 項目が返された場合、データ スロット 1 には項目 1、3、5、7、9 が表示され、データ スロット 2 には項目 2、4、6、8、10 が表示されます。 データ スロットは、選択した要素の プロパティ パネル の 外観 タブから設定されます。 同じ要素を複数追加すると、 データ スロット の数が自動的に増加します。 さらに、要素には このスロットを固定 するオプションがあり、そのスロットに表示される最初のデータ項目がウィジェットの継続時間全体にわたって維持され、データ項目が循環することはありません。 ユーザーは、プロパティ パネルの [ 詳細 ] タブのチェックボックスを使用して、すべてのデータ スロットを埋めて空のスロットがないようにするために 項目を繰り返す かどうかを設定できます。 要素のグループ化 同じデータ ウィジェットの要素をグループ化して、デザインの構築を容易にします。 [ 外観 ] タブを使用して、レイアウト、位置、スタイルに要素を追加します。 Shift キーを押したまま、グループ化する各要素をクリックします。 選択したら、Shift キーを放して右クリックします。 [ 要素のグループ化 ] を選択します。 グループには グローバル要素 を含めることもできます。 注意: グループ化する場合、すべてのデータ要素は同じ データ スロット と 効果 を共有する必要があります! グループは簡単に複製できます: 右クリックして 複製 を選択します。 各グループの データ スロット を編集して、データのページングを制御します: グループ内の各要素の 外観 を編集します: 右上隅の鉛筆アイコンをクリックします。 各要素をクリックし、[外観] タブを使用して変更を行います。 グループ外をクリックするか、[X] をクリックして編集を終了します。 構成 を編集できますが、追加されたすべての要素に適用されます。 右クリック メニューから要素をグループ解除します。 新しい構成 ウィジェットに別の構成オプション\/別のデータ ソースを関連付けるために、新しい構成を作成できます。 要素または要素グループを右クリックし、メニューから [新しい構成] を選択します。 [構成] タブから別のデータ ソース\/別の構成を選択します。 ステンシル 選択したデータ ウィジェットには、 ステンシル と呼ばれる要素グループの既成のデザインが含まれており、ユーザーがコンテンツを簡単かつ迅速に作成するのに役立ちます。 ステンシルはまったく同じ方法で追加され、配置およびサイズ変更されます。 構成 のフィールドに入力します。 - グループの右上にある鉛筆アイコンをクリックして、 外観 を編集します。 グループ内の要素を選択して編集します。 さらにカスタマイズするには、右クリックしてグループを解除します。 静的テンプレート 静的テンプレートは特定のウィジェットに含まれています。テンプレートは、返される結果の動作に影響を与えたり、スタイル オプションを変更したりするように構成できます。 高度な使用方法として、メイン CMS メニューの 開発者 セクションから HTML\/CSS と JavaScript を使用して、データ ウィジェットで使用するための モジュール テンプレート を作成できます。",
        "page_url": "output\/ja\/layouts_editor_data_widgets.html"
    },
    {
        "id": "layouts_editor_global_elements",
        "content": "グローバル要素 さまざまなグローバル要素から選択してレイアウトに追加し、目を引くデザインを作成し、他のコンテンツを強化します。 {nonwhite}{video}4NxcXfiKBfM{\/video}{nonwhite} 機能の概要 レイアウト デザインを強化します。 配置とサイズ設定の柔軟性。 スタイルと外観を適切なものに構成します。 レイアウト上のすべてのウィジェット\/データ要素と互換性があります。 レイアウトにテキストを簡単に追加します。 さまざまな図形と線から選択して、デザインを目立たせます。 グローバル要素は、レイアウト エディター内の ツールボックス からアクセスできます。 要素をドラッグ アンド ドロップするかクリックして、キャンバスをクリックして追加します。 位置とサイズを変更します。 プロパティ パネル からスタイルを設定します。 テキスト を直接編集するには、レイアウト上のテキスト要素をダブルクリックして、テキスト ボックスに入力します。この要素を右クリックすると、プロパティ パネルからではなく直接編集するための テキスト編集 オプションも表示されます。 グローバル要素は単独で使用することも、レイアウトに既に追加されている既存のコンテンツを補完するために使用することもできます。 グローバル要素はレイアウト エディターからのみ使用でき、プレイリスト エディターでは使用できません。 レイヤー コントロール を使用してドラッグし、図形を他のコンテンツの背後に簡単に配置したり、グローバル要素を右クリックして 送信\/移動 オプションを使用したりできます。 要素には独自のキャンバス レイヤー があり、これを使用して、プレイリストやビデオなどの他のネイティブにレンダリングされた要素との関係で、要素がどこに表示されるかを決めることができます。",
        "page_url": "output\/ja\/layouts_editor_global_elements.html"
    },
    {
        "id": "layouts_editor_library_search",
        "content": "ライブラリ検索 ライブラリ検索機能を使用して、 CMS ライブラリ にすでに存在するメディアをレイアウト\/プレイリストに追加します。 {nonwhite}{video}yOd7QVuF16g{\/video}{nonwhite} ライブラリ メディアは次のものから構成されます: 画像 オーディオ ビデオ その他のメディア ファイル その他のメディア 検索には、 Flash 、 HTML パッケージ 、 PDF 、 PowerPoint ファイルが含まれており、[ タイプ ] ドロップダウン メニューから選択できます。 使用可能なフィルターを使用して検索を絞り込みます。 ドラッグまたは選択してハイライトし、追加するレイアウトをクリックします。 配置とサイズを変更します。 構成オプションはプロパティ パネルに表示されます。 選択したタイプの新しいファイルもここから追加できます: 追加するメディア タイプのライブラリ検索をクリックします。その他のメディア検索を使用してファイルを追加する場合は、ドロップダウンからファイル タイプを選択していることを確認してください。 レイアウトに [ アップロード ] をドラッグまたはクリックします。 ファイルを追加し、必要に応じてフォルダーを選択して [ アップロード ] します。 [ 完了 ] をクリックすると、ファイルが追加され、配置\/サイズ変更と構成の準備が整います。 レイアウト\/プレイリストに直接アップロードされたファイルは、CMS ライブラリに自動的に追加されます。 リモート検索 Pixabay からの統合により、レイアウト エディターを離れることなくレイアウトに追加できる画像ファイルとビデオ ファイルへの追加リソースがユーザーに提供されます。 Pixabay 統合は、Xibo in the Cloud の新規顧客に対してデフォルトで有効になっています。 以前のバージョンからアップグレードする場合は、CMS の 管理 セクションに移動して アプリケーション をクリックして有効にする必要があります。ページを下にスクロールして コネクタ セクションに移動します。 構成 をクリックして有効にするにはチェックを入れ、変更を 保存 します。 Pixabay は、CMS メニューの 管理 セクションで アプリケーション をクリックし、ページを下にスクロールして コネクタ セクションに移動することで有効にできます。Pixabay アカウントにサインアップした後、構成をクリックして API キーを入力します。 PixabayAPI ドキュメント Pixabay をクリックし、検索するファイルの タイプ を選択します。 名前フィールドに検索条件を入力して結果を返します。 ドラッグまたはクリックして追加、配置\/サイズ変更、および構成を行います。 サムネイルの右上にある矢印をクリックすると、別のウィンドウでプレビューが再生されます。このウィンドウは、左上の矢印を使用して拡大することもでき、上部の + ボタンをクリックしてここからレイアウトに追加することもできます。 Pixabay から使用するために選択された画像\/ビデオは、ライブラリに自動的に追加され、画像\/ビデオ ライブラリ検索機能から将来使用できるようになります。",
        "page_url": "output\/ja\/layouts_editor_library_search.html"
    },
    {
        "id": "layouts_editor_playlists",
        "content": "プレイリスト プレイリストは、メディア アイテムのシーケンス (画像スライドショーなど) を表示するために使用されます。プレイリストを作成するには、次の 2 つの方法があります: レイアウト エディターからレイアウトに直接 プレイリストを追加 します。ローカル プレイリストは、グローバル プレイリストとして再利用できるように変換して保存できます。保存したプレイリストはレイアウト エディタに表示され、レイアウトに追加できます。 レイアウトとは独立して プレイリスト を作成します。グローバル プレイリストは、レイアウトを作成しなくてもディスプレイにスケジュールできます。レイアウト エディタの外部で作成されたプレイリストは、レイアウト エディタの [プレイリストの追加] 機能から選択できます。 プレイリストの追加 レイアウト エディタ から新しいプレイリストを作成するか、既存のプレイリストを選択して、レイアウトに表示するコンテンツのタイムラインを作成します。 機能の概要: レイアウト上で直接作成および構成します。 レイアウト上で作成されたプレイリストをグローバル プレイリストに変換して、後で使用できるように保存します。 1 つ以上のプレイリストに保持されているコンテンツの「スライドショー」を簡単に表示します。 同期イベントの一部である他のレイアウト上のプレイリストと同期します。 さまざまなプレイリストからコンテンツを組み合わせて表示します。 プレイリストから表示するアイテムの最大数を設定します。 プレイリストの各アイテムが次のアイテムに移動する前に表示される時間を制御します。 プレイリストに追加されたメディア アイテムの有効期限を設定します。 指定された再生回数ごとに 1 つのアイテムを再生します。 各サイクルで再生するランダム ウィジェットを選択します。 ビューアでプレイリストに含まれるアイテムを循環して、シーケンスを簡単に確認します。 レイアウトへのプレイリストの追加 レイアウト エディター で、 ツールボックス から プレイリストの追加 をクリックします。 新しいプレイリスト または既に作成されている名前付きプレイリストをクリックして追加するか、ドラッグします。 サイズ変更と配置: プロパティ パネル から、 コンテンツ同期キー を使用して他のレイアウトのプレイリストと同期します。レイアウトが 同期イベント としてスケジュールされると、同じキーを持つプレイリストが同期されます。 シナリオ: 3 つのディスプレイと 3 つの異なるレイアウトを持つ同期イベントがあります。各レイアウトの上部にはテキストがあり、中央には 3 つすべてが同期して再生される必要があるプレイリストがあります。 また、2 つの異なるプレイリストを異なる方法で同期するように設定することもできます。たとえば、 sync_1 と sync-2 に設定できます。 必要に応じて、プロパティ パネルからプレイリストのアイテムの トランジション を設定します。 デフォルトのトランジションが適用されると、プロパティ パネルは空白になります。フォームには手動で入力したトランジションのみが表示されます。 レイアウトのプロパティ パネルで [トランジションを自動的に適用する] チェック ボックスをオフにすると、デフォルトを上書きできます。 {\/ プレイリストの右隅にあるアイコンをクリックして プレイリスト エディター を開き、コンテンツを追加して構成します。 プレイリスト エディター には、プレイリストでのみ使用できる スペーサー ウィジェットと リッチ テキスト ウィジェットが含まれています。 プレイリストに追加されたメディアには、 有効期限 を使用して開始時間と終了時間を設定することができます。 注: すでに作成されている名前付きプレイリストを追加すると、プレイリストに加えられた編集は、プレイリストが現在使用されているすべての場所に適用されます。 上部の [ 戻る ] ボタンをクリックしてプレイリスト エディターを終了し、レイアウト エディターに戻ります。 レイアウト上のプレイリストの右下にある矢印を使用して、プレイリストのタイムラインに追加されたすべてのコンテンツを表示します。 コンテンツの順序を切り替えます: プレイリストの変換 レイアウトに 新しいプレイリスト を追加すると、これを保存済みのプレイリストに変換できます。変換されたプレイリストは、レイアウト エディターのプレイリスト選択と プレイリスト グリッドに表示されます。 レイアウト上のプレイリストをクリックして選択し、 プロパティ パネル の 一般 タブから 名前 を付けます。 右クリックして、メニューから プレイリストの変換 を選択します。 レイアウト エディターの下部に、プレイリストがグローバル プレイリストとして保存されたことを示すポップアップ メッセージが表示されます。 [さらに表示] ボタンをクリックすると、使用可能なプレイリストのリストにプレイリストが追加されます。 変換されたプレイリストは プレイリスト グリッド に保存されます。 プレイリストに追加 レイアウトに 新しいプレイリスト がある場合は、タイムラインに新しいプレイリストまたはグローバル プレイリストを追加して、プロパティ パネルでさらに設定オプションを開くことができます。 プロパティ パネルから複数のプレイリストを選択して 埋め込み する場合は、プレイリスト、スポット オプション、プレイリストの順序を選択します。 レイアウトの 新しいプレイリスト に プレイリスト を追加すると、ランダム ウィジェット機能を含む追加の サイクル ベース再生 オプションが使用できます。 再生順序を結合するために複数のプレイリストを追加する場合は、タイムラインにプレイリストを 1 つだけ追加し、プロパティ パネルのオプションを使用して追加のプレイリストを選択して構成することをお勧めします。 サイクル ベースの再生 有効にすると、選択したすべてのプレイリストが 1 つの「リスト」として扱われ、レイアウトが再生されるたびに 1 つのウィジェットのみが表示され、追加されたすべてのプレイリストからのコンテンツが循環します。 プロパティ パネルでサイクル ベースの再生を有効にするにチェックを入れます。 再生回数 を指定して、プレイリストの各ウィジェットがタイムラインの次のウィジェットに移動する前に再生する回数を決定します。 サイクルごとにランダム ウィジェット オプションを使用すると、サイクルごとにタイムラインからウィジェットがランダムに再生されます。 注: これらの追加オプションは、レイアウトに直接追加された グローバル プレイリスト タイムラインに 1 つ以上のプレイリストを追加する場合には 利用できません 。 レイアウトとは独立して作成および管理される プレイリスト では、コンテンツを追加および管理するためにレイアウトまたはレイアウト エディターへの追加のユーザー アクセス権は必要ありません。 これらのグローバル プレイリストは、最初にレイアウトを作成して追加することなく、直接 スケジュール することもできます。",
        "page_url": "output\/ja\/layouts_editor_playlists.html"
    },
    {
        "id": "layouts_editor_publish_options",
        "content": "レイアウトの公開 レイアウトのデザインが完了したら、スケジュールする前にレイアウトを 公開 する必要があります。ステータス バーの右端にあるメニューを使用して、レイアウトのすべてのオプションを表示します: 表示されるオプションは、レイアウトが 下書き または 公開済み のどちらのステータスであるかによって異なります。 下書きを破棄 すると、以前の公開バージョンに戻り、すべての変更が破棄されます。 レイアウトをすぐに 公開 して、すでにスケジュールされているレイアウトに更新を自動的にプッシュできます。 公開日 を設定して、公開する特定の日時を決定できます: 管理者は、CMS 設定 ページのデフォルト設定を使用して、最後の編集から 30 分後にドラフトレイアウトを自動的に 公開 できます。 公開日 の設定は、スケジュール設定の代わりにはなりません。公開されたレイアウトは、引き続き スケジュール設定 する必要があります! チェックアウト 公開されたレイアウトは、チェックアウトを選択してレイアウトの下書きを作成することで編集できます。 ユーザーは「自動送信」チェックボックスをオンにして、 チェックアウト が選択されるたびにこのフォームが 自動的に送信 されるようにすることができます。 ドラフト ステータスのレイアウトには公開バージョンへの変更が反映されないため、ユーザーは必要な編集をゆっくりと行うことができます。スケジュールされた表示には、レイアウトの公開バージョンが引き続き表示されます。 変更を永続的にして既存のレイアウトを上書きするには、[公開] を選択します。公開されると、[スケジュールされたレイアウト] に加えられた変更が表示されます。 [破棄] は、スケジュールされたレイアウトに変更を加えずに、レイアウトを元の公開状態に戻します。 レイアウト グリッドの行メニューを使用して、アクションとショートカットのリストにアクセスします。 レイアウトのロック解除 ユーザーが CMS の別のユーザーによって既に編集されているレイアウトを編集しようとすると、そのレイアウトはユーザーによる編集を防ぐためにロックされます。レイアウトは、指定された時間 (ロック メッセージに表示) または最初のユーザーが レイアウトのロック解除 を選択するまでロックされたままになります。 レイアウトのロックを解除すると、ユーザーはレイアウト グリッドにリダイレクトされ、別のユーザーが編集できるように解放されます。",
        "page_url": "output\/ja\/layouts_editor_publish_options.html"
    },
    {
        "id": "layouts_editor_widgets",
        "content": "ウィジェット ウィジェットは Sigme のコア コンポーネントであり、 レイアウト または プレイリスト にコンテンツを表示するために使用されます。 {nonwhite}{video}-pGgF0ijzBg{\/video}{nonwhite} 機能の概要 選択できる強力なウィジェットの選択。 コンテンツをすばやく簡単に作成します。 サードパーティのコンテンツを統合します。 画面に動的なコンテンツを表示します。 CMS の他のユーザーが利用できるモジュールを選択します。 すべてのウィジェットには、関連付けられた モジュール があり、このモジュールは、ウィジェットの表示方法に関する設定でユーザーからどのような情報が必要かを Sigme に伝えます。 ウィジェットは、管理者が CMS の モジュール セクションで無効\/有効にすることができます。 ウィジェットは ツールボックス から利用できます: 上部のボタンをクリックして、利用可能なウィジェットを表示します。 ウィジェットを お気に入り としてマークすると、独自のセクションに表示され、選択しやすくなります: ウィジェット カードの左上にある星のアイコンをクリックします。 星をクリックすると、お気に入りセクションから選択解除されます。 > のあるウィジェットは、追加のウィジェット テンプレートを選択するために開く必要があります: ドラッグ アンド ドロップでレイアウトに追加するか、ウィジェット カードをクリックしてハイライト表示してから、キャンバスをクリックして追加します: 位置とサイズを変更します。 プロパティ パネル で使用可能なオプションから構成します。 次の データ ウィジェット …",
        "page_url": "output\/ja\/layouts_editor_widgets.html"
    },
    {
        "id": "layouts_interactive_actions",
        "content": "インタラクティブ アクション 注意: インタラクティブ アクションに関するいくつかの問題を認識しており、現在、ワークフローと付随するドキュメントの改善に取り組んでいます。 ドキュメントはレビュー中です… アクションは、レイアウト全体またはレイアウトに変更を加えるために使用できるウィジェットに添付できます。これらは、 タッチまたはクリック によってトリガーするか、 webhook によってプログラム的にトリガーできます。 シナリオ : 製品ディスプレイには、顧客が手に取ることができる製品があります。光センサーなどの「モノのインターネット」デバイスを使用して、Sigme への webhook をトリガーし、特定の製品情報をレイアウトにロードして表示することができます。 アクションの追加 ウィジェットには、タッチ、クリック、または Webhook によってトリガーされるレイアウトの変更を実行するアクションを添付できます。 アクションは、 レイアウト エディター 内のツールボックスから作成および管理され、選択したアイテムのプロパティ パネルの [ アクション ] タブに表示されます。 必要な アクション を選択し、ターゲットにドラッグします。 追加したら、プロパティ パネルを使用して トリガー タイプ と ターゲット を設定します。 トリガー タイプ を設定します: レイアウトまたは特定のウィジェットの任意の場所をタッチまたはクリックしてトリガーします。 または Web フックのトリガー コードを含めます。これは、URL ``trigger=` パラメータに存在する必要があります。 Android を使用してタッチでトリガーする場合は、 ディスプレイ設定 の 詳細 タブを使用して、デバイスの タッチ 機能が有効になっていることを確認してください。 トリガー ターゲット を構成します。ここで使用できるオプションは、追加されたアクションのタイプによって異なります: レイアウトに移動 は、 レイアウト コード を使用して、使用するレイアウトを識別します。したがって、ターゲット レイアウトがこのリストに選択対象として含まれるようにするには、レイアウト編集フォームからターゲット レイアウトに コード識別子 が割り当てられていることを確認してください。 次のウィジェット および 前のウィジェット アクションは、プレイリスト タイムラインの「次」および「前」の項目をターゲットにするために プレイリスト に追加する場合にのみ適用されます。",
        "page_url": "output\/ja\/layouts_interactive_actions.html"
    },
    {
        "id": "layouts_overlay",
        "content": "オーバーレイ レイアウト スケジュール済み ときにそのスケジュール内の他のレイアウトの上に表示されるオーバーレイ レイアウトを作成します。 オーバーレイ レイアウトは、 レイアウト リスト キャンペーン 内のレイアウトで使用するようにスケジュールすることもできます。 オーバーレイ レイアウトは、通常のスケジュール済みコンテンツが下で変更されても上部に残ります。これは、たとえばロゴ、重要な情報、緊急通知などに特に便利です。 オーバーレイ レイアウトを作成する オーバーレイ レイアウトは、他のすべての レイアウト とまったく同じ方法で作成されます。既存のデザインに合わせてコンテンツを追加し、オーバーレイ レイアウトがオーバーレイと同時に スケジュール されている他のレイアウトの上に「配置」できるようにします。オーバーレイ レイアウトには、その下にあるレイアウトが順番に再生される間、すべての重要なコンテンツが表示されます。 レイアウトがオーバーレイ レイアウトとしてスケジュールされている場合、Sigme はプレーヤーの背景をレンダリングしません。 注意: Edge ブラウザーを使用するウィジェット\/メディアを含むレイアウトは、このような状況ではコンテンツを他のコンテンツの上に配置できないため、オーバーレイ レイアウトでは使用できません。これには HLS と埋め込み YouTube が含まれます。コンテンツがビデオでない場合は、代わりに CEF ブラウザーを使用できます。 オーバーレイ レイアウトは、スケジュールされたときにレイアウトとは異なる動作をし、メディア コンテンツを 1 回だけレンダリングするため、更新されたコンテンツは表示されません。 オーバーレイ レイアウトに更新が必要なコンテンツ (カレンダーやティッカー ウィジェットなど) が含まれている場合は、 プレイリスト をレイアウトに追加し、メディアをプレイリストに追加する必要があります。その後、プレイリストの次のアイテムを読み込むと、他のアイテムが再読み込みされ、更新されたコンテンツが表示されます。",
        "page_url": "output\/ja\/layouts_overlay.html"
    },
    {
        "id": "layouts_templates",
        "content": "テンプレート テンプレートを使用して設計プロセスをスピードアップし、企業標準が維持されるようにします。 機能の概要: 既存の公開済みレイアウト デザインを使用して、テンプレートとして簡単に保存します。 管理を容易にするために、専用ページからテンプレートを作成および管理します。 レイアウト上のコンテンツ プレースホルダーとして機能するゾーンをテンプレートに追加します。 共有オプションを設定して、テンプレート上の選択したゾーンへのユーザー アクセスを制限します。 レイアウト エディターで選択できるように、公開済みテンプレートを表示します。 すべてのユーザーのレイアウト設計プロセス全体をスピードアップします。 すべてのレイアウトに標準化された外観を適用します。 新しい テンプレート を作成するか、既存の レイアウト デザインを保存して、将来のレイアウトのテンプレートとして使用します。 テンプレートを選択すると、現在のレイアウト デザインが選択したテンプレートに置き換えられます。この操作は元に戻せないため、注意して使用する必要があります。 テンプレートの作成 テンプレートは、メインの CMS メニューの [ デザイン ] セクションで [ テンプレート ] を選択して作成します。 [ テンプレートの追加 ] ボタンを選択し、フォーム フィールドに入力します。 フォルダ は、ユーザー オブジェクトを整理、検索し、他のユーザー\/ユーザー グループと簡単に 共有 するために使用されます。フォルダに保存されたテンプレートは、そのフォルダに適用されているアクセス オプションを継承します。 ユーザーがテンプレートのコンテンツ (画像メディア ファイルなど) にもアクセスできるようにする場合は、これらも同じフォルダに保存されていることを確認してください。 CMS で簡単に識別できるように、テンプレートに 名前 を付け、オプションで タグ を含めます。 解像度 を選択します。 保存 すると、 レイアウト エディタ が 1 つのフル サイズの ゾーン とともに自動的に開きます。 ゾーンは、コンテンツを追加できるレイアウト上の領域を定義するために使用されます。 ゾーンを含めずにテンプレートに直接コンテンツを追加する場合は、右クリックして [ 削除 ] を選択し、キャンバスからゾーンを削除します。 レイアウト を作成するのと同じ方法でコンテンツを追加します。 ゾーンの追加 ゾーンはテンプレートでのみ使用できます。 ゾーンの任意の場所をクリックして、サイズを変更し、配置します。 右下のボタンを使用して、[ グリッドにスナップ ]、[ 境界線にスナップ ]、または [ 要素にスナップ ] を選択すると、アイテムを追加するときに簡単に配置できます。 ゾーン はツールバーから追加できます。 上部の [ ウィジェット ] ボタンをクリックします。 ゾーンを選択し、ドラッグ アンド ドロップまたはクリックして追加します。 サイズ変更と配置。 ゾーンに定期的に更新する必要があるウィジェット (RSS ティッカーなど) が含まれており、レイアウト全体の継続時間よりも頻繁に更新する必要がある場合のみ、 ループ に設定します。 レイヤー化 プロパティ パネルから [配置] タブを選択し、重複するゾーン\/追加コンテンツの レイヤー化 を設定します。 右クリックすると コンテキスト メニュー が表示され、アイテムを簡単に前後に移動できます。 共有 オプションは、ユーザーが管理するレイアウトのセクションのみにアクセスできるようにする場合に特に便利です。 ツールボックスとゾーンの両方の コンテンツ を追加して、テンプレート デザインを構築します。 1 つのゾーンに複数のメディア アイテムを追加すると、 プレイリスト が自動的に作成されます。 テンプレートが完成したら、エディターの上部にあるメニューを使用して 公開 します。 公開された テンプレート は、レイアウト エディターのツールボックスから選択できます。 レイアウトをテンプレートとして保存 公開されたレイアウトは、次の 2 つの場所から テンプレート として保存できます。 レイアウト エディター から: 公開 後、メニューに戻って テンプレートの保存 を選択します: レイアウト グリッドから: 公開 されたレイアウトの行メニューを使用して、 テンプレートの保存 を選択します。 関連するすべてのフォーム フィールドに入力して、選択したレイアウトをテンプレートとして保存します。 オプションで、チェックボックスを使用して、追加されたすべての ウィジェット もテンプレートに含めることができます。 保存 テンプレートとして保存されたレイアウトは、メインの CMS メニューの デザイン セクションの テンプレート グリッドから表示および編集できます。 レイアウトを「テンプレート」として タグ付け すると、デザインがテンプレート リストに追加されます。 行メニュー すべてのテンプレートには行メニューがあり、ユーザーはそこからアクション\/ショートカットのリストにアクセスできます。 注目すべき設定を以下に示します: テンプレートの変更 レイアウト エディターでテンプレートのデザインを変更する場合に選択します。 チェックアウト 公開済みのテンプレートを編集するには、 チェックアウト をクリックして下書きを作成します。編集したら、テンプレートを公開して、既存のテンプレートを上書きして変更を永続化できます。破棄すると、テンプレートは元の公開状態に戻ります。 チェックアウト を使用すると、公開バージョンに変更が加えられたり、スケジュールされた ディスプレイ に表示されたりすることがなくなるため、編集には時間をかけてください。 公開 は変更が行われたことを確認し、公開バージョンを上書きします。 破棄 は下書きを削除しますが、公開バージョンはそのまま残ります。 公開 公開すると、テンプレートがツールボックスから選択可能になります。 破棄 下書きに加えられたすべての変更を破棄し、以前の公開バージョンに戻します。 共有 ユーザー\/ユーザー グループが個々のテンプレートにアクセスできるように、 共有 オプションを設定します。 エクスポート 関連するすべてのウィジェット\/メディア\/データセット構造を含むテンプレートを ZIP ファイルにエクスポートして、簡単に共有できるようにします。 テンプレートをエクスポートすると、割り当てられたすべての レイアウト 、 プレイリスト 、 メディア タグ がエクスポートされます。レイアウトのインポート時にこれらのタグを追加するには、[タグのインポート] オプションを選択します。 テンプレート グリッドの下部にある [選択したものを含む] オプションを使用して、複数のテンプレートに対して一括操作を実行します。 次へ… オーバーレイ レイアウト",
        "page_url": "output\/ja\/layouts_templates.html"
    },
    {
        "id": "media_dashboard_service",
        "content": "ダッシュボード サービス この機能を利用する場合は、管理者にお問い合わせください。",
        "page_url": "output\/ja\/media_dashboard_service.html"
    },
    {
        "id": "media_datasets",
        "content": "DataSets DataSet は、 レイアウト および プレイリスト とは独立して作成および管理される表形式のデータを設計および保存するために使用されます。作成された DataSet は、 DataSet ウィジェットを使用してレイアウトおよびプレイリストに追加されます。 DataSet は、 Ticker ウィジェットに追加する独自の RSS フィード を作成するためにも使用できます。 機能の概要: データ構造を定義します。 データを手動で追加できます。 CSV ファイルからデータをインポートします。 API 経由で JSON 形式のデータ ソースを使用します。 スケジュールに従って、サードパーティのデータ ソースからリモートで同期します。 レイアウト\/プレイリストにアクセスせずにコンテンツを維持します。 複数のウィジェット\/レイアウト\/プレイリストで再利用します。 DataSet から RSS フィードを作成します。 DataSet は汎用性を考慮して設計されているため、DataSet ウィジェットやカスタム モジュールのデータ ソースを使用してさまざまな方法で構成できます。DataSet を使用すると、Sigme で他のシステムからデータをインポートして表示できます。 DataSet を活用できる例: バーのドリンク メニュー ゴルフ クラブのティー タイム 会議室の予約 バスの時刻表 DataSet はレイアウトやプレイリストとは独立して作成および管理されるため、DataSet 内に保持されているデータを追加または管理するために、レイアウト、レイアウト エディター、またはプレイリストにユーザーがアクセスする必要はありません。 データセットの作成 データセットは、メイン CMS メニューの [ライブラリ] セクションで [データセット] を選択して作成および管理します。 [データセットの追加] ボタンを選択し、フォーム フィールドに入力して新しいレコードを作成します。 フォルダー は、ユーザー オブジェクトを整理、検索し、他のユーザー\/ユーザー グループと簡単に 共有 するために使用されます。フォルダーに保存されたデータセットは、そのフォルダーに適用されたアクセス オプションを継承します。 CMS で簡単に識別できるように、データセットに [名前] を付けます。オプションの内部 説明 を提供し、API経由でこのデータセットを参照する場合は コード を入力します。 データセットが リモート データソースと同期するように接続される場合は、有効にするためにチェックを入れ、 リモートデータセットの作成 構成に進みます。 データセットが リモート でない場合は、データセットレコードを保存して、 列の作成と構成 セクションから続行します。 リモートデータセットの作成 リモートデータセットは、サードパーティのデータソースから定期的に同期される特別なタイプのデータセットです。Sigmeは、選択された期間にURLを呼び出し、データセットレコードと リモート として定義されている列に設定された指示に従ってデータを解析します。 リモートを選択すると、追加のタブ付きフィールドが利用可能になり、リモートデータセットレコードを完全に入力できるようになります: リモート リクエストメソッドのタイプを設定し、リモートデータソースの URL を入力します。 認証 認証情報を提供します。カスタムヘッダーは、カスタム HTTP ヘッダーのオプション文字列を提供するために使用できます。 データ リモートデータソースを設定します: JSON ソース JSON データは、リモートタイプとして定義された列に従って入力されます。 リモート列 を指定する場合は、指定された データルート に関して、その列のデータへの JSON 構文パスである「データパス」を入力する必要があります。 JSON データ ソースの例を考えてみましょう: { \"base\": \"EUR\", \"date\": \"2017-12-22\", \"rates\": { \"GBP\": 0.88568, \"THB\": 38.83, \"USD\": 1.1853 } } 通貨の Symbol と Value を 2 つの列で取得したい場合は、 Data Root を rates に設定し、次の列を用意する必要があります: Symbol - データ パス = 0 Value - データ パス = 1 Test data URL を使用して、目的の構造が返されることを確認します。 CSV ソース リモート データ ソースは CSV として選択できます。 CSV ソースにヘッダーが含まれている場合は、最初の行を無視するようにチェックします。 テスト データ URL を使用して、目的の構造が返されることを確認します。 詳細 リモート データの取得とインポートの頻度を設定します。 リモート データセットの取得タスクは、デフォルトでは 1 時間ごとに実行されます。リモート データセットは、リアルタイムではなく、頻繁に更新されないデータを対象としています。 データの切り捨てにタイムスケールを設定します。 依存関係を使用する場合は、ドロップダウンを使用してデータセットを選択します。 オプションで、行制限と、この制限を超えた場合の動作を設定します。 保存 をクリックします。 列の作成と構成 列はデータの構造を定義します。 データセット レコードの行メニューを使用して、 列の表示 を選択します。 デフォルトでは、すべての新しいデータセットに Col1 が追加されます。これは、Col1 の行メニューを使用して編集または削除する必要があります。 行メニューから Col1 を削除し、 列の追加 ボタンをクリックして新しい列を作成します ​ または Col1 の行メニューを使用して、 編集 を選択します。 この列を識別するための 見出し を含めます。 ドロップダウンを使用して、使用する列の タイプ を選択します。 列タイプ: 値 コンボ ボックスに表示される項目のリストを入力します。 ドロップダウンを使用して データ タイプ を選択します。 この列に選択できる値のコンマ区切りリストを提供します。 データを表示\/編集するときにこの列が表示される位置を設定します。 この列にデータを入力するときに表示するオプションのツールヒント メッセージを提供します。 追加のオプションを使用して、この列の フィルター 、 並べ替え 、および 必須値 を有効にします。 数式 MySQL ステートメントを入力します。 ドロップダウンを使用してデータ タイプを選択します。 - データを表示\/編集するときにこの列が表示される位置を設定します。 ‘SELECT’ ステートメントで使用するのに適した MySQL ステートメント、または日付フィールドをフォーマットする文字列を指定します。 $dateFormat(<col>,<format>,<language>) 日付フォーマットが機能するには、 <col> に日付と時刻が指定されていることを確認してください。言語が設定されていない場合は、デフォルトで英語になります。 数式列には 2 つの置換が使用できます: [DisplayId] と [DisplayGeoLocation] は、実行時に表示 ID \/ 表示ジオロケーション (MySQL GEOMETRY) に置換されます。 追加オプションを使用して、この列の フィルター と 並べ替え を有効にします。 リモート JSON 構文文字列を指定します。 ドロップダウンを使用してデータ型を選択します。 サードパーティのデータ ソースからデータにアクセスする方法を示す JSON 構文文字列を入力します。 データを表示\/編集するときにこの列が表示される位置を設定します。 追加オプションを使用して、この列の フィルター と 並べ替え を有効にします。 必要に応じて列の追加と構成を続けます。Sigme がサポートできる列の数に理論上の制限はありませんが、多くの場合、DataSet が小さいほど管理と表示が簡単になります。 列は、DataSet ページから DataSet レコードの行メニューを使用して表示\/追加および編集できます。 列の順序とリストの内容は、データが収集された後に変更できます。 列へのデータの追加 列を定義したら、データを追加する必要があります。これは、いくつかの方法で実現できます。 CMS ユーザー インターフェースから手動で CSV ファイルからインポート API を使用する リモートで同期 手動で データは、列ページの データの表示 ボタンを使用して追加されます。 データは、データセット ページのデータセット レコードの行メニューを使用して表示\/追加および編集できます。 データ テーブルには、データセットに追加された各列が、構成されたとおりに表示されます。 行の追加 ボタンをクリックして新しいデータ行を追加し、数式以外の各列タイプを完了します。 次へ をクリックしてデータの追加を続行し、さらに行を追加します。 すべてのデータが完了したら、 保存 をクリックします。 任意の行をクリックしてデータを編集します。選択した行の末尾の十字をクリックすると、削除されます。 ユーザーは、グリッドの上部にあるボタンを使用して、 複数選択モード に切り替えることができます。このモードでは、ユーザーは複数の行を選択し、 行の削除 をクリックして一括で削除できます。 完了したら、 編集モード ボタンをクリックして、複数選択モードを終了します。 CSV のインポート CMS には、 CSV ファイル からデータを抽出して DataSet に入れるために使用できる DataSet CSV インポーターがあります。 CSV のインポート 機能は、任意の DataSet レコードの行メニューからアクセスできます (リモート データ ソース用に構成された DataSet を除く)。 インポーターには、インポート ファイルに保存されている既存のデータを上書きするオプションと、ファイルに見出しがある場合にインポート時に CSV の最初の行を無視するオプションがあります。 DataSet 内のリモート列は、その横に、リストされた列ヘッダーに対応する CSV ファイル内の列番号を示すフィールドとともにリストされます。 非 ASCII 文字を使用している場合は、CSV ファイルのファイル エンコーディングが正しいことを確認することが重要です。非 ASCII 文字は、英語以外の言語では非常に一般的です。最も一般的に使用されるファイル エンコーディングは UTF-8 です。 Excel を使用して CSV ファイルを編集した場合は、[名前を付けて保存] ダイアログの [ツール] -> [Web オプション] -> [エンコーディング] タブで [Unicode (UTF-8)] を選択する必要があります。 API 経由 Sigme API を使用して、DataSet にデータを同期する独自のアプリケーションを作成できます。データは、行ごとに追加することも、JSON 構造全体をインポートすることもできます。 リモート リモート DataSet は、 Fetch Remote DataSets というタスクと同期されます。このタスクはデフォルトで設定されており、1 分ごとに 1 回実行されます。 依存関係 リモート DataSet は、別の DataSet に依存してリクエストを作成できます。依存 DataSet の各行は、親 DataSet のリクエスト パラメータを使用してリクエストを作成するために使用されます。 行メニュー 各 DataSet には、ユーザーがアクション\/ショートカットのリストにアクセスできる行メニューがあります。 注目すべき設定を以下に示します。 RSS の表示 DataSet に保持されているデータを使用して、独自の RSS フィードを作成します。 DataSet の行メニューから View RSS を選択します。 Add RSS ボタンをクリックします。 フォーム フィールドに入力し、使用する列を選択します。 保存すると URL が生成され、コピーして Ticker ウィジェットに追加できます。 削除 データセットは、使用されていない場合にのみ削除できます。 データセット グリッドの下部にある 選択済み オプションを使用して、複数のデータセットを一括で選択して削除できます。 共有 ユーザー\/ユーザー グループが個々のデータセットにアクセスできるように、 共有 オプションを設定します。 次へ… DataSet ウィジェット",
        "page_url": "output\/ja\/media_datasets.html"
    },
    {
        "id": "media_library",
        "content": "メディア ライブラリ Sigme は、レイアウトやプレイリストに直接作成および保存されるウィジェットから、CMS ライブラリにアップロードおよび保存され、複数のレイアウトやプレイリストで再利用できるファイルベースのメディアまで、さまざまなメディア タイプをサポートしています。 注意: Sigme は、ディスプレイに表示されるコンテンツを制御する手段を講じません。コンテンツが対象ユーザーにとって適切な素材であることを確認するのは、お客様の責任です。コンテンツの権利を所有していない場合は、コンテンツに適切な帰属表示を行う必要があります。 すべてのファイルベースのメディアを管理するには、メインの CMS メニューの [ ライブラリ ] セクションで [ メディア ] を選択します。 グリッド の上部にある複数のフィルター フィールドを使用して、返される結果の条件を制限します。 名前 および複数の タグ が割り当てられているアイテムをフィルターするには、 OR\/AND オプションを使用します。 サムネイルが設定されている画像や動画は、設定後、 方向 でフィルタリングすることもできます。 アイテムの行メニューを使用して、画像\/動画ファイルの 編集 を選択します。 フォームの一番下までスクロールし、目的の 方向 を設定します。 フォルダー は、ユーザー オブジェクトを整理、検索し、他のユーザー\/ユーザー グループと簡単に 共有 するために使用されます。 フォルダー\/サブフォルダーをクリックすると、選択したフォルダーの内容のみが検索され、適用されているフィルターに基づいて結果が返されます。 または ルート フォルダーで検索を含めるには、 すべてのフォルダー にチェックを入れ、適用されているフィルターに基づいて結果が返されます。 [フォルダー] メニューをクリックして、表示のオン\/オフを切り替えます。フォルダー ツリーが非表示になっている場合は、選択したフォルダーのファイル パスが表示されます。 ライブラリ メディアの追加 ライブラリ メディアは、[ メディアの追加 ] ボタンを使用して直接アップロードするか、[**メディアの追加 (URL)] ボタンを使用して URL を指定してアップロードできます。 CMS ライブラリにメディアを追加して フォルダー に保存すると、適切な ユーザー \/ ユーザー グループ がメディアを使用できるようになります。 CMS ライブラリに追加されたファイルは、 ライブラリ検索 を使用してレイアウトやプレイリストに簡単に追加できます。 メディアの追加 (アップロード) [ メディアの追加 ] ボタンを選択します [ ファイルの追加 ] をクリックし、アップロードするファイルを選択します。 デフォルトのしきい値と制限を指定できます。これは、たとえば画像をアップロードするときに 画像 のサイズを変更する必要がある場合に考慮されます。詳細については、 CMS 設定 を参照してください。 CMS で簡単に識別できるようにファイルに 名前 を付け、オプションで タグ を付けます。 名前フィールドが空白の場合、ファイルはアップロード時に元のファイル名に従って名前が付けられます。 ファイルを指定したフォルダの場所にアップロードすると、宛先フォルダに適用されている表示、編集、共有の削除オプションが継承され、ユーザー\/ユーザー グループが簡単にアクセスできるようになります。 フォルダの選択 ボタンをクリックし、展開して保存先のフォルダを選択します。 ユーザーは、フォルダを右クリックして、ユーザー\/ユーザー グループの 機能と共有 オプションで有効になっているその他のオプションにアクセスすることもできます。 ファイルをアップロードするフォルダをクリックし、 完了 をクリックします。 現在のフォルダ に、選択したファイル パスが表示されます。 アップロードの開始 ボタンをクリックして、すべてのファイルのアップロードを開始します。フォルダが選択されていて、複数のファイルを追加している場合は、すべてのファイルがその場所にアップロードされます。 ファイルを個別にアップロードして、異なるフォルダの場所を指定することもできます。 [アップロードを開始] ボタンをクリックする代わりに、追加したファイルの行の末尾に表示される 青いアップロード ボタンをクリックします。 以前と同じように フォルダを選択 ボタンを使用してフォルダの場所を変更し、行の末尾にある青いボタンをクリックして、その 1 つのファイルだけをアップロードします。 すべてのファイルが正常にアップロードされたら、[完了] をクリックします。 メディア ファイルは、 ライブラリ検索 からアップロード ツールを使用して、レイアウト\/プレイリストに直接アップロードすることもできます。プレイリストにアップロードされたメディアには、 ウィジェットの有効期限 を設定するための追加オプションがあります。 アップロードされ、レイアウト\/プレイリストに直接追加されたメディア ファイルも、デフォルトで CMS メディア ライブラリに保存されます。 URL 経由でメディアを追加 [ メディアの追加 (URL) ] ボタンを選択します: フォルダー に保存すると、宛先フォルダーに適用されている表示、編集、削除、共有オプションが継承され、ユーザー\/ユーザー グループが簡単にアクセスできるようになります。 ファイルのリモート URL を指定します。 CMS で簡単に識別できるように、ファイルに 名前 を付けます。 [名前] フィールドが空白の場合、ファイルは元のファイル名と同じ名前になります。 [保存] をクリックします。 行メニュー ライブラリ の各項目には行メニューがあり、ユーザーはそこからアクション\/ショートカットのリストにアクセスできます 編集 編集 を選択して、 フォルダ の場所、 期間 、 タグ などの設定を変更します。 注目すべき設定を以下に示します: 有効期限 ライブラリ メディアの有効期限を設定すると、そのファイルが使用されているレイアウト\/プレイリストからそのファイルが削除されます。 メディアを廃止 このメディアを廃止 にチェックを入れると、メディア ファイルは既存のレイアウト\/プレイリストに割り当てられたままになりますが、レイアウト\/プレイリストに追加するための選択はできなくなります。 メディア統計収集を有効にする 選択したメディア ファイルの Proof of Play 統計の収集をオン\/オフ\/継承に設定します。 Proof of Play 統計を収集するには、 表示設定 で 統計レポートを有効にする にチェックが入っていることを確認してください。 メディアの更新 割り当てられているすべてのレイアウトでこのメディアを更新する チェックボックスを使用して、このメディア ファイルが現在割り当てられているレイアウト\/プレイリストに編集が反映されるようにします。 編集は、編集するための アクセス権 があるレイアウト\/プレイリストでのみ更新されます。 メディアの置き換え フォームの下部にある 置き換え ボタンを使用して、既存のファイルの新しいリビジョンをアップロードする必要がある場合があります。 [メディアの追加 (アップロード)] と同じ手順で、代替ファイルをアップロードします。(media_library.html#content-add-media-upload) 現在割り当てられているすべてのレイアウト\/プレイリストに代替ファイルを 更新 するには、チェックを入れます。 CMS から古いファイル バージョンを完全に 削除 するには、チェックを入れます。 削除 メディア ファイルは、既存の レイアウト\/プレイリスト で 使用されていない 場合にのみ、CMS から削除できます。 ファイルの削除は元に戻せないため、強制削除オプションは注意して使用する必要があります。 コンテンツの廃止 は削除ではなく、割り当てられている既存のレイアウト\/プレイリストにメディア ファイルを保持し、スケジュールされたコンテンツには影響しません。メディアは、新しいレイアウト\/プレイリストに追加できなくなります。 ボックスにチェックを入れると、XMDS を使用してハード プッシュが有効になり、プレーヤーのローカル ストレージからファイルが完全に削除されます。 使用状況レポート このレポートは、メディア ファイルを整理する前の最終チェックに最適です。 選択した メディア ファイル が ディスプレイ に直接割り当てられているか、スケジュールされているかが表示されます。 レイアウト タブを使用して、メディア ファイルが現在どの レイアウト に含まれているかを確認します。 ライブラリ グリッドの下部にある 選択済み オプションを使用して行を複数選択し、一括操作を簡単に実行できます。 スケジュール 画像およびビデオ ライブラリのメディア ファイルは、行メニューからフル スクリーン コンテンツとして直接表示するようにスケジュールできます。 [ スケジュール ] をクリックします アイテムの [ 期間 ] を設定して、このメディア ファイルがスケジュールに表示されるたびに表示される時間を決定します。このフィールドを空白のままにしておくと、メディア ライブラリで設定されている期間が使用されます。 必要に応じて、使用する [ 解像度 ] を選択します。空白のままにしておくと、選択したメディア ファイルのサイズに最も近い解像度が使用されます。 メディアが画面全体を埋めない場合、オプションの [背景色**] を設定してギャップを埋めることができます。 [ 保存 ] フォームの残りのフィールドに入力して、新しい スケジュール を完了します。 ライブラリの整理 CMS が使用され、レイアウト\/プレイリストやメディアが追加されると、時間の経過とともに、ライブラリは使用されなくなった古いコンテンツで乱雑になります。 ライブラリは、ユーザーまたはスーパー管理者が 整理 して、すっきりと小さく保つことができます。 アクションを元に戻すことはできないため、注意して使用する必要があります。 これは、クォータのある Web サーバーに CMS がインストールされている場合や、ユーザーに独自のクォータが割り当てられている場合に特に便利です。 ライブラリを整理できる場所は 2 つあります。 CMS 設定 - すべてのスーパー管理者のみが使用できます。 ライブラリ から - ライブラリ整理を有効にする がオンになっている場合、すべてのユーザーに対して。 有効にすると、ユーザーはライブラリ ページの上部にある ライブラリ整理 ボタンをクリックできます。 フォームには、削除されるファイルの数と、それらのファイルが占めるスペースが表示されます。 これにより、ログインしているユーザーが所有し、レイアウトで使用されなくなった、またはディスプレイ グループ\/ディスプレイに割り当てられていないファイルのみが削除されます。 次へ… モジュールとコネクタ",
        "page_url": "output\/ja\/media_library.html"
    },
    {
        "id": "media_menuboards",
        "content": "メニュー ボード メニュー ボード インターフェイスは、ユーザーがレイアウトとは独立して「カテゴリ」と「製品」情報を簡単に作成および管理できる方法を提供します。メニュー ボード データは、作成後、 レイアウト エディター で使用可能な メニュー ボード: カテゴリ および メニュー ボード: 製品 ウィジェットの 要素 を使用して、レイアウトの任意の場所に追加できます。 注: メニュー ボード ウィジェットはプレイリストに追加できません! 機能の概要 カテゴリを作成して定義します。 詳細な製品情報を含めます。 ライブラリから使用する画像を選択します。 レイアウトにアクセスせずにコンテンツを維持します。 複数のウィジェット\/レイアウトで再利用します。 メニュー ボードはレイアウトとは独立して作成および管理されるため、メニュー ボード内のカテゴリ\/製品データを追加または管理するために、レイアウトまたはレイアウト エディターへのユーザー アクセスは必要ありません。 メニュー ボードの作成 メニュー ボードは、メイン CMS メニューの [ライブラリ] セクションで [メニュー ボード] を選択して作成および管理します。 [メニュー ボードの追加] ボタンを選択し、フォーム フィールドに入力して新しいレコードを作成します。 フォルダー は、ユーザー オブジェクトを整理、検索し、他のユーザー\/ユーザー グループと簡単に 共有 するために使用されます。フォルダーに保存されたデータセットは、そのフォルダーに適用されたアクセス オプションを継承します。 CMS で簡単に識別できるように、メニュー ボードに 名前 を付けます。オプションの内部 説明 を提供し、API 経由でこのメニュー ボードを参照する場合は コード を入力します。 保存 をクリックして下さい。 カテゴリの作成と構成 カテゴリはデータの構造を定義します: メニュー ボード レコードの行メニューを使用し、 カテゴリの表示 を選択します。 カテゴリの追加 ボタンをクリックし、必要なフォーム フィールドに入力します: コード は、API を参照する場合の高度な使用を目的としています。 次へ をクリックしてこのプロセスを繰り返し、メニュー ボードに必要な カテゴリ を追加します。 使用する最後のカテゴリを入力するときに 保存 を選択します。 製品の追加 製品データはカテゴリに追加され、ディスプレイに表示するように選択できるすべての重要な情報を提供します。 カテゴリの行メニューを使用して、 製品の表示 を選択します: 製品の追加 ボタンをクリックして新しい製品データを作成し、関連するすべてのフォーム フィールドに入力します: メニュー ボード: 製品 ウィジェットは、ディスプレイに表示できないとマークされた製品を暗くするように構成できます。 製品オプション このタブを使用して、さらに製品オプションを提供します: オプションを使用して、この特定の製品に特別オファーや限定特典などを提供します。 このプロセスを繰り返して、カテゴリにさらに製品\/製品オプションを追加します。 各カテゴリは製品グリッドに個別のタブとして表示されるため、カテゴリを簡単に切り替えて製品情報を追加および編集できます。 カテゴリの表示 をクリックしてカテゴリ グリッドに戻り、行メニューまたは カテゴリの追加 を使用して既存のカテゴリを表示および編集します。 メニュー ボードのデータは、 メニュー ボード: カテゴリ ウィジェットを使用してレイアウトに追加されます。このウィジェットには、主に「ヘッダー」情報の追加に使用されるデータ要素と、レイアウトに製品の詳細を正確に配置できる メニュー ボード: 製品 ウィジェットがあります。 メニュー ボードはレイアウトとは独立して編集されるため、メニュー ボードが追加されたレイアウトにアクセスしたり編集したりする必要はありません。変更はすぐにシステムで利用可能になり、プレイヤーは次のコレクションですぐに使用できます。レイアウトを編集する必要はありません。 次へ… レイアウトの追加",
        "page_url": "output\/ja\/media_menuboards.html"
    },
    {
        "id": "media_module_audio",
        "content": "オーディオ ライブラリ検索 から、レイアウトとプレイリストで再生するオーディオ ファイルを追加します。 概要 ライブラリ検索 から、新しいオーディオ ファイルをプレイリスト\/レイアウトに直接 アップロード します。 プレイリストやレイアウトに直接アップロードされたファイルは、再利用できるように ライブラリ に自動的に保存されます。 オーディオ ファイルを事前にライブラリにアップロードすることもできます。 mp3.wav ファイル形式をお勧めします。 プレイリストに直接アップロードされたオーディオ ファイルの 開始時間と終了時間 を設定します。 アップロード時にオーディオ ファイルを フォルダ に保存して、ユーザーへのアクセスを簡単に制御します。 アップロードされたオーディオ ファイルは、オフライン再生用にキャッシュされます。 オーバーレイ レイアウト と完全に互換性があります。 オーディオ ファイルの継続時間を制御します。 元のファイルを短くするには、継続時間を短く設定します。 再生時間を長く設定し、ループ機能を使用して最初に戻って「ループ」することで、再生時間を長くすることができます。 オーディオ ファイルを他のウィジェットに添付します。 オーディオは、 コンテキスト メニュー を使用して他のウィジェットに添付することもできます。 ウィジェットに添付する場合、ユーザーはボリュームとループ パラメータを入力して、添付されたウィジェットの再生時間中オーディオをループさせるか、1 回だけ再生するかを決定できます。親ウィジェットの再生が終了すると、オーディオは停止します。",
        "page_url": "output\/ja\/media_module_audio.html"
    },
    {
        "id": "media_module_calendar",
        "content": "カレンダー Elements を使用してレイアウト上の任意の場所に iCal フィードから取得したカレンダー イベントを表示するか、 Static Template を選択してレイアウト\/プレイリストに結果を表示します。 カレンダー データは、構成された要素と Static Templates にフィードされる iCal フィードによって提供されます。 ICS フィード URL が CMS で使用できることを確認します。認証なしでブラウザにフィードが読み込まれる場合、フィードは問題なく CMS に表示されます。 アプリケーションで Google カレンダーを表示する方法の詳細については、次のリンクを使用して [ カレンダーを取得 (表示のみ) ] オプションを選択してください: https:\/\/support.google.com\/calendar\/answer\/37648?hl=en カレンダー要素 レイアウト にカレンダー ウィジェットを追加するときに 要素 を選択できます。これにより、ユーザーはカレンダー ウィジェットのどのコンポーネントを使用するか、どこに配置できるかをより細かく制御できます。 各要素には、プロパティ パネルに一連の構成オプションがあります。 構成 タブから結果を返すために使用する iCal フィードを入力します。 追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。 グローバル要素 を追加して図形やテキストを追加することで、データ要素をさらに補完できます。これらはすべて 要素グループ にまとめられるため、構成や配置が簡単になります。 ステンシル を利用して、事前にデザインされた要素のグループをレイアウトに追加します。 ステンシル内のすべての要素は、構成時に「1 つ」として扱われ、右クリックで簡単に複製できます。 カレンダーの静的テンプレート 静的テンプレート は、返される結果のレイアウトとスタイル設定方法を定義し、事前にスタイル設定されたテンプレートを使用してデータを表示する簡単な方法です。 テンプレートは、プロパティ パネルのさまざまなオプションを使用して、デザインの外観を変更するように構成できます。レイアウト\/プレイリストに追加された各テンプレートの [ 構成 ] タブから結果を返すには、iCal を入力します。 概要 指定された日付範囲内のイベントを返します。 終日イベントと現在のイベントをフィードから除外して、表示されないようにするオプション。 イベントとカレンダーのタイムゾーンを使用します。 アイテムごとに期間を設定します。 表示するイベントの数を指定します。 特定の条件が検出されたときに Web フック トリガーを実行します。 - このメディアのデータは、オフライン再生用にプレーヤーによってキャッシュされます。 Web フック トリガー トリガー タブから 現在のイベント または イベントなし がある場合に、Web フック アクション をトリガーします。 シナリオ例 : ユーザーは、レイアウト上のカレンダー ウィジェットを使用して会議室カレンダーを構成しており、部屋の現在の占有状況を表示し、空いているか使用中かを示すように LED ライトを変更したいと考えています。 ユーザーはまず、LED IoT デバイスまたは一部の Philips Commercial Displays に組み込まれている LED にコマンドを発行する [シェル コマンド](displays_command_ functionality.html#content-shell-commands) を作成する必要があります。 次に、 シェル コマンド ウィジェット を使用して、 ウィジェットに移動 し、 画面をターゲット する インタラクティブ アクション を レイアウト に定義する必要があります。 [トリガー] タブから、 現在のイベント と イベントなし の Web フック をトリガーするコードを割り当てます。",
        "page_url": "output\/ja\/media_module_calendar.html"
    },
    {
        "id": "media_module_clock",
        "content": "時計 アナログ 、 フリップ 、 デジタル スタイルの時計から選択します。 概要 明るいテーマまたは暗いテーマで、従来のアナログ時計の文字盤を表示します。 テキスト\/HTML を入力するか、提供されている日付形式を使用して、デジタル時計に使用する時間形式を指定します。 アニメーション化されたフリップ時計を表示し、経過秒数を表示します。 フリップ時計で時間、分、日次カウンター オプションを使用し、指定した日付\/時刻から実行してカウントダウンを表示します。 現在の時刻に分単位のオフセットを適用します。",
        "page_url": "output\/ja\/media_module_clock.html"
    },
    {
        "id": "media_module_countdown",
        "content": "カウントダウン レイアウトとプレイリストに、選択した期間または指定した日付までのカウントダウンを表示します。 概要 分と秒でカウントダウンを表示するように選択します。 日、時間、分、秒を表示する詳細なカウントダウンを表示します。 年、月、週、日を合計時間、分、秒とともに表示する表形式のカウントダウン。 シンプルなテキスト形式でカウントダウンを表示します。 ウィジェットの合計期間によってカウントダウンを決定します。 秒単位でカウントダウンする独自のカスタム期間を設定します。 使用する日付と時刻を指定します。 警告日を設定すると、カウントダウンの残り期間にカウントダウンが「警告モード」に変更されます。",
        "page_url": "output\/ja\/media_module_countdown.html"
    },
    {
        "id": "media_module_currencies",
        "content": "通貨 要素 を使用してレイアウト上の任意の場所に通貨ペアの為替レートを表示するか、 静的テンプレート を選択してレイアウト\/プレイリストに結果を表示します。 通貨ウィジェットは、構成された要素と静的テンプレートに取り込まれる為替レート データを取得するために、 Alpha Vantage API に部分的に依存しています。 Alpha Vantage にアクセスしてアカウントを作成し、Alpha Vantage コネクタ に入力するための API キーを取得してください。 通貨要素 レイアウト に通貨ウィジェットを追加するときに 要素 を選択でき、ユーザーは通貨ウィジェットのどのコンポーネントを使用するか、どこに配置できるかをより細かく制御できます。 各要素には、プロパティ パネルに一連の構成オプションがあります。 通貨 には、表示したい頭字語\/略語と、 構成 タブの 基本 通貨を入力します。 追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。 グローバル要素 を追加して図形やテキストを追加することで、データ要素をさらに補完できます。これらはすべて 要素グループ にまとめることができ、構成と配置が簡単になります。 通貨の静的テンプレート 静的テンプレート は、返されるデータのレイアウトとスタイル設定方法を定義し、事前にスタイル設定されたテンプレートを使用してデータを表示する簡単な方法です。 プロパティ パネルのさまざまなオプションを使用して、テンプレートを構成してデザインの外観を変更できます。レイアウト\/プレイリストに追加された各テンプレートの [ 構成 ] タブから、表示したい頭字語\/略語を使用して 通貨 を入力し、 基本 通貨を入力します。 概要 逆変換して、基本通貨を比較として使用します。 このメディアのコンテンツは、オフライン再生用にプレーヤーによってキャッシュされます。 期間はアイテムごとまたはページごとに適用できます。",
        "page_url": "output\/ja\/media_module_currencies.html"
    },
    {
        "id": "media_module_dashboard",
        "content": "ダッシュボード 注意: このウィジェットを利用する場合は、管理者に問い合わせてください。 ダッシュボード ウィジェットは、 Xibo ダッシュボード サービス を使用するように構成された ダッシュボード を表示するために使用されます。 注意: この商用ウィジェットは Xibo ダッシュボード サービス の一部であり、構成には API が必要です。詳細については、 こちら を参照してください。 構成 コネクタで構成されたダッシュボードと一致するダッシュボード サービスを選択します。 埋め込む URL を入力します。 このサービスで使用する URL の取得、認証メカニズム、および考えられる制限の詳細については、次のページを参照してください。 Xibo ダッシュボード サービス 更新間隔を分単位で指定します。 注意: ダッシュボードごとに入力できる最小更新間隔は 5 分です。ダッシュボード サービスの更新は 5 分より頻繁にはサポートされていません。 ダッシュボード ウィジェットに URL を初めて入力すると、ダッシュボード コンテンツのレンダリングにかかる時間と、現在のサービスの混雑状況によって、読み込みに数分かかる場合があります。 ダッシュボードをディスプレイに表示すると、指定した間隔でダッシュボードが更新されるため、いつでもすぐにディスプレイに表示され、すぐに表示されます。 ダッシュボードをディスプレイに表示しなくなると、サービスはダッシュボードの更新を停止しますが、次回ダッシュボードが表示されるときに自動的に再開します。 デフォルトでは、 Power BI のレポートは米国の日付形式でレンダリングされます。代替の日付形式を使用するには、ダッシュボード ウィジェットに渡す URL に次のパラメータを追加します ( en-GB の例を参照)。 &language=en&formatLocale=en-GB 注意: Xibo がダッシュボード サービスのリクエストでエラーを検出した場合、問題が発生した場所をユーザーに知らせるために、スクリーン グラブの上に赤いバナー メッセージが表示されます。これは、ログインしたユーザーのレイアウト デザイナー プレビューアーにのみ表示されます。スケジュールされたレイアウトを表示するレイアウト プレビューとディスプレイには、問題が解決されるまで、最後の正常なキャプチャまたはスピナー アイコンが表示され続けます。 スクリーン グラブのエラー メッセージの例を以下に示します。",
        "page_url": "output\/ja\/media_module_dashboard.html"
    },
    {
        "id": "media_module_dataset",
        "content": "DataSet Elements を使用してレイアウト上の任意の場所に DataSet に保持されているデータを表示するか、 Static Templates を含めてレイアウト\/プレイリストにデータのティッカーとテーブルを表示します。 DataSet ウィジェットは主に、構成されたエレメントと Static Templates にフィードする DataSet ソースで構成されます。 DataSet は、レイアウト\/プレイリストに DataSet ウィジェットを追加する前に作成して定義する必要があります。 DataSet 要素 Element は、DataSet ウィジェットを Layout に追加するときに選択できます。これにより、ユーザーは DataSet ウィジェットのどのコンポーネントを使用するか、どこに配置できるかをより細かく制御できます。 DataSet に一致するフィールド タイプがない要素を使用しようとすると、プロパティ パネルにメッセージが表示されます。 各要素には、プロパティ パネルに一連の構成オプションがあります。レイアウトで使用される各要素の 構成 タブから、データ ソースとして使用するデータセットを選択する必要があります。追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。 グローバル要素 を追加して図形やテキストを追加することで、データ要素をさらに補完できます。これらはすべて 要素グループ にまとめることができ、構成と配置が簡単になります。 データセットの静的テンプレート 静的テンプレート は、返されるデータのレイアウトとスタイル設定方法を定義し、事前にスタイル設定されたテンプレートを使用してデータを表示する簡単な方法です。 テンプレートは、返される結果の動作に影響を与えるように構成できるほか、プロパティ パネルのさまざまなオプションを使用してデザインの外観を変更することもできます。レイアウト\/プレイリストに追加された各テンプレートの [構成] タブから、データ ソースとして使用するデータセットを選択する必要があります。 概要 基礎となる データセット データを編集して、新しいデータで要素とテンプレートを更新します。 レイアウトやプレイリストにアクセスせずに、データセット ウィジェットのコンテンツを更新します。 任意の列で結果を並べ替えてフィルターします。 アイテムをシャッフルして、ランダムな順序で再生します。 このメディアのコンテンツは、オフライン再生用にプレーヤーによってキャッシュされます。 プレーヤーがオフラインのときに「データなし」メッセージに切り替えるタイミングを決定するために、「鮮度チェック」を設定します。",
        "page_url": "output\/ja\/media_module_dataset.html"
    },
    {
        "id": "media_module_embedded",
        "content": "埋め込みコンテンツ レイアウトとプレイリストに表示する HTML と JavaScript を埋め込みます。 概要 コア アプリケーションを変更せずにカスタム拡張機能を作成します。 透明な背景のコンテンツの場合は、透明な背景のウィジェットを表示するようにチェックします。 レイアウトに合わせてコンテンツを拡大縮小します。 画面外にコンテンツをプリロードします。 埋め込むテキストまたは HTML を入力します。 CSS スタイル シートを使用して視覚的なスタイルを制御します。 ドキュメントの HEAD にコンテンツを埋め込むには、 script タグを含めます。 (以下のセクションを参照してください。) 注意: 透明な背景とスケールは、Windows で v2 R253 から使用できます。 画面外のプリロードは、現在 Android v2 R207 からのみ使用できます。 埋め込む HEAD コンテンツ JavaScript は script タグで囲む必要があります。Sigme は自動的に jQuery を追加します。 EmbedInit() メソッドはプレーヤーによって呼び出され、適切なタイミングでカスタム JavaScript を安全に開始するために使用できます。このメソッドは、新しい埋め込みメディア アイテムでデフォルト設定されます。 <script type=\"text\/javascript\"> function EmbedInit() { \/\/ このページがクライアントに読み込まれると、Init が呼び出されます。 return; } <\/script> Windows プレーヤーで Active-X コンテンツを含む埋め込み HTML を IE のセキュリティ設定で表示し、ローカル ファイルでアクティブ コンテンツの実行が既定で許可されるようにします。これは、[ツール] -> [インターネット オプション] -> [詳細設定] -> [セキュリティ] -> [マイ コンピューターのファイルでアクティブ コンテンツの実行を許可する] で実行できます。",
        "page_url": "output\/ja\/media_module_embedded.html"
    },
    {
        "id": "media_module_emergency_alerts",
        "content": "緊急アラート 共通アラート プロトコル (CAP) フィードのデータを使用してアラートと緊急メッセージを表示し、Sigme ディスプレイ ネットワーク全体で警告の有効性を高めることで、スタッフ、生徒、一般の人々の安全を確保します。 機能の概要 CAP コネクタ は、共通アラート プロトコル フィード サービスからのデータを使用します。 CAP フィードからアラート データを取得するには、 CAP URL を指定します。 さまざまな 要素 から追加して、レイアウト エディターの視覚表現をカスタマイズし、最大限の効果を実現します。 効果的なターゲット メッセージングのために、エリア固有の ディスプレイ にのみ一致する緊急アラートを送信します。 業界標準のフィルターを使用して、返されたデータからメッセージをカスタマイズします。 CAP フィードからのデータ サイクルを使用して、複数の緊急アラート メッセージを表示します。 スケジュール 時に 基準 を設定して、サポートされているプレーヤーのスケジュール ループにアラートを含めるかどうかを決定します。 プレーヤー機能のサポート 詳細情報 コネクタ管理 データ ウィジェット レイアウト エディター",
        "page_url": "output\/ja\/media_module_emergency_alerts.html"
    },
    {
        "id": "media_module_flash",
        "content": "Flash ライブラリ検索 から、レイアウトとプレイリストに含める SWF ファイルを追加します。 「その他のメディア」検索を使用して、 タイプ ドロップダウンから Flash を選択します。 重要: Adobe は Flash をサポートしなくなったため、時間の経過とともに段階的に廃止されます。このアプリケーションの開発とサポートが中止されたため、Android では Flash モジュールはサポートされなくなりました。徹底的なテストの結果、プレーヤーの不安定性によりプレーヤーが終了する可能性があることが判明しました。Flash モジュール経由または埋め込み Web サイトでの実行を引き続き選択する場合は、Flash アプリケーションが使用可能な場合はそれを使用してレンダリングされます。ただし、デバイスに安定性の問題がある場合は、Flash コンテンツの実行が原因である可能性があります。 現時点ではプレーヤーで Flash を再生できますが、オペレーティング システムやブラウザなどの他のサードパーティ コンポーネントを更新すると、Flash ファイルが再生できなくなる場合があります。 このモジュールは、 Xibo Cloud Hosted のお客様に対してはデフォルトで無効になっています。 概要 ライブラリ検索 から新しい SWF ファイルをプレイリスト\/レイアウトに直接 アップロード します。 プレイリストとレイアウトに直接アップロードされたファイルは、再利用のために ライブラリ に自動的に保存されます。 SWF ファイルを事前にライブラリにアップロードすることもできます。 プレイリストに直接アップロードされた SWF ファイルの 開始時間と終了時間 を設定します。 アップロード時に SWF ファイルを フォルダー に保存して、ユーザーへのアクセスを簡単に制御します。",
        "page_url": "output\/ja\/media_module_flash.html"
    },
    {
        "id": "media_module_googletraffic",
        "content": "Google Traffic レイアウトとプレイリストに Google Maps API キーで構成されたトラフィック データを表示します。 重要: このモジュールには、使用料が関連付けられている Google API キーが必要です。このモジュールの構成にキーを入力する前に、使用料について理解しておいてください。 インストール Google Traffic モジュールは、使用前に Google Maps API キーで構成する必要があります。“ キーの取得 “ ドキュメントに、プロセスとキー間の違いが説明されています。 Google トラフィック モジュールは、メイン CMS メニューの [ 管理 ] セクションの [ モジュール ] ページからインストールされます。 [ モジュールのインストール ] ボタンをクリックして、インストールするモジュールを選択します。 インストール後、グリッドからモジュールを選択し、行メニューを使用して [ 編集 ] を選択します。 フォーム フィールドに入力し、 API キー を含めます。 このフォームには、 デフォルトの期間 と 最小期間 を指定する設定も含まれています。これら 2 つの設定を理解し、環境に適した方法で構成してください。 重要: Google API はマップの読み込みごとに課金されるため、ウィジェットが画面に表示される時間は、発生する料金に直接関係します。 API キーが入力されるまで、ウィジェットはレイアウト エディタまたはプレーヤーにレンダリングされませんが、ウィジェットをレイアウトに追加することはできます。 このモジュールが機能するには、プレーヤーに 有効なインターネット接続 が必要です。 このモジュールを使用する前に、Google Maps API の利用規約を読んで理解する必要があります。執筆時点では、これらの規約は こちら で確認できます。 概要 使用する緯度と経度を入力します。 ディスプレイの場所を使用して、ディスプレイに記録された緯度と経度を使用します。 ディスプレイの場所設定を使用して、1 つのレイアウトを複数のディスプレイで簡単に再利用し、各ディスプレイの正しい場所に交通状況を表示します。",
        "page_url": "output\/ja\/media_module_googletraffic.html"
    },
    {
        "id": "media_module_hls",
        "content": "HLS レイアウトとプレイリストにライブ ストリーミングされた HLS コンテンツを表示します。 概要 機能するには、プレーヤーに有効なインターネット接続が必要です。 このウィジェットには、Windows 8.1 以降または Android 6 以降を実行しているプレーヤーが必要です。 Android 6 より前の Android デバイスでは、 ローカル ビデオ ウィジェットを使用して HLS を再生できます。 ミュート機能。",
        "page_url": "output\/ja\/media_module_hls.html"
    },
    {
        "id": "media_module_htmlpackage",
        "content": "HTML パッケージ ライブラリ検索 からレイアウトとプレイリストに完全な HTML パッケージを追加します。 「その他のメディア」検索を使用して、 タイプ ドロップダウンから HTML パッケージ を選択します。 概要 ライブラリ検索 から新しいファイルを直接プレイリスト\/レイアウトに アップロード します。 プレイリストやレイアウトに直接アップロードされたファイルは、再利用のために ライブラリ に自動的に保存されます。 HTML ファイルを事前にライブラリにアップロードすることもできます。 プレイリストに直接アップロードされた HTML ファイルの 開始時間と終了時間 を設定します。 アップロード時に HTML ファイルを フォルダ に保存して、ユーザーへのアクセスを簡単に制御します。",
        "page_url": "output\/ja\/media_module_htmlpackage.html"
    },
    {
        "id": "media_module_image",
        "content": "画像 ライブラリ検索 から、レイアウトとプレイリストに含める画像ファイルを追加します。 概要 有効な拡張子: jpg、jpeg、png、bmp、gif、webp。 アニメーション gif はどのプレーヤーでもサポートされていません。 ライブラリ検索 から、新しい画像ファイルを直接プレイリスト\/レイアウトに アップロード します。 プレイリストやレイアウトに直接アップロードされたファイルは、再利用できるように ライブラリ に自動的に保存されます。 画像ファイルを事前にライブラリにアップロードすることもできます。 アップロードする画像ファイルを選択する際、ユーザーは画像の解像度を確認し、意図した画面サイズ内に収める必要があります。非常に大きな画像をアップロードすると、プレーヤーに問題が発生する可能性があるため、注意してください。 プレイリストに直接アップロードされた画像ファイルの 開始時間と終了時間 を設定します。 アップロード時に画像ファイルを フォルダ に保存して、ユーザーのアクセスを簡単に制御します。 中央揃え、ストレッチ、フィットのスケーリング。 CMS を離れることなく、Pixabay から使用する画像を選択します。 Sigme では、ディスプレイに表示されるコンテンツを制御する手段を講じていないため、権利を所有していない場合は、使用する画像に適切な帰属表示を行う責任はお客様にあります。 次へ… 画像のサイズ変更",
        "page_url": "output\/ja\/media_module_image.html"
    },
    {
        "id": "media_module_localvideo",
        "content": "ローカル ビデオ ローカル ファイル パスまたは URL からビデオをプレイリストとレイアウトに追加します。このタイプのビデオはプレーヤーにのみ存在し、CMS にはアップロードされません。 概要 手動で転送されたビデオを表示します。 LAN 上のビデオで使用します。 ビデオをストリーミングします。 ファイル パスまたは URL は RTSP ストリームにすることができます。 アスペクトおよびストレッチのスケーリング オプション。 ミュート機能。 既存のコンテンツの上にコンテンツを展開して、ビデオを全画面で表示します。 注意: ビデオのスケーリングと RTSP ストリームは、Android、webOS、Linux プレーヤーでのみサポートされています。Windows および Tizen プレーヤーで互換性のあるビデオ ストリームを表示するには、 HLS ウィジェットを使用してください。 1 つのレイアウト\/プレイリストに表示できる RTSP ストリームの数は、使用しているデバイスによって異なります。 ローカル ビデオ ウィジェットを使用する場合、Tizen プレーヤーではトランジションはサポートされません。",
        "page_url": "output\/ja\/media_module_localvideo.html"
    },
    {
        "id": "media_module_mastodon",
        "content": "Mastodon エレメントを使用してレイアウト上の任意の場所に Mastodon ソーシャル フィード コンテンツを表示するか、レイアウト\/プレイリストに事前にスタイル設定されたデザインの静的テンプレートを含めます。 Mastodon ウィジェットは、 モジュール に入力された URL からコンテンツを返します。このコンテンツは、構成されたエレメントと静的テンプレートにフィードされます。 Mastodon 要素 Mastodon ウィジェットを レイアウト に追加するときに 要素 を選択できるため、ユーザーは Mastodon ウィジェットのどのコンポーネントを使用するか、どこに配置できるかをより細かく制御できます。 各要素には、プロパティ パネルに一連の構成オプションがあります。レイアウトで使用される各要素の [構成] タブから結果を返すには、 ハッシュタグ を指定する必要があります。追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。データ要素は、 グローバル要素 を追加して図形やテキストを追加することでさらに強化できます。これらはすべて 要素グループ にまとめられるため、構成や配置が簡単になります。 ステンシル を利用して、事前にデザインされた要素のグループをレイアウトに追加します。 ステンシル内のすべての要素は、構成時に「1 つ」として扱われ、右クリックで簡単に複製できます。 Mastodon 静的テンプレート 静的テンプレート は、返されるアイテムのレイアウトとスタイルを定義するもので、事前にスタイル設定されたテンプレートを使用してアイテムを表示する簡単な方法です。 テンプレートは、返される結果の動作に影響を与えるように構成できるほか、プロパティ パネルのさまざまなオプションを使用してデザインの外観を変更することもできます。レイアウト\/プレイリストに追加された各テンプレートの [ 構成 ] タブから結果を返すには、 ハッシュタグ を指定する必要があります。 概要 メディアが添付されている投稿のみを表示します。 投稿からメンション、ハッシュタグ、URL を削除します。 ローカル サーバーまたはリモート サーバーからの投稿のみを表示します。 パブリック ステータスを返すために、Mastodon ユーザー名を含めます。 アイテムごとに期間を設定します。 ほとんどの URL はデジタル サイネージに適していません。",
        "page_url": "output\/ja\/media_module_mastodon.html"
    },
    {
        "id": "media_module_menuboards_category",
        "content": "メニュー ボード: カテゴリ 要素 を使用して、レイアウト上の任意の場所にメニュー ボードに保持されているカテゴリのデータを表示します。 メニュー ボード: カテゴリ ウィジェットは、主に、構成された要素にフィードするメニュー ボード ソースで構成されます。 メニュー ボード は、メニュー ボード: カテゴリ ウィジェットをレイアウトに追加する前に、定義済みのカテゴリを使用して作成する必要があります。 カテゴリ要素 レイアウト にメニュー ボード: カテゴリ ウィジェットを追加するときに 要素 を選択でき、ユーザーはメニュー ボード カテゴリのどのコンポーネントを使用するか、どこに配置できるかをより細かく制御できます。 各要素には、プロパティ パネルに一連の構成オプションがあります。レイアウトで使用される各要素の [構成] タブから、データ ソースとして使用するメニュー ボードを選択する必要があります。追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。データ要素は、 グローバル要素 を追加して図形やテキストを追加することでさらに補完できます。これらはすべて 要素グループ にまとめられ、構成や配置が簡単になります。 概要 基礎となる メニュー ボード データを編集して、新しいカテゴリ データで要素を更新します。 レイアウトにアクセスせずに、メニュー ボード: カテゴリ ウィジェット コンテンツを更新します。 このメディアのコンテンツは、オフライン再生用にプレーヤーによってキャッシュされます。 メニュー ボード: 製品 ウィジェットとともに使用して、ディスプレイに表示するカテゴリのアイテムのメニュー\/カタログを簡単に作成します。 次へ… メニューボード: 製品",
        "page_url": "output\/ja\/media_module_menuboards_category.html"
    },
    {
        "id": "media_module_menuboards_products",
        "content": "メニュー ボード: 製品 要素 を使用して、レイアウト上の任意の場所にメニュー ボードに保持されている製品のデータを表示します。 メニュー ボード: 製品ウィジェットは、主に、構成された要素にフィードするメニュー ボード ソースで構成されます。 メニュー ボード: 製品ウィジェットをレイアウトに追加する前に、製品を追加して メニュー ボード を作成する必要があります。 製品要素 レイアウト にメニュー ボード: 製品ウィジェットを追加するときに 要素 を選択でき、ユーザーはメニュー ボード製品のどのコンポーネントを使用するか、どこに配置できるかをより細かく制御できます。 各要素には、プロパティ パネルに一連の構成オプションがあります。レイアウトで使用される各要素の [構成] タブから、データ ソースとして使用するメニュー ボードを選択する必要があります。追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。データ要素は、 グローバル要素 を追加して図形やテキストを追加することでさらに補完でき、これらはすべて 要素グループ にまとめられるため、構成や配置が簡単になります。 概要 基礎となる メニュー ボード データを編集して、新しい製品データで要素を更新します。 レイアウトにアクセスせずにメニュー ボード: 製品ウィジェット コンテンツを更新します。 アイテムの並べ替え方法を選択します。 利用不可としてマークされた製品を表示するように選択します。 利用不可のアイテムは目立たないように「淡色表示」できます。 アイテムごとに期間を設定できます。 このメディアのコンテンツは、オフライン再生用にプレーヤーによってキャッシュされます。 メニュー ボード: カテゴリ ウィジェットと一緒に使用して、ディスプレイに表示される製品データのプレゼンテーションを補完するヘッダー情報を含めます。 次へ… メニュー ボード: カテゴリ",
        "page_url": "output\/ja\/media_module_menuboards_products.html"
    },
    {
        "id": "media_module_national_weather_service",
        "content": "National Weather Service 悪天候、水、気候イベントに関するリアルタイム データを含む天気予報を表示することで、米国民が異常気象イベントに備える手助けをします。 National Weather Service (NWS) のデータを使用して、Sigme ディスプレイ ネットワーク全体で潜在的な危険に対する認識を高めます。 {version} 注意: 天気予報と警報は、米国、その領土、および隣接する海域と海洋地域を対象としています。このウィジェットを使用する場合は、 モジュール セクションから 国立気象サービス を有効にするよう管理者に依頼してください。 version} 機能の概要 国立気象サービス コネクタ は、提供された NWS Atom URL フィードからのデータを使用します。 デフォルトの NWS Atom フィードの URL で使用することも、カスタム Atom フィード形式の URL を提供することもできます。 さまざまな 要素 から追加して、レイアウト エディターで視覚的な表現をカスタマイズし、最大限の効果を得ることができます。 業界標準のフィルターを使用して、返されたデータからメッセージをカスタマイズします。 NWS Atom フィードからのデータ サイクルを使用して、複数の気象警報メッセージを表示します。 スケジュール 時に 基準 を設定して、サポートされているプレーヤーのスケジュール ループに気象警報を含めるかどうかを決定します。 プレーヤー機能のサポート 詳細情報 コネクタ管理 データ ウィジェット レイアウト エディター",
        "page_url": "output\/ja\/media_module_national_weather_service.html"
    },
    {
        "id": "media_module_notifications",
        "content": "通知 要素 を使用して、レイアウト上の任意の場所に 通知 データを表示します。 通知要素 要素 は、通知ウィジェットを レイアウト に追加するときに選択でき、ユーザーは通知のどのコンポーネントを使用するか、どこに配置できるかをより細かく制御できます。 各要素には、プロパティ パネルに一連の構成オプションがあります。追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。 グローバル要素 を追加して図形やテキストを追加することで、データ要素をさらに補完できます。これらはすべて 要素グループ にまとめることができ、構成と配置が簡単になります。 概要 通知ドロワー で新しい通知を作成して、要素を更新します。 レイアウトにアクセスせずにコンテンツを更新します。 メッセージを表示する最大期間を指定します。 個々のメッセージに適用する期間を設定します。 表示するアイテムの数を適用します。 このメディアのコンテンツは、オフライン再生用にプレーヤーによってキャッシュされます。 次へ… 通知",
        "page_url": "output\/ja\/media_module_notifications.html"
    },
    {
        "id": "media_module_pdf",
        "content": "PDF ライブラリ検索 から、レイアウトとプレイリストに含める PDF ファイルを追加します。 「その他のメディア」検索を使用して、 タイプ ドロップダウンから PDF を選択します。 概要 ライブラリ検索 から、新しいファイルを直接プレイリスト\/レイアウトに アップロード します。 プレイリストとレイアウトに直接アップロードされたファイルは、再利用できるように ライブラリ に自動的に保存されます。 PDF ファイルは、事前にライブラリにアップロードすることもできます。 プレイリストに直接アップロードされた PDF ファイルの 開始時間と終了時間 を設定します。 アップロード時に PDF ファイルを フォルダー に保存して、ユーザーへのアクセスを簡単に制御します。 PDF の各ページに適用する期間を設定します。 [ 詳細 ] タブの [ 期間を設定する ] ボックスにチェックを入れます。ここで設定した期間 (秒単位) は PDF 全体に適用されます。または、[ 構成 ] タブをクリックしてボックス内をクリックすると、設定した期間が各ページに適用されます。",
        "page_url": "output\/ja\/media_module_pdf.html"
    },
    {
        "id": "media_module_powerpoint",
        "content": "PowerPoint 次のオプションのいずれかを選択して、PowerPoint プレゼンテーションを表示します: 1. ビデオの追加 (推奨) Windows 以外のプレーヤー \/ PowerPoint のフル コピーをインストールしていないユーザーの場合、Office 2010 以降では、PowerPoint プレゼンテーションを ビデオ ファイルとしてエクスポートできます。PowerPoint アプリケーション内のファイル メニューのオプションを使用して、PowerPoint ファイルをエクスポートします。 注意: プレーヤーが Android または webOS デバイスの場合は、エクスポート形式が MP4 (PowerPoint 2013 以降) であることを確認するか、サード パーティ ツールを使用してビデオを MP4 に変換する必要があります。 ビデオ をプレイリストとレイアウトに追加して続行します。 2. PDF を追加 Windows 以外のプレーヤーや PowerPoint のフル コピーをインストールしていないユーザーの場合は、PowerPoint を PDF ファイルとして保存できます。 PDF をプレイリストとレイアウトに追加して続行します。 3. 準備した PPT ファイルをアップロードします (Windows プレーヤーのみ) PowerPoint は Microsoft 独自の形式であり、各 Windows プレーヤーに Microsoft PowerPoint のフル コピーがインストールされている Windows ベースのサイネージ プレーヤーでのみ表示できます。( Windows プレーヤーの準備 セクションを参照してください) PowerPoint プレゼンテーションを準備します。 PowerPoint では、アップロードする 前 に各 PowerPoint ファイルに対して次の操作を行わない限り、デフォルトでプレゼンテーションの横にスクロール バーが表示されます。 PowerPoint ドキュメントを開きます。 スライド ショー -> セットアップ ショーを選択します。 [ショーの種類] で [個人による参照 (ウィンドウ)] を選択し、[スクロール バーを表示] のチェックを外します。 [OK] をクリックします。 プレゼンテーションを保存します。 Sigme ではプレゼンテーション内のスライドが進められないため、[スライド ショー -> タイミングのリハーサル] に移動して自動スライド タイミングを記録してから、プレゼンテーションを保存する必要があります。 CMS にアップロードします。 [その他のメディア] 検索を使用して、[ タイプ ] ドロップダウンから [ PowerPoint ] を選択します。 ツールバーの ライブラリ検索 を使用して、PPT ファイルをプレイリスト\/レイアウトに直接アップロードします。 プレイリストとレイアウトに直接アップロードされたファイルは、再利用できるように ライブラリ に自動的に保存されます。 PowerPoint ファイルを事前にライブラリにアップロードすることもできます。 プレイリストに直接アップロードされた PowerPoint ファイルの 開始時間と終了時間 を設定します。 アップロード時に PowerPoint ファイルを フォルダ に保存して、ユーザーへのアクセスを簡単に制御します。 PowerPoint ファイルのプレビューは CMS では使用できません。 Windows プレーヤーを準備する Sigme プレーヤーと一緒に Windows PC に PowerPoint をインストールし、Windows レジストリに次の調整を行って、PowerPoint を開いたときに Windows プロンプトを無効にします。 これらの変更を行う際は、必要な予防措置をすべて講じていることを確認してください 。 [HKEY_CLASSES_ROOT\\PowerPoint.Show.12] \"BrowserFlags\"=dword:00000002 \"EditFlags\"=dword:00010000 [HKEY_CLASSES_ROOT\\PowerPoint.Show.8] \"BrowserFlags\"=dword:00000002 \"EditFlags\"=dword:00010000 [H KEY_CLASSES_ROOT\\PowerPoint.SlideShow.12] \"BrowserFlags\"=dword:800000a0 \"EditFlags\"=dword:00010000 [HKEY_CLASSES_ROOT\\PowerPoint.SlideShow.8] \"BrowserFlags\"=dword:00000002 \"EditFlags\"=dword:00010000 レジストリを変更するのが面倒な場合は、Sigme が最初の PowerPoint を開くまで待ってから、ポップアップ通知が表示されたらファイルを「開く」を選択し、再度プロンプトが表示されないようにボックスのチェックを外すことで、同じ結果を得ることができる場合があります。 ディスプレイで PowerPoint を有効にする PowerPoint を使用する予定のディスプレイで使用する Windows ディスプレイ設定プロファイル が最初に有効になっていることを確認する必要があります。 メイン CMS メニューの [ディスプレイ] セクションの [ディスプレイ設定] をクリックします。 Windows ディスプレイ プロファイルの行メニューを使用して [編集] を選択します。 [全般] タブで [PowerPoint を有効にする] にチェックを入れます。 [保存] をクリックします。 高度な手順 PowerPoint を表示する場合、Sigme は Windows と PowerPoint を使用してコンテンツを表示します。つまり、エラーのキャプチャとレポートは Sigme の制御外です。問題を軽減するには、Windows エラー通知を無効にすることをお勧めします。これは、 ここの手順 に従って実行できます。 それでも問題が解決しない場合は、以下のレジストリ パッチをマージして、Office アプリケーション エラー報告を無効にすることもお勧めします。 [HKEY_CURRENT_USER\\Software\\Policies\\Microsoft\\Office\\11.0\\Common] \"DWNeverUpload\"=dword:00000001 [HKEY_CURRENT_USER\\Software\\Policies\\Microsoft\\Office\\10.0\\Common] \"DWNeverUpload\"=dword:00000001 [HKEY_CURRENT_USER\\Software\\Policies\\Microsoft\\Office\\12.0\\Common] \"DWNeverUpload\"=dword:00000001 注意: Windows プレーヤーは、PowerPoint プレゼンテーションを Internet Explorer コンテナー内に表示します。 Internet Explorer は、ディレクトリ C:\\Users\\<user>\\AppData\\Local\\Microsoft\\Windows\\INetCache\\Content.MSO を使用して、インターネット セキュリティ ゾーンからであると識別された Microsoft Office 一時ファイルをキャッシュします。これにより、時間の経過とともにプレゼンテーションの複数のコピーがこのディレクトリに保存される可能性があります。Windows は、キャッシュされた重複ファイルをこのディレクトリから自動的に削除しないため、時間の経過とともにハード ドライブのストレージ領域が消費される可能性があります。このディレクトリにプレゼンテーションの複数のコピーがキャッシュされている場合は、削除しても問題ありません。 このディレクトリの内容を定期的に削除するスケジュールされたタスクまたはスクリプトを作成することをお勧めします。",
        "page_url": "output\/ja\/media_module_powerpoint.html"
    },
    {
        "id": "media_module_shellcommand",
        "content": "シェル コマンド シェル コマンドを使用して、オペレーティング システム シェルを使用して Sigme 環境外でコマンドを実行するようにディスプレイに指示します。 シェル コマンド ウィジェットをレイアウトに追加して、再生するように設定されているオーディオ ウィジェットを含むレイアウトの「音量を上げる」や、レイアウトが終了したときの「音量を下げる」などの外部コマンドを実行します。 概要 シェル コマンド ウィジェットを含むレイアウト\/プレイリストがスケジュールされた時間に再生されると、コマンドが実行されます。 事前に構成された保存済みコマンドを選択します。 コマンド ビルダーを使用してコマンド文字列を作成し、シェルに直接渡します。詳細については、[こちら](displays_command_ functionality.html) を参照してください。 フリー テキストを使用してコマンド文字列を入力します。 グローバル コマンドを使用すると、互換性のあるコマンドをすべてのプレーヤー タイプで使用できます。 Android および Linux プレーヤーでは、シェル コマンドを使用するためにルート アクセスが必要です。 作成したコマンドを Windows コマンドライン (cmd.exe) 経由で起動できるようにする 期間を設定して、コマンドを一定期間実行します。たとえば、コマンドが一定時間画面に何かを表示し、閉じることができない場合などです。 期間を設定する ボックスにチェックを入れ、 詳細 タブで時間を秒単位で入力すると、 構成 タブで Sigme に実行を開始したコマンドを終了するように指示するオプションが使用可能になります。 ほとんどの場合、レイアウト\/プレイリストから実行されるコマンドは、画面のオン\/オフやデバイスの再起動などの動作をトリガーするバックグラウンド コマンドである傾向があります。このような場合は、期間を設定するボックスのチェックを外しておくことができます。 たとえば、「再起動」や、開店\/閉店時に「オン\/オフ」など、特定の日付\/時間に実行されるコマンドについては、スケジュール セクションの イベントの追加 とディスプレイ セクションの コマンドの送信 を参照してください。 次へ… [コマンドの機能](displays_command_ functionality.html)",
        "page_url": "output\/ja\/media_module_shellcommand.html"
    },
    {
        "id": "media_module_stocks",
        "content": "株式 要素 を使用してレイアウト上の任意の場所に株式リストの取引価格情報を表示するか、 静的テンプレート を選択してレイアウト\/プレイリストに結果を表示します。 株式ウィジェットは、構成された要素と静的テンプレートにフィードされる株式市場データを取得するために、 Alpha Vantage API に部分的に依存しています。 Alpha Vantage によって返される価格は、株式分割や配当支払いなどの企業イベントに合わせて調整される 株式市場標準 に従います。 Alpha Vantage にアクセスしてアカウントを作成し、Alpha Vantage コネクタ に入力するための API キーを取得してください。 {nonwhite} {cloud} 通貨モジュールは、サービスの一部として提供される API キーを使用して、 Xibo Cloud でホストされる顧客向けに構成されています。 :::no-loc(shared): …{\/tip} 追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。 グローバル要素 を追加して図形やテキストを追加することで、データ要素をさらに補完できます。これらはすべて 要素グループ にまとめることができ、構成と配置が簡単になります。 Stocks 静的テンプレート 静的テンプレート は、返される結果のレイアウトとスタイル設定方法を定義し、事前にスタイル設定されたテンプレートを使用してデータを表示する簡単な方法です。 プロパティ パネルのさまざまなオプションを使用して、テンプレートを構成してデザインの外観を変更できます。 Stock Symbols を入力すると、レイアウト\/プレイリストに追加された各テンプレートの Configure タブから結果が返されます。 概要 このメディアのコンテンツは、オフライン再生用にプレーヤーによってキャッシュされます。 期間はアイテムごとまたはページごとに適用されます。",
        "page_url": "output\/ja\/media_module_stocks.html"
    },
    {
        "id": "media_module_ticker",
        "content": "RSS ティッカー レイアウト上の任意の場所に要素を使用して動的なフィード コンテンツを表示するか、レイアウト\/プレイリストに事前にスタイル設定されたデザインの静的テンプレートを含めます。 ティッカー ウィジェットは主に、構成された要素と静的テンプレートにフィードするデータ ソースの場所で構成されます。 ティッカー要素 レイアウト に RSS ティッカー ウィジェットを追加するときに 要素 を選択でき、ユーザーはティッカー ウィジェットのどのコンポーネントを使用するか、どこに配置できるかをより細かく制御できます。 各要素には、プロパティ パネルに一連の構成オプションがあります。レイアウトで使用される各要素の [構成] タブから、データ ソースとして使用する URL を指定する必要があります。追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。データ要素は、 グローバル要素 を追加して図形やテキストを追加することでさらに補完でき、これらはすべて 要素グループ にまとめられるため、構成と配置が簡単になります。 データセットの静的テンプレート 静的テンプレート は、返されるアイテムのレイアウトとスタイル設定方法を定義し、事前にスタイル設定されたテンプレートを使用してアイテムを表示する簡単な方法です。 テンプレートは、返される結果の動作に影響を与えるように構成できるほか、プロパティ パネルのさまざまなオプションを使用してデザインの外観を変更できます。レイアウト\/プレイリストに追加された各テンプレートの [ 構成 ] タブから、データ ソースとして使用する URL を指定する必要があります。 概要 フィードから表示するアイテムの数を定義します。 アイテムごとに期間を設定できます。 このオプションを使用すると、長時間実行されるメディア アイテムが作成される可能性があるため、注意して使用してください。制限するには、 アイテム数 と組み合わせて使用してください。 リストの先頭または末尾のアイテムから開始するように選択します。 フィード アイテムの逆順とランダム順を選択できます。 フィードの最後に表示される著作権通知を含めます。 結果を並べて返します。 受信フィードから削除しない属性のリストを提供します。 フィードから削除する HTML タグのリストを含めます。 特定のユーザー エージェントを設定します。 フィードを解析する前に、フィード内の HTML エンティティをデコードします。 日付の並べ替えを無効にします。 オフライン再生用にキャッシュします。 画像の更新間隔をオーバーライドします。 データセット を使用して、このウィジェットで使用する独自の RSS フィード を作成します。",
        "page_url": "output\/ja\/media_module_ticker.html"
    },
    {
        "id": "media_module_video",
        "content": "ビデオ ライブラリ検索 から、レイアウトとプレイリストで再生するビデオ ファイルを追加します。 概要 ライブラリ検索 から、新しいビデオ ファイルをプレイリスト\/レイアウトに直接 アップロード します。 プレイリストとレイアウトに直接アップロードされたファイルは、再利用できるように ライブラリ に自動的に保存されます。 ビデオ ファイルを事前にライブラリにアップロードすることもできます。 H264 MP4 ファイル形式をお勧めします。 ビデオ ファイルをアップロードする際、スクロール バーを使用して、CMS でサムネイルとして使用するフレームを選択し、識別しやすくすることができます。 プレイリストに直接アップロードされたビデオ ファイルの 開始時間と終了時間 を設定します。 アップロード時にビデオ ファイルを フォルダー に保存して、ユーザーへのアクセスを簡単に制御します。 アップロードされたビデオ ファイルは、オフライン再生用にキャッシュされます。 ビデオ ファイルの継続時間を制御します。 元のファイルを短くするには、継続時間を短く設定します。 継続時間を長く設定し、ループ機能を使用して最初に戻って「ループ」し、より長い継続時間を実現します。 アスペクト比とストレッチのスケーリング オプション。 既存のコンテンツの上部を拡大して、ビデオを全画面で表示します。 音声付きの動画をミュートします。 CMS を離れることなく、Pixabay から使用する動画を選択します。 注: スケーリングは現在、Android、webOS、Tizen プレーヤー (v2 R200 以降)、および Windows プレーヤー (v2 R253 以降) でサポートされています。 ビデオ ウィジェットを使用する場合、Tizen プレーヤーではトランジションはサポートされません。 Sigme ではディスプレイに表示されるコンテンツを制御する手段がないため、権利を所有していない場合は、使用する動画の帰属表示を適切に行う責任はお客様にあります。",
        "page_url": "output\/ja\/media_module_video.html"
    },
    {
        "id": "media_module_video_in",
        "content": "ビデオ入力 SoC ディスプレイに外部ソースからの入力を表示する場合に使用します。 注: このウィジェットは、webOS および Tizen プレーヤー、および Android 8 のみを実行する Philips システム オン チップ プレーヤーで使用できます。 概要 複数のデバイス入力から選択します。 HDMI (HDMI 1 のみをサポート) RGB DVI DP OPS 既存のコンテンツの上に展開して、ビデオを全画面で表示します。 注: このウィジェットを使用する場合、Tizen プレーヤーではトランジションはサポートされません。",
        "page_url": "output\/ja\/media_module_video_in.html"
    },
    {
        "id": "media_module_weather",
        "content": "天気 Element を使用してレイアウトの任意の場所に毎日の天気予報データを表示するか、 Static Template を選択してレイアウト\/プレイリストに結果を表示します。 天気データは OpenWeather によって提供され、 CC-BY-SA および ODbL に基づいて提供されます。これらは、構成された要素と静的テンプレートに取り込まれる、現在の世界中の毎日の天気予報を提供します。 API の変更に対応するため、v3.2.1 以降の CMS を使用していることを確認してください。 Open Weather Map にアクセスしてアカウントを作成し、Open Weather Connector に入力するための API キーを取得してください。 注: Open Weather の One Call 3.0 のリリース以降、新規ユーザーは、無料の x 回の呼び出しキーを使用するためにクレジットカードの詳細を入力するか、有料サブスクリプションを選択する必要があります。 Open Weather Map では、1 日あたり 1,000 件の予報リクエストが許可され、それ以降のリクエストには少額の料金が課金されます。 有料プラン では、16 日間の予報が利用できるほか、データの取得方法も最適化されます。 現在 One Call API 2.5 を使用している既存のユーザーは、このサービスを引き続き使用するには One Call API 3.0 に移行する必要があります。 One Call 2.5 へのアクセスは、2024 年 6 月以降はできなくなります。移行方法の詳細については、 こちら をご覧ください。 新しいキーに移行した後は、 モジュール ページの行メニューを使用して、天気のキャッシュを必ずクリアしてください。 このウィジェットを使用する前に、Open Weather Map の利用規約 ( https:\/\/openweathermap.org\/terms ) を読んで理解する必要があります。 天気要素 レイアウト は、天気ウィジェットを レイアウト に追加するときに選択できます。これにより、ユーザーは天気ウィジェットのどのコンポーネントを使用するか、どこに配置できるかをより細かく制御できます。 各要素には、プロパティ パネルに構成オプションのセットがあります。地理的な場所と単位を入力すると、[ 構成 ] タブから結果が返されます。 追加された各要素に使用する データ スロット を指定して、アイテムの循環方法を制御します。データ要素は、 グローバル要素 を追加して図形やテキストを追加することでさらに補完できます。これらはすべて 要素グループ にまとめられ、構成や配置が簡単になります。 天気ウィジェットを使用するすべてのレイアウトには、属性を含める必要があります。属性は、属性要素を使用して利用できます。静的テンプレートには、デフォルトでこのタグが含まれています。 天気静的テンプレート 静的テンプレート は、返される結果のレイアウトとスタイルを定義するもので、事前にスタイル設定されたテンプレートを使用してデータを表示する簡単な方法です。 プロパティ パネルのさまざまなオプションを使用して、テンプレートを構成してデザインの外観を変更できます。レイアウト\/プレイリストに追加された各テンプレートの 構成 タブから結果を返すには、地理的な場所と単位を入力します。 概要 表示場所に基づいて結果を返します。 使用する測定単位を地理的な場所に基づいて自動的に設定します。 表示場所に基づいて天気予報を自動的に選択します。 使用する言語を指定します。 日中の天気状況のみを表示するように選択します。 背景画像を ライブラリ の画像に置き換えます。 このメディアのデータは、オフライン再生用にプレーヤーによってキャッシュされます。",
        "page_url": "output\/ja\/media_module_weather.html"
    },
    {
        "id": "media_module_webpage",
        "content": "Web ページ レイアウトとプレイリストに表示される Web ページのコンテンツを含めます。 注: Web ページはプレーヤーによってキャッシュされないため、Web ページ ウィジェットが機能するには有効なインターネット接続が必要です。 概要 変更を加えずに Web ページ全体を表示します。 ネイティブで開く、手動配置、最適フィットの埋め込みオプション。 対象の Web ページを拡大縮小してオフセットし、Web ページの特定のセクションを表示します。 透明な背景のコンテンツの場合は、ウィジェットを透明な背景で表示するにはチェックを入れます。 コンテンツを画面外にプリロードします。 Web ページの読み込みエラーが発生した場合に、Web フックをトリガーしてアクティブな アクション に移動します。 注意: 透明な背景は、Windows で v2 R253 から使用できます。Sigme は、透明な背景を持つページで有効にすると、これを最大限に実行しようとしますが、一部の Web ページではサポートされません。 画面外のプリロードは現在、Android v2 R207 からのみ使用できます。 ネイティブに開く これを選択すると、プレーヤーは Web ページを変更せずに開き、URL が Sigme の外部のデバイスでアクセスされたかのように、ブラウザーで開いてレンダリングします。 注意: このオプションではプレビューは使用できません。 Web フックをトリガー Web ページがエラーを返して読み込みに失敗した場合に、アクティブなアクション (ウィジェットへの移動、スケジュールされたコマンドのレイアウトへの移動など) の Web フックをトリガーして表示します。 指定された Web フック trigger パラメータと一致するように構成されたアクションの トリガー コード を入力します。 手動位置 このオプションでは、ユーザーが必要な寸法を指定できる iframe に Web ページが埋め込まれます。 オフセットとスケールの設定を使用して、ページ\/ページのセクションを寸法内に収め、Web ページのセクションのみを表示します。 最適フィット このオプションでは、ユーザーが必要な寸法を指定できる iframe に Web ページが埋め込まれます。 注意: 手動位置 および ベスト フィット オプションは、 X-Frame-Options ヘッダー を設定する Web サイトでは機能しません。Web ページが表示されない場合は、Windows \/ Linux または Android を使用しているときに [ネイティブで開く] オプションを使用してください。 X-Frame-Options が設定されている場合、webOS および Tizen はどのモードでも機能しません。 X-Frame-Options が設定されていない場合、上記のオプションのいずれかを使用して、Web サイトはいずれかのプレーヤーに表示されます。 この X-Frame-Options ヘッダー チェッカー ツール を使用して、ターゲットとする Web ページにヘッダーが設定されているかどうかを確認します。",
        "page_url": "output\/ja\/media_module_webpage.html"
    },
    {
        "id": "media_module_world_clock",
        "content": "世界時計 アナログ、時刻と日付、またはテキスト スタイルの時計から選択して、選択したタイムゾーンを表示します。 概要 選択した世界時計スタイルで複数のタイムゾーンを表示します。 複数のタイムゾーンが選択されている場合は、列と行の数を設定します。 選択した各タイムゾーンに独自のラベルを含めます。 オプションでハイライトを選択します。 カスタマイズ可能な外観設定。 アナログ時計の追加のカスタム設定で、秒針、ステップ、内部デジタル時計などを表示します。",
        "page_url": "output\/ja\/media_module_world_clock.html"
    },
    {
        "id": "media_modules",
        "content": "モジュール管理 Sigme に表示されるすべてのコンテンツは、メイン CMS メニューの 管理 セクションの モジュール ページから管理される メディア モジュール によって提供されます: 行メニューを使用して 構成 をクリックし、ユーザーが使用できるかどうかを制御します。 特定のライブラリ ファイル ベースのモジュール (画像、ビデオ、Flash など) で許可された拡張子を追加または削除する必要がある場合があります。一般的な使用例は、その特定の種類のファイルをサポートしていないプレーヤーが使用されている場合です。 フォントは、メイン CMS メニューの 管理 セクションの フォント ページから追加および管理できます。 キャッシュと外部アクセス コア モジュールは、アクティブな接続や必要な外部リソースへの直接アクセスなしで再生できるように、データがキャッシュされて CMS から提供されるように設計されています。CMS は、サードパーティのデータを要求するときに 善良な市民 になるためにもこのメカニズムを使用します。 たとえば、アドレスが http:\/\/anexternal.com\/feed のティッカー ウィジェットは、CMS によってのみアクセスされ、 updateInterval ごとに 1 回のみアクセスされます。レイアウトを表示するプレーヤーは、そのアドレスに直接アクセスする必要はありません。 すべてのコア モジュールがこのアプローチを採用していますが、例外については以下を参照してください: Web ページ モジュール は CMS からキャッシュせず、常にプレーヤーのブラウザーを使用して指定された Web ページ アドレスを開こうとします。つまり、プレーヤーは常に Web アドレスにネットワーク アクセスできる必要があります。 埋め込みモジュール はライブラリ参照を使用してキャッシュできますが、モジュールを作成するユーザーは、必要に応じて外部リソースを自由に指定できます。 ローカル ビデオ モジュール はプレーヤーのビデオ デコーダーによってレンダリングされ、外部ストリームを参照できます。 Flash ファイルには外部ファイルを参照する機能があり、プレーヤーで実行されます。 汎用ファイル 汎用ファイル モジュールは、 追加ファイル をプレーヤーに送信するために使用されます。このファイルは、他の目的で使用できます。 これは、相対パスとして使用される補足ファイル (株価データの結果に基づいて埋め込み HTML に動的に表示される上下の矢印など) を提供する場合に役立ちます。",
        "page_url": "output\/ja\/media_modules.html"
    },
    {
        "id": "media_modules_connectors",
        "content": "コネクタ管理 たとえば Stocks など、サードパーティのサービスにデータを利用するモジュールでは、API キーなどを使用した追加の構成が必要です。 モジュールが有効になり、必要な API キーを取得したら、次の操作を行います。 メイン CMS メニューの [ 管理 ] セクションの [ アプリケーション ] ページに移動します。 ページの [ コネクタ ] セクションまで下にスクロールします。 ここでは、構成可能なすべてのサードパーティ サービスを確認できます: コネクタの [ 構成 ] ボタンをクリックして構成します: 提供された API キー を入力し、[ 有効 ] ボックスにチェックマークを付けて、コネクタが関連するモジュールにサービスを提供するように指示します。",
        "page_url": "output\/ja\/media_modules_connectors.html"
    },
    {
        "id": "media_playlists",
        "content": "プレイリスト プレイリストは、メディア アイテムのシーケンス (画像スライドショーなど) を表示するために使用されます。プレイリストを作成するには、次の 2 つの方法があります: レイアウトとは独立して プレイリスト を作成します。グローバル プレイリストは、レイアウトを作成せずにディスプレイにスケジュールできます。レイアウト エディタの外部で作成されたプレイリストは、レイアウト エディタの [プレイリストの追加] 機能から選択できるように表示されます。 レイアウト エディタからレイアウトに プレイリストを追加 します。ローカル プレイリストは、グローバル プレイリストとして再利用できるように保存するように変換できます。保存されたプレイリストは、レイアウト エディタに表示され、レイアウトに追加されます。 機能の概要: レイアウトとは独立して作成および構成します。 コンテンツを 動的に 追加および維持します。 レイアウトにアクセスせずにプレイリスト コンテンツを更新します。 レイアウトに追加することなく、プレイリスト グリッドから直接スケジュールします。 さまざまなプレイリストからコンテンツを組み合わせて表示します。 プレイリストから表示するアイテムの最大数を設定します。 - プレイリストの各アイテムが次のアイテムに移るまでの表示時間を制御します。 プレイリストに追加されたメディア アイテムの有効期限を設定します。 プレイリストの作成 ディスプレイに表示される複数のコンテンツ アイテムを保持するプレイリストを作成することで、リソースを合理化し、時間を節約できます。特定の要件、場所、主題カテゴリなどに合わせてコンテンツをターゲットにして照合するプレイリストを作成します。 レイアウトとは独立して作成されるプレイリストで、プレイリストにコンテンツを追加または管理するために、レイアウトまたはレイアウト エディターへの追加のユーザー アクセスは必要ありません。プレイリストに加えられた変更は、そのプレイリストがすでに含まれているすべてのレイアウト\/スケジュールで更新されます。 メイン CMS メニューの [ ライブラリ ] セクションで [ プレイリスト ] を選択します。 [ プレイリストを追加 ] ボタンをクリックし、フォーム フィールドに入力します: フォルダー は、ユーザー オブジェクトを整理、検索し、他のユーザー\/ユーザー グループと簡単に 共有 するために使用されます。フォルダーに保存されたプレイリストは、そのフォルダーに適用されたアクセス オプションを継承します。 ユーザーがプレイリストのコンテンツ (画像\/ビデオ メディア ファイルなど) にもアクセスできるようにする場合は、これらも同じフォルダーに保存されていることを確認してください。 CMS で簡単に識別できるように、プレイリストに 名前 を付け、オプションで タグ を含めます。 メディア コンテンツをプレイリストに追加するには、次の 2 つのオプションがあります。 動的 オプションを使用して、基準に基づいてライブラリ ベースのメディアを自動的に割り当てます。 フォームを保存すると開く プレイリスト エディター を使用して、メディアを手動で割り当てます。 メディアを動的に追加する チェックしたら、[ フィルター ] タブをクリックし、一致するライブラリ メディアを入力するために必要な基準を設定します。 自動的に割り当てられるライブラリ メディア ファイルの 最大数 を指定して、自動的に割り当てられる数を制限します。 設定された条件に一致する CMS ライブラリにすでに存在するメディアが表示されます: 今後ライブラリに追加されるメディア ファイルで、このプレイリストに設定された条件を満たすものはすべて、このリストに自動的に追加されます。 ライブラリ メディアは、条件を設定して [動的] オプションのチェックを外しておくことで、プレイリストへの 1 回限りの割り当てとして事前入力することもできます。 保存 をクリックします。 動的プレイリストは、最初にレイアウトに追加しなくても、ディスプレイのフル スクリーンに表示されるようにスケジュールできることをご存知ですか? プレイリストの行メニューを使用して [スケジュール] を選択します。 プレイリスト エディター ツールボックスから、プレイリストに追加するコンテンツを選択します。 構成オプションがプロパティ パネルに読み込まれます。 プレイリスト エディター には、テキスト、HTML、または JavaScript を提供する リッチ テキスト エディター と、プレイリスト内に空の「スロット」を作成する スペーサー の 2 つの追加ウィジェットが含まれています。 プレイリスト タイムラインにアイテムが追加されると、継続時間が更新され、分\/秒が表示されます。 ドラッグ アンド ドロップでシーケンスを並べ替えます。 ルーラー アイコンをクリックして、 スケール モードを変更 します: スケール オプションを使用してズームインおよびズームアウトし、表示される時間範囲を縮小\/拡大します。 アイテムはリスト内の特定のポイントに追加できます。ドラッグまたはクリックして、プレイリスト内の位置マーカーにコンテンツを追加します。 変更を元に戻すには、ツールバーの下部にある [元に戻す] ボタンを使用します。 ウィジェットの有効期限 と プレイリストのトランジション の設定を含む追加の コンテキスト メニュー オプションには、項目を右クリックすることでアクセスできます。 トランジションがデフォルトでウィジェットに適用されている場合、プロパティ パネルは空白になります。フォームには手動で入力されたトランジションのみが表示されます。 プレイリスト エディターの下部にある [複数のウィジェットを選択] ボタンを使用すると、1 回のクリックで複数の選択を削除できます。 「グローバル」プレイリストは、最初にレイアウトに追加しなくても、ディスプレイのフル スクリーンで表示されるようにスケジュール設定できることをご存知ですか? プレイリストの行メニューを使用して、[スケジュール] を選択します。 ウィジェットの有効期限 プレイリストに追加されたアイテムには、開始時間と終了時間を設定する追加オプションがあります。 プレイリスト内のアイテムを右クリックして、 有効期限を編集 するか、 メディアをアップロード するときに設定できます。 ライブラリ検索 からアップロードする場合は、 有効期限の設定 オプションが追加されます: 複数のメディア ファイルをアップロードする場合、[アップロードの開始] ボタンをクリックすると、すべてのファイルが同じ日時とフォルダの場所が設定された状態でアップロードされます。 ファイルの行末にある 青いアップロード ボタンを使用してアイテムを個別にアップロードすることもできます。これにより、アップロードするファイルごとに異なる有効期限とフォルダの場所が設定されます。 有効期限 が設定されているプレイリストのアイテムにはアイコンが表示され、マウスオーバーすると詳細情報が表示されます: 終了日を過ぎると、アイテムはプレイリストから削除されます。期限切れ時に削除するように設定されていない期限切れアイテムは、必要に応じて開始時間と終了時間を再調整できるように、プレイリスト エディターにのみ表示されます。 アイコンをクリックして開き、アイテムを変更したり削除したりできます。 プレイリストの埋め込み プレイリストを他のプレイリスト タイムラインに追加して、表示するコンテンツの量や期間を定義したり、再生順序を決定したりできます。 プレイリスト エディターで、新しいプレイリストを追加するか、ツールボックスから使用可能な「グローバル」プレイリストのリストから選択します。 設定のオプションはプロパティ パネルに表示されます: ドロップダウン メニューを使用して プレイリスト を選択し、必要に応じて + ボタンを使用して複数のプレイリストを追加および設定します。 スポット オプションは、プレイリストから表示するコンテンツの量と時間を定義するために使用されます。 スポットには、プレイリストのコンテンツをフィラーとしてのみ使用し、このプレイリストからコンテンツを追加して、選択した他のプレイリストを 埋める または 埋め込む ためのオプションもあります: このプレイリストは、リストに追加された 最初の プレイリストである必要があります。 スポット フィールドに 0 を入力すると、プレイリスト全体が無視され、再生順序から除外されます。 スポット埋め オプションを使用して、このプレイリストからのコンテンツを他のプレイリストとどのように分配するかを選択します。 注: 開始日 をウィジェットに設定すると、指定された合計数よりも少ないスポットが表示される可能性があることに注意してください。 スポット埋め フィールドのドロップダウンメニューを使用して、選択したプレイリストに指定された再生スポットを満たすのに十分なウィジェットがない場合に、残りのスポットを埋める方法を選択します。 スポット 、 スポットの長さ 、および スポット埋め はすべてオプションであり、この機能が不要な場合は空白のままにすることができます。 プレイリストの順序 のドロップダウンを使用して、すべてのプレイリストを再生する順序を選択します。 自動 は、各リストのアイテムの合計数を使用し、それを最小のリストで割って、各プレイリストから均等に再生されるように、各リストからアイテムを取得する頻度を決定します。 プレイリストの最後に順序付けされていないコンテンツを処理するには、[残りのウィジェット] オプションを選択します。 レイアウト上の 新しいプレイリスト にプレイリストを追加すると、 ランダム ウィジェット 機能を含む サイクル ベースの再生 オプションが追加されます。 グローバル プレイリストにプレイリストを追加する場合、サイクル ベースの再生はサポートされません。 プレイリスト グリッド 保存されたプレイリストは、メイン CMS メニューの ライブラリ セクションの プレイリスト から表示できます。 各プレイリストには、アクション\/ショートカットのメニューにアクセスするための行メニューがあります。主な設定を以下に示します。 タイムライン - プレイリスト エディターを開いて、タイムライン上のコンテンツを変更します。 編集 - 動的プレイリストのフィルター タブを使用して、動的に割り当てられたメディアのリストを表示し、条件を変更します。 使用状況レポート - プレイリストが表示される場所と、プレイリストが含まれているレイアウトを表示します。 スケジュール - ディスプレイで全画面表示されるようにプレイリストを直接スケジュールします。 スケジュールされたプレイリストに加えられた変更は、変更が行われると自動的にプレーヤーにプッシュされます。",
        "page_url": "output\/ja\/media_playlists.html"
    },
    {
        "id": "media_resizing_images",
        "content": "画像のサイズ変更 注: この機能は v2.2.0 以降で使用できます デフォルトのしきい値と制限を指定できます。これは、画像のサイズを変更する必要があるときに考慮されます。これは、画像をアップロードするときや、ウィジェットによって画像をダウンロードするとき (たとえば、ティッカー ウィジェットの NASA RSS) に当てはまります。 設定は、メイン CMS メニューの 管理 セクションの 設定 ページから構成できます。 デフォルト タブをクリックします: サイズ変更しきい値 画像のサイズ変更に考慮される最大しきい値 (最長辺に基づく) を設定します。 サイズ変更しきい値を 1920 に設定し、800 の画像をアップロード\/ダウンロードした場合、この画像はサイズ変更の必要がありません。2400 の画像をアップロード\/ダウンロードした場合、1920 にサイズ変更されます。 サイズ変更制限 アップロード\/ダウンロードされた画像の制限 (最長辺に基づく) を設定します。この制限を超える画像は処理されず、制限内の別の画像に置き換えられます。 この設定により、画像ファイルが処理するには大きすぎるかどうかが決定されます。",
        "page_url": "output\/ja\/media_resizing_images.html"
    },
    {
        "id": "media_tidylibrary",
        "content": "整理ライブラリ CMS が使用され、レイアウト\/メディアが追加されると、時間の経過とともに、使用されなくなった古いコンテンツでライブラリが乱雑になる可能性があります。 ライブラリは、ユーザーまたはスーパー管理者によって 整理 され、クリーンかつ小さな状態に保つことができます。 アクションを元に戻すことはできないため、注意して使用する必要があります。 これは、クォータのある Web サーバーに CMS がインストールされている場合、またはユーザーに独自のクォータが割り当てられている場合に特に重要です。 ライブラリを整理できる場所は 2 つあります: 設定 ページ - すべてのスーパー管理者が利用可能 ライブラリ ページ - CMS のすべてのユーザーが有効 設定からの整理 スーパー管理者は、メニューの [管理] セクションの [設定] ページに移動して、システム全体のライブラリ整理操作を開始できます。[全般] タブをクリックし、[ライブラリの整理] ボタンをクリックします。 この機能はシステム全体に適用され、 すべての ユーザー ファイルに対して実行されるため、使用されていないリビジョンや古いリビジョンを削除するには確認が必要です。 このオプションはより包括的で、次のものを削除します: 一時ファイル 孤立ファイル サムネイル どこでも使用されていないメディア リビジョン どこでも使用されていないメディア (レイアウト \/ 表示グループ \/ 表示) CMS にアップロードされた汎用ファイル 孤立ファイル 孤立ファイルはまれに発生するもので、メディア アイテムがライブラリから削除されたときに、ライブラリ フォルダ内のディスクに保存されているファイルが削除されません。つまり、ファイルは存在しますが、CMS はそれについて何も認識していません。 ライブラリからの整理 メイン メニューの [管理] セクションの [ 設定 ] で機能を有効にすることで、 すべての ユーザーがライブラリ ページからライブラリの整理を開始できるようにします。 [全般] タブをクリックし、[ ライブラリ整理を有効にする ] のチェックボックスをオンにします。 有効にすると、ユーザーはライブラリ ページの上部にある [ ライブラリの整理 ] ボタンをクリックできます。 フォームには、削除されるファイルの数と、それらのファイルが占めるスペースが表示されます。 これにより、ログインしているユーザーが所有し、レイアウトで使用されなくなったファイル、またはディスプレイ グループ\/ディスプレイに割り当てられていないファイルのみが削除されます。",
        "page_url": "output\/ja\/media_tidylibrary.html"
    },
    {
        "id": "scheduling_dayparting",
        "content": "Dayparting 放送番組では、Dayparting とは放送日をいくつかの部分に分割し、その時間帯に適した異なる種類のラジオ番組やテレビ番組を放送する手法です。 – Wikipedia Sigme は、曜日の例外を含めることができる複数の Dayparts の作成をサポートしています。つまり、1 日を必要な数の 事前定義 部分に分割できます。 典型的な使用例は、朝食、昼食、夕食に異なるコンテンツを表示するホスピタリティ ユーザーです。デイパート機能を使用すると、ユーザーは朝食、昼食、夕食のデイパートを作成できます。各デイパートの開始日と終了日はそれぞれ異なるため、選択して日々のスケジュールを簡素化できます。 デイパート を作成して、 ディスプレイの営業時間 を設定することもできます。 デイパートの追加 デイパートは、メインの CMS メニューの デイパート から作成および管理されます。 デイパートの追加 ボタンを選択します。 フォームのフィールドに入力して構成します。 例外 を追加して、選択した日に異なる開始時間と終了時間を定義します。 保存すると、 イベント を追加するときに、スケジュール フォームの デイパート ドロップダウン メニューでデイパートを選択できるようになります。 以下のデイパート フォームは、朝食のデイパートの例を示しています: 土曜日と日曜日は例外として設定されており、これらの日は朝食の開始時間と終了時間が異なります: スケジュール設定時に、 朝食 デイパートがドロップダウンに表示され、選択できます。選択すると、開始\/終了日付の時間セレクターが日付のみのセレクターに変わり、イベントが発生する曜日に応じて、デイパート設定から時間が取得されます。 デイパートの編集 行メニューを使用して、既存のデイパートを編集します。 他のユーザー\/ユーザー グループと 共有 するために、デイパートの共有オプションを追加します。 デイパートの開始\/終了時間または例外を更新すると、既存の将来のイベントが新しく定義された時間で更新されます。 現在の時間を超えて繰り返し実行されるように設定されている既存の 定期的なスケジュール には、更新された情報を反映する新しいスケジュールが作成されます。",
        "page_url": "output\/ja\/scheduling_dayparting.html"
    },
    {
        "id": "scheduling_events",
        "content": "スケジュール Sigme には、1 つ以上の Displays \/ Display グループにわたる複雑なスケジュールを簡単に作成できる高度なシステムがあります。 スケジュールの作成 スケジュールは、メインの CMS メニューの [スケジュール] ページから作成されます。 ユーザーは、次のいずれかを作成できます。 イベントの追加 ボタンを使用してイベントをスケジュールする 同期イベントの追加 ボタンを使用して同期イベントをスケジュールする イベントの追加 スケジュール グリッドの上部にある イベントの追加 ボタンをクリックして イベントのスケジュール フォームを開き、スケジュールする イベント タイプ を選択して開始します。 スケジュールは、オブジェクトの 行メニュー を使用して スケジュール を選択することでも簡単に作成できます (割り込みレイアウト、コマンド、アクション イベント タイプを除く)。 CMS では、次のタイプのスケジュール設定がサポートされています: レイアウト 公開済みの レイアウト を選択します コマンド 特定の時点でプレーヤーによって実行される [コマンド](displays_command_ functionality.html) を選択します。 コマンド イベントには toDt は必要ありません。 表示順序 と 優先度 は、コマンドの実行には関係ありませんが、整理のために CMS で設定できます。 オーバーレイ レイアウト オーバーレイ レイアウト として設計されたレイアウトは、既存のレイアウトと同時にスケジュール設定され、表示時にコンテンツのオーバーレイが作成されます。 割り込みレイアウト 割り込みレイアウトは、選択した レイアウト を「通常のスケジュール」内の他のレイアウトの 合間に 再生するようにスケジュールします。 Sigme は、 1 時間あたりの秒数 またはスケジュールに入力された パーセンテージ を使用して、いつ再生するかを計算します。 これは、通常のスケジュール内で特定の時間表示する必要があるアナウンスがある場合に役立ちます。 イベント を追加するときに、ドロップダウン メニューからイベント タイプとして 割り込みレイアウト を選択します。 フォーム フィールドに入力してスケジュールを作成します。 シェア オブ ボイス レイアウトが表示される時間を、1 時間あたりの秒数、または 割り込みレイアウト が通常のスケジュールを占めるイベント期間 (開始日と終了日の差) のパーセンテージ (0 - 100%) で入力します。 注意: 「メイン」レイアウトの期間が長い場合、入力した SoV 基準を満たすために、割り込みレイアウトがブロック内に表示されることがあります。 キャンペーン レイアウト リスト キャンペーン を選択します アクション スケジュールされたアクション は、レイアウトに移動するかコマンドを実行するために、Webhook でトリガー コードをリッスンします。 レイアウトに移動 - トリガーされたときにプレーヤーが移動するレイアウトのコード識別子を入力します。このコードは、新しいレイアウトを追加するとき、またはレイアウト グリッドから既存のレイアウトを編集するときに作成されます。 コマンド - 実行するコマンドを選択します。 メディアのスケジュール設定 ライブラリ または プレイリスト に保存されたビデオ ファイルと画像ファイルは、最初にレイアウトに追加しなくても、フル スクリーンで表示されるようにスケジュールできます。 フォーム フィールドに入力してスケジュールを作成します。 メディア\/プレイリスト フィールドから [選択] をクリックすると、ポップアップが表示されます: ドロップダウン メニューを使用して、使用する メディア ファイルまたは プレイリスト を選択します。 保存 時に、さらにオプションが表示されます: ビデオ\/画像ファイル のみ: ループ内の期間 を指定して、ライブラリで設定されたメディア期間を上書きします。 使用する特定の 解像度 を選択します。 アイテムが画面全体を埋めない場合に、ギャップを埋めるために 背景色 を設定します。 ライブラリ および プレイリスト から画像とビデオを直接スケジュールします。行メニューを使用して [スケジュール] をクリックします。 同期イベント 同期イベントは 同期グループ と組み合わせて使用され、2 つ以上のディスプレイにミラーリングまたはビデオ ウォール構成を表示します。 スケジュールする前に、 同期グループ を作成して構成していることを確認してください。 スケジュール グリッドの上部にある [同期イベントの追加] ボタンをクリックして、[同期イベントの追加] フォームを開きます。 ドロップダウン メニューから 同期グループ を選択します。 [レイアウト] ドロップダウンを使用して、グループ内の各ディスプレイに表示するコンテンツを選択します。 ディスプレイの壁構成で表示するコンテンツを選択する場合、合計時間はリード ディスプレイのコンテンツによって適用されます。 リード ディスプレイは、割り当てられたコンテンツに基づいてシーケンスを変更する指示を発行します。グループ内の他のディスプレイのコンテンツのデザインが似ていない場合 (アイテム数、期間などが同じ)、同期が失われる可能性があることに注意してください。 [ミラー] を選択すると、グループ内の各ディスプレイに同じアイテムが自動的に設定されます。 コンテンツ同期キー を使用して、異なるレイアウトの プレイリスト を同期します。 デイパート イベントは デイパート 情報を使用してスケジュールされます: 独自の開始時間と終了時間を入力するには、 カスタム を選択します。スケジュールされたイベントを作成するときに、 相対時間 チェックボックスを使用して時間と分を入力します (同期イベントでは使用できません)。 選択したディスプレイでコンテンツを常にスケジュールするには、 常に を選択します。 独自の定義済み デイパート を作成して選択すると、さらに簡単にスケジュールできます。 ドロップダウンを使用して、リストからスケジュールする必要があるものを選択します。 表示順序 表示順序 を使用して、他のイベントと同時にスケジュールされた場合に、イベントが他のコンテンツと交互に再生される順序を決定します。順序付けは、単純な数値ソートで、最小から最大までの番号です (1 でマークされたイベントは、2 でマークされたイベントより先に再生されます)。 レイアウトの再生順序を確実にするために、レイアウトを キャンペーン に含めることをお勧めします。その後、表示順序を使用して、キャンペーン全体の再生順序を決定できます。キャンペーンの表示順序が同じであるか、何も設定されていない場合、キャンペーンは、個々のキャンペーンに定義されている再生リスト順序 ( インターリーブ または ブロック ) に従って再生されます。 優先度 イベントの 優先度 を設定します。0 は最低優先度と見なされます。 同じイベント タイプのイベントで、最も高い番号のイベントは、より低い番号のイベントよりも優先して再生されます。 レイアウト\/キャンペーン\/画像\/ビデオおよび再生リストは、優先度を考慮する際に同じイベント タイプとして扱われます。 優先度を使用する良い例としては、特定の時間にレイアウトのループのスケジュールを変更する方法があります。たとえば、日中の通常のレイアウトのローテーションで、ランチタイムに特定の「ランチ」情報 (カフェ メニューのランチタイム スペシャルなど) を表示する優先度イベントがあります。 プレーヤーのスケジュールに、優先度がすべて 0 である同じイベント タイプのイベントが含まれている場合、すべてのイベントが一緒にローテーションで表示されます。 これらのイベントの 1 つに優先度 1 がある場合、表示されるイベントはこれのみになります。 優先度 0 のイベント、優先度 1 のイベント、優先度 2 のイベントがある場合、優先度 2 のイベントのみが、そのスケジュール期間のローテーションで表示されます (最高の優先度として) 1 時間あたりの最大再生回数 ディスプレイでこのイベントが 1 時間あたりに表示される回数を制限する数値を設定します。 無制限に再生するには、デフォルトの 0 のままにしておきます。 CMS 時間で実行 ローカル ディスプレイ時間ではなく、 CMS によって決定された時間にイベントを再生するには、このオプションを選択します。 シナリオ CMS 時間 = GMT ディスプレイ 1 = GMT ディスプレイ 2 = GMT -4 11:00 にスケジュールされたイベントで、CMS 時間で実行が 選択解除 されている場合、 ディスプレイ 1 には 11:00 に、 ディスプレイ 2 には 11:00 に表示されます。ディスプレイ 2 は 4 時間遅れているため、これら 2 つのディスプレイでは同じコンテンツが同時に表示されません。 CMS 時間で実行が 選択 されている場合、 ディスプレイ 1 は以前と同じように 11:00 に表示されますが、 ディスプレイ 2 は 07:00 に実行されます。 繰り返し コンテンツが表示されるように多数のスケジュールを作成する代わりに、イベントを 1 分ごと、1 時間ごと、毎日、毎週、毎月、または毎年繰り返すように設定できます。 繰り返し タブで、ドロップダウンを使用して繰り返しの種類を選択します。 ここで数値を入力して繰り返しの頻度を決定します。 たとえば、 毎週の繰り返し では、イベントを繰り返す曜日として水曜日と金曜日を選択し、それらの曜日に 2 を入力して隔週で繰り返すことができます。 毎月の繰り返し は、イベントの日付またはイベントが開催される月の日によって設定できます。たとえば、2023 年 7 月 15 日土曜日にスケジュールされているイベントは、毎月第 3 土曜日に繰り返すように設定できます。 終了時 は、繰り返しが終了するタイミングを制御します。 ここで選択した時間は、定義したイベントの最後の繰り返しの後になるようにしてください。そうしないと、コンテンツの再生が途中で切れてしまいます。 繰り返しイベント は、スケジュールからすべてまたは個々の繰り返しごとに削除できます。 スケジュール フォームの下部にある [ 削除 ] を選択すると、繰り返しイベントのすべてのインスタンスが完全に削除されます。 [カレンダー] ビューで、日付別に [ 繰り返しイベント ] をクリックします。 インスタンスの詳細は、フォームの下部に明確に表示されます。 [ スケジュールから削除 ] をクリックすると、このインスタンスのみがスケジュールから削除されます。その他のインスタンスはスケジュールされたままです。 個々のインスタンスを削除した後に定期スケジュールを修正する場合は注意が必要です。以前に削除したインスタンスは、既存の定期スケジュールを編集することで再作成できます。 リマインダー 通知センター に送信したり、メールで送信したりする一連の リマインダー を作成します。 管理者が CMS 設定 に 送信メール アドレス を入力していることを確認してください。 [ リマインダー ] タブから、フォーム フィールドを使用してリマインダーを定義します。必要に応じて、 + アイコンを使用して行を追加します。 チェックボックスをオンにすると、 ユーザー プロファイル に設定されたアドレスにメールが送信されます。 地理的位置 このイベントの場所を認識させるには、チェックボックスを使用します。詳細については、 地理的スケジュール を参照してください。 編集 \/ 削除 スケジュール グリッドまたはカレンダー ビューからイベントを変更します。詳細については、 スケジュール管理 を参照してください。 複製 スケジュール フォームの下部にある [複製] ボタンを使用すると、イベントの詳細を簡単に複製して、新しいイベントを作成するように構成できます。 [複製] をクリックすると、同じ詳細を含む新しいフォームが読み込まれたことを確認するポップアップが表示されます。新しく読み込まれたフォームには [複製] ボタンはありません。 注意: 実行するスケジュールがない場合、ディスプレイに割り当てられた デフォルト レイアウト が表示されます。",
        "page_url": "output\/ja\/scheduling_events.html"
    },
    {
        "id": "scheduling_geolocation",
        "content": "Geo Scheduling スケジュールされたイベントは、場所を認識するように構成でき、場所がマップ ビューに表示されます。 場所の定義 スケジュール イベント フォームから、 Geo Location タブをクリックします。 Geo Schedule ボックスにチェックを入れて、場所を有効にして定義します。 マップを開くと、 CMS 設定 の ディスプレイ タブの DEFAULT_LAT と DEFAULT_LONG に入力された内容がデフォルトでマップに表示されます。 マップの左上にあるボタンを使用して、ズームインとズームアウトを行います。 検索アイコンをクリックして、特定のエリアの詳細を入力します。 マップ上にポリゴンまたは長方形のレイヤーを描画して、エリアを定義します。 編集 エリアを定義したら、編集アイコンをクリックしてマーカーをドラッグし、既存のレイヤーを調整します。 ここにある灰色の [保存] ボタンをクリックして、編集内容を保存します。 削除 領域を削除するには、ゴミ箱アイコンを使用して削除する領域をクリックします 灰色の [保存] ボタンをクリックして、レイヤーの削除を保存します。 このスケジュールを編集するには、 カレンダー のアイコンをクリックするか、 グリッド ビューの行メニューを使用します。",
        "page_url": "output\/ja\/scheduling_geolocation.html"
    },
    {
        "id": "scheduling_management",
        "content": "スケジュール管理 すべてのスケジュールは、 スケジュール ページから管理されます。このページでは、 グリッド または カレンダー ビューでスケジュールされているすべてのスケジュールを 追加 \/ 編集 および 表示 できます。 フィルター フィールドを使用して、返される結果の条件を制限し、単純なリスト形式で表示するか、キーを使用してカレンダーでイベントを表示します。 すべてのディスプレイ\/ディスプレイ グループとレイアウト\/キャンペーンを含めるには、フィールドを空白のままにして、すべてのスケジュールを表示します。 グリッド ビュー すべてのディスプレイ\/ディスプレイ グループの完全なスケジュール情報を簡単に表示したり、フィルターを使用して特定のディスプレイ スケジュールを表示したりできます。 行メニューを使用して、既存のスケジュールを 編集\/削除 します。 列の表示メニューからグリッドに表示する列が多すぎると、画面サイズに収まりきらず、追加の行は非表示になります。グリッドの行の先頭にある + アイコンをクリックすると、この情報が表示されます。 カレンダー ビュー カレンダーには、選択したディスプレイ\/ディスプレイ グループに関連付けられたスケジュールが表示されます。これらのスケジュールは、カレンダーの下にイベント アイコンで表され、それぞれを説明するキーが付いています。 カレンダー ビューでスケジュールを表示するには、少なくとも 1 つのディスプレイ\/ディスプレイ グループを選択してください。 イベント アイコン にマウスを合わせると、基本的なスケジュール情報が表示されます。 クリックするとフォームが開き、詳細が表示され、既存のスケジュールを編集できます。 今日\/範囲を選択 この範囲には、指定された日付内に発生するすべてのイベントが表示されます。 週の範囲 この範囲には、スケジュールされたイベントの週の概要が表示されます。 日付をダブルクリックすると、日表示が開きます。 月の範囲 この範囲には、その月にスケジュールされたイベントを表すアイコンが含まれています。特定の日付の四角をクリックすると、その日の拡大表示が表示されます。日付の四角をダブルクリックすると、その日付の日表示が開きます。 各アイコンにマウスを合わせると、イベント情報が表示されます。 年範囲 これは、年間を通じて予定されているイベントの概要を示すためのもので、月ごとに予定されているイベントの合計数を示します。イベントの詳細を表示するには、月をクリックします。 ダブルクリックすると、その月の月間ビューが開きます。 アジェンダ イベントは複数の日\/週\/月にまたがる可能性があるため、選択したディスプレイに特定の時点で表示されるレイアウト\/キャンペーンの正確な表現を確認できることは非常に便利です。 範囲 フィルターから アジェンダ を選択します: アジェンダを表示するには、少なくとも 1 つの ディスプレイ\/ディスプレイ グループ を選択する必要があります。複数のディスプレイ\/ディスプレイ グループを選択した場合、これらはスライダーの下の個別の タブ に表示されます。 スライダーを使用して、表示する正確な時刻を指定します。 前\/今日\/次 ボタンを使用するか、カレンダー アイコンを使用して日付を選択して日付を変更します。 レイアウトをクリックして関連情報をハイライト表示し (関連付けは青色に変わります)、パンくずリストを表示して、キャンペーンとディスプレイ グループの詳細情報を表示します。ネストされたディスプレイ グループが設定されている場合は、パンくずリストに表示されます。 マップ アイコンをクリックすると、入力した座標によって決定されたディスプレイの場所が表示されます。 スケジュールされたレイアウト\/キャンペーンは、ディスプレイ上で循環する順序で表形式で表示されます。 プレビュー ウィンドウを使用して選択したレイアウトを再生し、ボタンを使用して表示ウィンドウを最小化\/最大化するか、全画面で再生します。 パンくずリストをクリックすると、レイアウト エディターで選択したレイアウトが表示され、既存のスケジュールに必要な編集を加えることができます。 戻る ボタンをクリックして、アジェンダ ビューを終了します。",
        "page_url": "output\/ja\/scheduling_management.html"
    },
    {
        "id": "showing_images_videos_on_screens",
        "content": "画面に画像\/ビデオを表示する はじめに メディア ライブラリ を使用すると、 画像 および ビデオ ファイルを簡単にアップロードして、画面に表示するようにスケジュール設定できます。 Xibo 以外で作成された画像\/ビデオ コンテンツ (代理店、マーケティング チームなどによって作成されたもの) があり、すぐに表示できる状態になっている場合があります。以下のガイダンスに従って、画像\/ビデオ ファイルをディスプレイに アップロード 、 構成 、 スケジュール する方法を、わずか数ステップで確認してください。 アップロード メイン CMS メニューの [ ライブラリ ] セクションの [ メディア ] をクリックします。 [ メディアの追加 ] ボタンをクリックします。 [ ファイルの追加 ] を選択し、アップロードする画像\/ビデオ ファイルを選択します。 元のファイル名を使用しない場合は、ここで [ 名前 ] を追加します。 [ アップロードを開始 ] をクリックします。 アップロードが完了したら、[ 完了 ] をクリックします。 構成 必要に応じて、[ メディア ] グリッドからフィルターを使用して、アップロードしたファイルを見つけやすくします。 行メニューを使用して、 スケジュール を選択します: メディアの選択 フォームが開き、必要に応じてさらにオプションの構成を行うことができます: ループ内の期間 は、 スケジュール ループ に表示されるたびにこのメディアが表示される時間を決定します。 メディア ファイルの期間を上書きするには、 期間 を指定します。 使用する特定の 解像度 を選択します。 メディア ファイルが画面に収まらない場合は、背景のギャップを埋めるために 色 を設定します。 保存 をクリックして、 メディアの選択フォーム を閉じ、スケジュール設定を続行します。 スケジュール イベントのスケジュール フォームのフィールドに入力します: 完全なスケジュール リストを見るときに簡単に識別できる 名前 をイベントに付けます。 このメディアを表示する ディスプレイ を選択します。 特定の開始日時と終了日時を設定するには カスタム を選択し、メディアを常にディスプレイに表示するには 常時 を選択します。 保存 をクリックします。 CMS はプレーヤーのスケジュール変更を更新し、スケジュールで設定されたタイミングでメディア コンテンツが画面に表示されます。 詳細情報 シンプルなスケジュール設定 レイアウト エディターを使用して独自のコンテンツを作成する FAQ スケジュール ループ とは何ですか? スケジュール ループとは、他のメディア コンテンツとスケジュールを組んだときにメディア コンテンツが再生される方法です。たとえば、それぞれ 10 秒間の再生時間を持つ 2 つのメディア アイテムを 1 時間同時に表示するようにスケジュールした場合、スケジュールされた時間に両方のアイテムが 10 秒間公平にローテーションして再生されます。 スケジュールから 常時イベント を削除するにはどうすればよいですか? スケジュールから、グリッド ビューのイベントの行メニューを使用して [削除] を選択するか、カレンダーからイベント アイコンをクリックして [イベント編集] フォームを開き、[削除] を選択します。",
        "page_url": "output\/ja\/showing_images_videos_on_screens.html"
    },
    {
        "id": "tour_cms_navigation",
        "content": "CMS の操作 CMS 内のすべてのページはセクションに分類され、すべてのユーザーが CMS メイン メニュー からアクセスできます。 メニューには、ログインしたユーザーがアクセスできるように 機能 が有効になっているセクション\/ページのみが表示されます。 ユーザー設定 設定から、このメニューを配置する場所 (CMS の左側に垂直に配置するか、上部に水平に配置するか) を選択します。 ユーザー ダッシュボード ホームページに戻るには、[ダッシュボード] をクリックします。 グリッド CMS では、 レイアウト 、 メディア 、 ディスプレイ などの多くのエンティティが、 グリッド 内の表形式のデータとして表示されます。これらのグリッドには、読みやすく理解しやすい柔軟な管理ツールを作成するために組み合わせられる多数の要素があります。 次のスクリーンショットは、 レイアウト グリッド を例として示しており、各要素が注釈として付けられています。 アクション ボタン レイアウトの追加 などの各ページの一般的なアクション ボタンは、CMS 全体から簡単にアクセスできるようにグリッドの右上にあります。 タブ タブには、アイテムを簡単に見つけられるようにフィルター オプションが用意されています。 詳細 タブを使用して、さらにフィルター オプションにアクセスします。 フィルター 複数の フィルター フィールドを使用して、返される結果の条件を制限します。たとえば、特定の 所有者 に属するすべてのレイアウトを、グリッドに表示される結果のみにすることができます。 チェックボックスを使用して、正規表現を使用して名前の高度なフィルタリング オプションを適用します。カンマ区切りの用語を使用して AND\/OR 条件を指定します。 フォルダー フォルダー は、ユーザー オブジェクトを整理、検索し、他のユーザー\/ユーザー グループと簡単に 共有 するために使用されます。 フォルダー\/サブフォルダーをクリックすると、選択したフォルダーの内容のみが検索され、適用されたフィルターに基づいて結果が返されます。 または すべてのフォルダー にチェックマークを付けると、ルート フォルダーも検索され、適用されたフィルターに基づいて結果が返されます。 [フォルダー] メニューをクリックして、ビューのオン\/オフを切り替えます。フォルダー ツリーがビューから非表示になっている場合は、選択したフォルダーのファイル パスが表示されます。 結果 返された結果は列に表示されます。 ほとんどの列はデフォルトで並べ替えることができます。列に上矢印または下矢印がある場合は、 Shift キーを使用して列を複数並べ替えることができます。 列の表示 ボタンを使用して、使用可能な列を表示します。 データ テーブルに表示する列を選択\/選択解除します: 画面サイズに収まらないほど多くの列が選択されている場合は、追加の行が非表示になります。これらは、行の先頭にある + アイコンをクリックすると表示されます: 行メニュー 項目を選択し、行メニューを使用してショートカットとアクションのリストにアクセスします: 項目の行メニューの内容は、選択したページによって異なります! 複数選択 - 選択済み 選択したグリッドの下部にある 選択済み オプションを使用すると、行を複数選択して一括操作を簡単に実行できます。 タグの編集 この機能を使用すると、新しい タグ を一括で追加できます。また、複数の選択から既存のタグを削除することもできます。 共有 選択したアイテムの複数の 共有 オプションを編集するために使用します。 不確定ステータス - で表示される要素は、すでに設定されているオプションの違いの結果です。ここで行った変更は、選択したすべての要素に適用されます。 シナリオ例 : 2 つのレイアウトが選択されており、すでに次の共有オプションが適用されています: レイアウト 1 - 表示 1、編集 0、削除 0 レイアウト 2 - 表示 1、編集 1、削除 0 複数選択すると、次のように表示されます: 表示 1、編集 - 、削除 0 ユーザーが変更を加えて切り替えます: 表示 0、編集 - 、削除 1 (編集は現在の状態のまま) 2 つのレイアウトに次の共有オプションが設定されます: レイアウト 1 - 表示 0、編集 0、削除 0 レイアウト 2 - 表示 0、編集 1、削除 1 使用可能な複数選択オプションは、選択したページによって異なります! フォーム CMS は、ほとんどのトランザクション (何らかの方法で 追加 \/ 編集 または 削除 するアクション) を フォーム を使用して表示します。 以下のスクリーンショットは、 レイアウト編集 フォームを使用したフォームの表示例を示しています: タブ フォームには、ユーザーに詳細情報とオプションを提供するタブが 1 つだけある場合もあれば、複数ある場合もあります。 フォルダー フォルダー は、ユーザー オブジェクトを整理、検索し、他のユーザー\/ユーザー グループと簡単に 共有 するために使用されます。 [フォルダーの選択] をクリックし、アイテムを保存する宛先フォルダーを選択\/作成します。 フォルダ\/サブフォルダを右クリックすると、 フォルダ メニュー でさらにオプションが表示されます。 フォルダに保存されたアイテムは、ユーザー\/ユーザー グループ アクセス用に宛先フォルダに適用された表示、編集、削除、 共有 オプションを継承します。 フォーム フィールド 各フォームには、入力が必要なフィールドとオプション フィールドがあります。 各フィールドには、フィールドの意味を説明するタイトルと、追加のガイダンスとなるヘルプ テキストがあります。 チェック ボックス 有効\/無効にできるオプションは、チェック ボックスで表示されます。 行メニューからアクセスされるフォームには、 ’自動送信機能’ が含まれている場合があります。これを選択すると、フォームが自動的に送信されます。 ボタン すべてのフォームの下部には、追加\/編集を確定またはキャンセルするためのボタン バーがあります。 ほとんどのフォームには、 ヘルプ ボタンも含まれており、この ユーザー マニュアル のセクションへのリンクが提供され、追加のガイダンスを参照できます。 フォームの自動送信 レイアウト グリッドの チェックアウト 、 ディスプレイ グリッドの ライセンスの確認 と 承認 、 モジュール グリッドの キャッシュのクリア などの選択されたアクションにより、行メニューからアクションをクリックするだけで フォーム が自動的に送信されます。 「自動送信」機能を持つアクションには、フォーム上で有効にするチェックボックス オプションが明確に表示されます: 保存すると、この特定のアクションは次回選択されたときに自動的に送信されます。 「自動送信」を有効にしたフォームは、 ユーザー プロファイル 設定からリセットできます。",
        "page_url": "output\/ja\/tour_cms_navigation.html"
    },
    {
        "id": "tour_cms_settings",
        "content": "CMS 管理者設定 他の複雑なアプリケーションと同様に、Sigme CMS には多数の構成可能なオプションが付属しています。これらは、メイン CMS メニューの 管理 セクションの 設定 ページにあります。 設定は関連するカテゴリのタブに分割されています。 構成 このタブでは、 CMS シークレット キー を表示します。これは、CMS でプレーヤーを認証し、ページに テーマ を適用 (該当する場合) するために使用されるほか、 ナビゲーション メニュー のデフォルトの位置を設定します。 デフォルト このタブを使用して、すべての メディア ファイルにデフォルトを適用し、デフォルトの トランジション を設定します。 また、この設定のチェックボックスをオンにすると、最後に記録された編集から 30 分後にレイアウトを 自動的に公開 するように設定できます。 画像のサイズ変更 デフォルトのしきい値と制限を指定でき、画像のサイズを変更する必要があるときに考慮されます。これは、画像をアップロードする場合や、ウィジェットによってダウンロードされる画像 (ティッカー ウィジェット内の NASA RSS など) の場合に発生することがあります。 サイズ変更しきい値 画像のサイズ変更に考慮する最大しきい値 (最長辺に基づく) を設定します。 サイズ変更しきい値を 1920 に設定し、800 の画像をアップロード\/ダウンロードした場合、この画像はサイズ変更の必要がありません。2400 の画像をアップロード\/ダウンロードした場合、1920 にサイズ変更されます。 サイズ変更制限 アップロード\/ダウンロードされる画像の制限 (最長辺に基づく) を設定します。この制限を超える画像は処理されず、制限内の別の画像に置き換えられます。 この設定により、画像ファイルが処理するには大きすぎるかどうかが決定されます。 DataSet の最大行数 ユーザーが DataSet に作成できる最大行数を設定します。 ディスプレイ CMS 全体のすべての地理認識プレビューの 緯度 と 経度 のデフォルトを設定します。 デフォルト レイアウト ここで設定したデフォルト レイアウトは、他のコンテンツがスケジュールされていない場合、またはスケジュールされたイベントが表示されない場合に表示されるすべてのディスプレイに自動的に割り当てられます。 このグローバル デフォルト レイアウトは、別の デフォルト レイアウト を選択して、個々のディスプレイで上書きできます。 再生証明のデフォルト設定 すべての レイアウト \/ メディア および ウィジェット アイテム にデフォルトで適用される 再生証明 統計の収集の 集約レベル を設定します。 個別 - 統計は各アイテムの開始時と終了時に個別に記録され、各収集間隔で CMS に返されます。 時間ごと - 各アイテムを 1 回記録し、1 時間中の再生回数と再生時間の合計を含め、1 時間の期間が経過した後の次の収集間隔で CMS に返されます。 毎日 - 各アイテムを 1 回記録し、その日のプレイ回数とプレイ時間の合計が記録され、その日の終了後の次の収集間隔で CMS に返されます。 プレーヤーは「完了した記録」のみを集計し、ウィジェットの有効期間の終了時に収集が行われるため、ウィジェットの有効期間が 3 時間の場合、ウィジェットの有効期間が切れると統計が記録されます。 このボックスを使用して、デフォルトですべての ディスプレイ への Proof of Play 統計の収集を 有効 にします。 ディスプレイ設定プロファイル を編集することで、オン\/オフを切り替えることができます。 新しく追加されたすべての レイアウト の Proof of Play 統計の収集をデフォルトでオンに設定するには、ボックスにチェックを入れます。 レイアウトの追加\/編集 フォームのボックスのチェックを外すと、収集を無効にすることができます。 設定を使用して、再生証明統計の収集をすべての メディア 、 プレイリスト 、 ウィジェット (オフ\/オン\/継承) に適用できるようにします。 ウィジェット は常に継承に設定して、レイアウトとメディアのオプションで収集を制御するように意図されています。 全般 ユーザー マニュアル のアドレスを表示\/設定し、ソフトウェアの改善に役立つ 匿名統計 を送信するようにチェックを入れます。 整理されたライブラリ (グローバル) ライブラリは、スーパー管理者またはユーザーが 整理 して、すっきりと小さく保つことができます。 アクションを元に戻すことはできないため、注意して使用する必要があります。 これは、クォータのある Web サーバーに CMS がインストールされている場合、またはユーザーに独自のクォータが割り当てられている場合に特に重要です。 管理者は、設定ページの右隅にある ライブラリの整理 ボタンをクリックして、システム全体のライブラリ整理操作を開始できます。 この機能はシステム全体に適用され、 すべての ユーザー ファイルに対して実行されるため、未使用のリビジョンや古いリビジョンを削除するには確認が必要です。 このオプションはより包括的で、次のものを削除します: 一時ファイル 孤立ファイル サムネイル どこでも使用されていないメディア リビジョン どこでも使用されていないメディア (レイアウト \/ 表示グループ \/ 表示) CMS にアップロードされた汎用ファイル 孤立ファイル 孤立ファイルはまれに発生するもので、メディア アイテムがライブラリから削除されたときに、ライブラリ フォルダー内のディスクに保存されているファイルが削除されません。つまり、ファイルは存在しますが、CMS はそれについて何も認識していません。 ユーザー ライブラリからの整理 ライブラリ整理を有効にする チェックボックスを使用して、ユーザーが ライブラリ ページからファイルを整理できるようにします。 メンテナンス ここから メンテナンスを有効にする と メールアラート を送信し、 ログ と 統計 の最大保存期間を設定します。 ネットワーク [ネットワーク]タブで、全体のCMS管理者の 管理者メール アドレス を入力します。CMSによって生成されたすべてのメール通知はこのアドレスに送信されます。 CMS全体でさらにメール通知を設定する前に、 送信メール アドレス と 名前 が入力されていることを確認してください。 共有 ドロップダウンを使用して、ユーザーのプレイリストでウィジェットの色がどのように表示されるかを変更します。 メディアの色付け では、各ウィジェットの テーマ の色が使用されます。 共有の色付け では、 共有 オプションの ユーザー アクセス に基づいてウィジェットの色が表示されます。(緑 = 編集可能) ここから、ユーザーが 共有 オプションがユーザーの [表示] に設定されている場合に表示をスケジュールできるかどうかを設定できます。また、ユーザーが共有されていないスケジュールのレイアウトの名前を表示できるかどうかも設定できます。 ユーザーがコンテンツを最上位の ルート フォルダー に保存できるようにするにはチェックを入れ、保存先のフォルダーをユーザーが選択するようにするには無効にします。 地域 このタブから、CMS 全体で使用する 言語 とデフォルトの タイムゾーン および 日付形式 を設定します。 タイムゾーン内の最も近い主要都市を選択してください。 チェックボックスを使用して、CMS で使用する ブラウザ言語 を検出し、使用する カレンダー の種類を選択します。 トラブルシューティング このタブは、php エラーや環境の問題をキャプチャするのに役立つログ レベルを設定するために使用されます。 ユーザー 新しいユーザーをオンボーディングするときに、システム ユーザーを選択し、デフォルトのユーザー グループとユーザー タイプを設定します。 デフォルトのユーザー タイプ は ユーザー に設定することをお勧めします。 パスワード ポリシー パスワード ポリシーの正規表現 フィールドに有効な正規表現を入力すると、すべてのパスワード変更リクエストと新しく作成されたパスワードがこれに対してテストされます。 パスワードが必要なポリシーを満たしていない場合、プロンプトとしてテキストの説明が表示されます。 パスワード リマインダー ユーザー がログイン時に パスワードを忘れた場合 のリセット リンクを提供できるようにすると、CMS へのアクセスを簡単に回復できます。 この機能を有効にする前に、 ネットワーク タブに有効な 送信メール アドレス が入力されていることを確認してください。 ユーザーにはリンクが表示され、それをクリックすると、ユーザー プロファイルに記録されているメール アドレスに パスワード リセット通知 が送信されます。 ユーザー は、CMSにログインしたら、 ユーザー プロファイル から自分のパスワードを変更することもできます。 2要素認証 2要素認証 は、ログイン後のセキュリティを強化するためにユーザーが設定できます。 設定が完了すると、ユーザーは、CMSにアクセスするためにログインを完了するために、メールで送信されたコードまたはGoogle Authenticatorアプリに表示されたコードを入力する必要があります。 生成されたメールを受信するために、ユーザーがメール アドレスを提供していることを確認してください。 有効な 送信メール アドレス が ネットワーク タブに入力され、 2要素発行者 フィールドに名前が入力されていることを設定して、CMSへのログイン用に認証コードが生成されたときにGoogle Authenticatorアプリとメールで明確にわかるようにします。 ユーザーのユーザー プロファイルから 2 要素認証をリセット します。 アプリケーション Sigme には、サードパーティ アプリケーションが接続してデータを使用できる API が含まれています。 アプリケーションは、メイン CMS メニューの [ 管理 ] セクションの [ アプリケーション ] から追加および構成されます。 アプリケーションを使用する前に、各ユーザーは CMS 内でアプリケーションがユーザーに代わって動作することを承認する必要があります。 ユーザーは、 ユーザー プロファイル の マイ アプリケーション セクションから承認されたアプリケーションを表示できます。 現時点では、CMS は個々のユーザーにアプリケーションへのアクセスを取り消す方法を提供していません。管理者だけがアプリケーションを完全に削除できます。 フォント Sigme には、多くのウィジェットに設定できる標準フォントのセットが付属しています: Aileron Heavy Regular (Aileron-Heavy.otf) Aileron Regular (Aileron-Regular.otf) Dancing Script Regular (DancingScript-Regular.ttf) Railway Regular (Railway.ttf) Linear Regular (linear-by-braydon-fuller.otf) 重要: 多くのウィジェットで、 Font Family というプロパティまたはビジュアル エディターの Font 選択リストを使用して、カスタム フォントを設定できます。フォントが選択されていない場合、プレーヤーはシステム フォントと呼ばれる独自のデフォルトの「サンセリフ」フォントを表示します。たとえば、Android では通常 Roboto です。 プレーヤーに異なるフォントが表示されないように、利用可能なフォントを常に選択することをお勧めします。 メイン CMS メニューの [ 管理 ] セクションの [ フォント ] ページから管理します。 行メニューを使用してフォントの 詳細 を表示し、フォント スタイルの例を確認します: 追加のフォントは、[ フォントのアップロード ] ボタンをクリックし、ファイル アップローダー ツールを使用して追加できます。 アップロード後に新しいフォントがテキスト エディターに表示されない場合は、ブラウザーのキャッシュをクリアしてみてください。 注: フォントには、 OS\/2 タグ と呼ばれる設定が組み込まれています。Sigme は OS\/2 設定をチェックし、 OS\/2 タグ 0 または 8 のフォント を使用できます。 他の OS\/2 タグのフォントはアップロード時にエラーが発生し、正しく表示されない場合があります。 次へ… 管理設定の詳細 管理 設定の詳細については、次のページを参照してください: ユーザー管理 ユーザー グループ モジュール トランジション タグ フォルダー",
        "page_url": "output\/ja\/tour_cms_settings.html"
    },
    {
        "id": "tour_folders",
        "content": "フォルダー フォルダー は CMS 全体で使用でき、特定のフォルダー内に保持されているすべてのアイテムのユーザー\/ユーザー グループの 共有 オプションを簡単に制御できます。フォルダーは、CMS 内でユーザー オブジェクトを整理および検索するための追加の方法も提供します。 機能の概要 フォルダーに保存されているすべてのユーザー オブジェクトの表示\/編集\/削除アクセスを簡単に制御および維持します。 CMS 全体で使用されます。 オンボーディング ウィザードから新しいユーザーにフォルダーを割り当てます。 ユーザーのホーム フォルダーを設定します。 選択したフォルダーに強制的に保存します。 フォルダ オプションへのユーザー アクセスを制御します。 管理を容易にする専用のフォルダ ページ。 フォルダ検索 CMS 全体の複数のグリッドから利用できます。フォルダ ツリーはデフォルトで最初に開き、フォルダ アイコンをクリックして表示をオフにできます。 フォルダが選択されると、グリッドが更新され、フォルダ内のオブジェクトのみが表示されます。 ルート フォルダで検索を含めるには、[ すべてのフォルダ ] チェック ボックスを使用します。 ユーザーは ホーム フォルダ (家のアイコンで示されます) を設定できます。これにより、自分のメディア、レイアウト、スケジュールなどに完全にアクセスでき、他のすべての「共有」フォルダ コンテンツにもアクセスできます。 フォルダーの表示をオフにすると、選択したフォルダーのファイル パスが表示されるので、どこを見ているのか常に把握できます。 フォルダーへの保存 アイテムは、 追加 \/ 編集 フォームから、またはアイテム行メニューから フォルダーの選択 を使用してフォルダー ツリーを開くことで、フォルダーに保存できます。 すでにフォルダーが選択されている場合は、追加フォームで追加されたユーザー オブジェクト (レイアウト、キャンペーン、メディア ファイルなど) は、その選択したフォルダーに保存されます。 フォルダーの移動と結合 フォルダーを別のフォルダーの場所に移動して、サブフォルダーとして追加できます。 フォルダー を選択します。 右クリックして 移動 を選択します。 移動先のフォルダーの宛先を強調表示します。 保存 フォルダーとそれに含まれるサブフォルダーは、元のフォルダー構造を維持しながら、新しいフォルダーの場所内で新しいサブフォルダーとして移動されます。 また、 マージ オプションを選択して、元のフォルダの内容をメインのフォルダの場所に追加し、元のフォルダをフォルダ ツリーから削除することもできます。 注意: 共有オプションが設定されていないフォルダを移動すると、移動先のフォルダに適用されている共有オプションが継承されます。 フォルダ管理 フォルダ ページは、メインの CMS メニューの 管理 セクションにあり、スーパー管理者はフォルダのすべての側面を管理できます (フォルダを右クリックしてコンテキスト メニューにアクセスします)。また、共有相手やその内容の内訳など、フォルダに関する詳細情報を表示できます。 フォルダの作成 ライブラリ メディア 、 データセット 、 プレイリスト 、 レイアウト 、 キャンペーン 、 テンプレート 、 ディスプレイ 、 ディスプレイ グループ を格納するフォルダを作成します。これらのフォルダは、 フォルダ アイコンをクリックしてフォルダ ツリーを開き、複数の グリッド からアクセスできます。 ルート フォルダ を右クリックし、[作成] を選択してツリーに新しいフォルダを追加します。 ルート フォルダの下にフォルダを作成できるのは、スーパー管理者ユーザーのみです。ユーザーには、 機能 アクセス権を付与して、アクセス権が付与されている親フォルダの下にサブフォルダを作成できます。 サブフォルダの 作成 、 名前の変更 、 削除 、 共有 、 フォルダの移動 などのメニュー オプションも用意されています: 削除できるのは空のフォルダのみです! ホーム フォルダ 管理者は、ユーザーにユーザー グループを割り当て、フォルダ共有を使用してこれらのユーザーに互いのコンテンツへの適切なアクセス権を付与することをお勧めします (表示\/編集\/削除オプションを設定できます)。 ホーム フォルダは、 新しいユーザーのオンボーディング 時に割り当てることができます。 ユーザーは、フォルダ ツリーからいつでもホーム フォルダとルート フォルダを選択できます。 ユーザーは、 すべてのフォルダ を選択することで、自分が所有するオブジェクトを表示\/編集および削除できます。表示できないフォルダにいる場合でも同様です。 逆に、直接\/フォルダ共有によって共有されていない限り、ユーザーは他のユーザーのオブジェクトを表示\/編集または削除できません。 ユーザーのホーム フォルダは、フォルダ ツリーに家のアイコンで表示されます。フォルダが選択されていない場合、またはフォルダ機能が無効になっている場合、新しいコンテンツは自動的にホーム フォルダに保存されます。 グループ管理者にユーザーのホーム フォルダの設定を義務付ける場合は、適切な 機能 が有効になっていることを確認してください。 ユーザーにホーム フォルダを割り当てる (管理者 \/ グループ管理者) 既存のユーザーの場合: メイン CMS メニューの [ 管理 ] セクションの [ ユーザー ] に移動します。 ユーザーの行メニューを使用して [ 編集 ] を選択します。 [ ホーム フォルダ ] タブをクリックします: 使用するフォルダを選択するか、ルート フォルダを右クリックして新しいフォルダを作成します。 新しいフォルダを作成する場合は、 フォルダ ページから正しい共有の表示\/編集\/削除オプションが適用されていることを確認してください。 ホーム フォルダが割り当てられたユーザーは、自分のメディア、レイアウト、スケジュールなどに完全にアクセスでき、ホーム フォルダに設定された共有オプションに従って他のすべてのフォルダ コンテンツにアクセスできます。 ユーザーにホーム フォルダを割り当て、フォルダを 機能 として無効にすることができます。その場合、ユーザーは CMS でフォルダを表示したり操作したりしなくても、デフォルトのホーム フォルダの場所に自動的に保存します。 フォルダへの強制保存 スーパー管理者は、ユーザーがルート フォルダに保存できないようにして、保存前にフォルダを選択するように強制できます。 まず、ルート フォルダをデフォルトで使用しないようにします。 メイン CMS メニューの [ 管理 ] セクションの [ 設定 ] に移動します。 [ 共有 ] タブをクリックします。 [ ルート フォルダへの保存を許可する ] オプションのチェックを外します。 下部の [ 保存 ] ボタンをクリックします。 共有オプション ユーザーが他のユーザーのコンテンツを表示するには、そのコンテンツが共有されている必要があります (直接共有 - 個々のアイテムを共有する必要があります)。また、フォルダーが共有されている場合は、他のユーザーのコンテンツも表示できます (フォルダー共有 - 複数のアイテムが共有オプションを継承します)。 各フォルダーでは、メニューから [ 共有 ] をクリックすることで、ユーザー\/ユーザー グループに対して 共有オプション を設定できます。 フォルダの 共有 オプションは、スーパー管理者ユーザーのみが設定できます。 ユーザーとユーザー グループの一覧から選択し (ユーザー グループは 太字 で表示されます)、選択したフォルダに必要な 表示 、 編集 、 削除 オプションを割り当てます。 フォルダの共有オプションが設定されると、そのフォルダに含まれるか、そのフォルダに移動されたすべてのオブジェクトは、ユーザー\/ユーザー グループに対して有効になっている表示、編集、削除オプションを継承します。 新規ユーザーは、オンボーディング ウィザードに従って ユーザーの追加 を行うことで、最初から フォルダ を割り当てることができます。 注意: メイン フォルダに追加されたサブフォルダは、メイン フォルダから適用された共有オプションを継承します。サブフォルダを表示すると、直接割り当てられた共有オプションのみが表示され、継承されたオプションは表示されません。 上記のように: メインフォルダは Auser と共有されます。 サブ 1 はメインフォルダから継承されるため、 Auser とも共有されます。 サブ 1 には直接適用された共有オプションがないため、 Not Shared が表示されます。 フォルダ メニュー オプション 機能と共有 オプションを使用して、他のユーザー\/ユーザー グループに必要なフォルダ メニューのアクセスを制御します。 フォルダ メニューで作成にアクセスする必要があるユーザーの場合: フォルダ機能セットのコンテンツ タブから、 ユーザーにサブフォルダの作成を許可する… を有効にします。 ユーザー\/ユーザー グループによってサブフォルダを作成できる親フォルダの 共有オプション から 表示 を有効にします。 ルート フォルダの下にフォルダを作成できるのは、スーパー管理者ユーザーのみです。 フォルダ メニューで名前の変更にアクセスする必要があるユーザーの場合: フォルダ機能セットのコンテンツ タブから、 既存のフォルダの名前の変更と削除 を有効にします。 ユーザー\/ユーザー グループが名前を変更できるフォルダーの 共有オプション から 編集 を有効にします。 フォルダー メニューの削除にアクセスする必要があるユーザーの場合: フォルダー機能セットのコンテンツ タブから 既存のフォルダーの名前変更と削除 を有効にします。 ユーザー\/ユーザー グループが削除できるフォルダーの 共有オプション から 削除 を有効にします。",
        "page_url": "output\/ja\/tour_folders.html"
    },
    {
        "id": "tour_tags",
        "content": "タグ管理 タグは、 レイアウト 、 キャンペーン 、 テンプレート 、 プレイリスト 、 メディア 、 ディスプレイ\/ディスプレイ グループ に割り当てることができ、CMS 内で組織化と構造化を実現できます。 機能の概要: CMS 全体で使用されます。 結果を絞り込むことで、検索が簡単になります。 タグに関連付ける値を設定します。 保存するために、値を「必須値」にします。 管理を容易にする専用のタグ ページ。 タグは、CMS 全体のさまざまな フォーム からユーザーが作成できます。これらは、メイン CMS メニューの [ 管理 ] セクションの [ タグ ] ページから管理者が管理できます。 追加のフィルター オプションを適用して、 システム タグ と関連する 値 を持つタグのみを表示できます。 タグを追加するときに、オプションでタグに関連付ける タグ値 を作成できます。 タグで使用する タグ値 を自由に入力します。 キーボードの Enter キーを押して確定します。 タグ フィールドが更新され、 タグ|値 が表示されます このタグが次に入力されると、関連付けられた値が選択用に表示されます。 タグでは 必須値 を有効にすることができ、ユーザーがフォームを保存するには値を選択する必要があります。 選択したタグの行メニューから有効にして、 編集 をクリックします。 また、特定のタグを持つアイテムを検索から 除外 するためのフィルター オプションを提供することもできます: 検索結果からタグを除外するには、 -Tag と入力します。 検索結果から値を除外するには、 -|値 と入力します。 検索結果からタグと値の両方を除外するには、 -Tag|値 と入力します。 上記すべてをコンマで区切って組み合わせることができます! タグが ない すべてのアイテムを表示する場合は、 --no-tag と入力します タグの編集\/削除 タグ ページから、選択したタグの行メニューを使用して 編集 または 削除 します。 名前の変更、関連する値の設定、および必須値機能の有効化\/無効化を行うには、 編集 を選択します。 タグは個別に削除することも、一括で削除することもできます。 行をクリックして削除するタグを選択し、グリッドの下部にある 選択したもの ドロップダウンを使用します 削除 を選択します。 タグの削除は元に戻せないため、慎重に使用してください。 タグの割り当て タグ フィールドにテキストを入力し始めるとすぐに、オートコンプリート ヘルパーによって一致する候補が表示され、ユーザーが選択可能なタグを簡単に確認できるようになります。 タグを入力するには、タグ フィールドに入力を開始し、リストから選択するか、入力が終わったらボックスの外をクリックします。 下の画像では、 colour タグにはすでに Red、Green、Blue の関連値がタグ値として表示されており、選択できます。 タグ値がすでにわかっている場合は、 Tag|Value 形式を使用してフィールドに入力することもできます。 ユーザーは、タグ値フィールドを使用して、定義済みの値がなくても、タグに関連値を追加できます。タグ値フィールドに、タグに関連付ける値を入力し、Enter をクリックします。タグ値を入力しない場合は、このフィールドを空白のままにすることができます。 タグは、CMS 全体の複数のページで 選択されたもの オプションを使用して、複数のオブジェクトに割り当てることもできます。 レイアウトをエクスポートすると、 レイアウト タグ もエクスポートされます。必要に応じて、レイアウトのインポート時にタグを追加するには、[タグのインポート] オプションを選択します。 次へ… フォルダ",
        "page_url": "output\/ja\/tour_tags.html"
    },
    {
        "id": "tour_transitions",
        "content": "トランジション管理 注: 次のウィジェットでは、Tizen プレーヤーでトランジションはサポートされていません: ビデオ ビデオ入力 ローカル ビデオ トランジションは、メイン CMS メニューの 管理 セクションの トランジション ページから管理されます。ユーザーがメディア アイテムに割り当てることができるトランジションを設定します: フェード イン - 不透明度を 0 から 100 に上げます。 フェード アウト - 不透明度を 100 から 0 に下げます。 フライ - コンパス ポイントでフライ インまたはフライ アウトします。 トランジションのデフォルト トランジションのグローバル デフォルト設定は、管理者が CMS 設定 ページから設定できます。 レイアウト プロパティ パネルの [ トランジションを自動的に適用しますか? ] ボックスにチェックを入れると、レイアウトに追加されたすべてのウィジェットでデフォルトのトランジションを簡単に有効にできます。 注意: トランジションのデフォルトが適用されると、ウィジェットのトランジション フィールドは空白のエントリとして表示されます。 これは、ウィジェットに対して 手動で 入力されたトランジションのみがフォーム フィールドに表示されるためです。 プレイリスト トランジション これらは プレイリスト の メディア アイテム 間のトランジションで、 イン および アウト トランジションとして設定されます。 トランジション フォームは、選択したトランジションとそのトランジションで使用できるオプションに応じて適応します。ほとんどの場合、トランジションの継続時間をミリ秒単位で選択する必要があり、Fly の場合は方向も選択する必要があります。 プレイリスト終了トランジション プレイリスト終了トランジションは、 プレイリスト に表示される最後のメディア アイテムが表示されたときに発生し、別の終了トランジションを設定できます。",
        "page_url": "output\/ja\/tour_transitions.html"
    },
    {
        "id": "tour_user_access",
        "content": "初回ユーザー アクセス CMS インスタンスの Web アドレス (URL) を入力します。 スーパー管理者 がログイン先を教えてくれ、CMS にアクセスするための最初のログイン認証情報を提供します。 CMS のインストール プロセス中に、 ユーザー名 と パスワード が提供され、これにより スーパー管理者ユーザー として CMS のすべての領域に無制限にアクセスできます。管理者には、 CMS 設定 から ユーザー に設定できるログイン管理オプションが多数あります。 ログイン CMS は認証システムによって保護されています。 ユーザー名 と パスワード を入力してクリックするとログインできます。CMS のすべてのページは認証されており、ログインしていない場合はログイン フォームが表示されます。 CMS は Cookie を使用して、ユーザーがログインしているかどうかを追跡します。ログインに問題がある場合は、Cookie のブラウザ設定を調整する必要があります。 ログインすると、ホームページとして機能する ユーザー ダッシュボード が表示されます。 ダッシュボードとメイン メニュー項目は、システム内で有効になっている 機能 に基づいています。 ユーザーは、初回ログイン後に、 ユーザー プロファイル の プロファイル編集 セクションからパスワードを変更することをお勧めします。 ユーザー プロファイル CMS の右上にあるアイコンをクリックすると、 ユーザー プロファイル 設定を管理したり、ナビゲーションと機能を支援するために CMS の短い「 ようこそ 」ツアーを再表示したり、各ユーザー セッション後に CMS から安全に ログアウト したりできます。 地域 CMS 設定 で設定された CMS の時間とタイムゾーンがここに表示されます。 設定 ログインしたユーザーに対してのみ有効になる設定を設定できます。 オプションのリストは、各ユーザーに対して有効になっている 機能 アクセスに依存するため、以下に示すものと異なる場合があります。 利用可能なオプションを使用して、CMS 内でのユーザー ロールを強化します: CMS の ナビゲーション メニュー の位置を変更した場合は、変更を適用するためにブラウザを更新してください。 プロファイルの編集 すべてのユーザーは、最初のログイン後に初期パスワードを変更することを強くお勧めします。管理者によって適用された ユーザー設定 からパスワードを変更するようにシステムから要求される場合もあります。 [プロファイルの編集] をクリックして開きます: パスワードを変更する場合は、管理者によって設定された パスワード ポリシー に従う必要がある場合があります。設定されたポリシーの要件を満たすために必要なこと (最小文字数など) を説明するテキスト プロンプトが表示されます。 ログイン ページに パスワードを忘れた場合 リセット リンクがある場合は、ユーザー プロファイルに正しい メール アドレスが入力されていることを確認してください。クリックすると、パスワード リセット通知がメール アドレスに送信され、CMS にすばやく再度アクセスできるようにするための詳細な手順が記載されています。 2 要素認証 ユーザーは、 メール または Google 認証 の 2 要素認証オプションを設定して、CMS にログインしているユーザーの身元をさらに確認するためのコードを入力してログインを完了できます。 メール 注意: ユーザーがメール通知を受信し始めるには、管理者は CMS 設定 ページで 送信メール アドレスが追加されていることを確認する必要があります。 メールを選択 ユーザー プロファイル フォームに メール アドレスが入力されていることを確認し、[保存] をクリックします。 有効にすると、 ユーザー名 と パスワード を入力した後のログインごとに、入力したメール アドレスに送信された メール に記載されている 6 桁のコードを入力してログインを完了するよう求められます。 Google Authenticator 注意: 管理者は CMS 設定 ページで名前を入力する必要があります。この名前は、Google Authenticator アプリで発行者として表示されます。 モバイル デバイスに Google Authenticator アプリ をインストールします。 Google Authenticator を選択します。 ユーザー プロファイルの編集フォームに表示される QR コード をスキャンし、アクセス コード フィールドに表示されたコードを入力して 保存 すると、セットアップが完了します。 有効にすると、 ユーザー名 と パスワード を入力した後、毎回ログインを完了するために Google Authenticator アプリに表示される 6 桁の コード を入力するよう求められます。 エラーを回避するために、電話とサーバーの時刻と日付が正しいことを確認してください。 2 要素認証 オプションに加えられた変更を確認するには、パスワードを入力する必要があります。 リカバリー コードの生成 2 要素認証オプションを保存すると、設定されたメール アドレスまたは Google Authenticator アプリへのアクセスが失われた場合に使用するリカバリー コードを生成する必要があります。 [ 生成 ] をクリックします。 コードを コピー して、パスワード マネージャーなどの安全な場所に保存します。 [ 保存 ] をクリックして、コードを有効にします。 生成されたコードをいつでも表示する必要がある場合は、[ 表示 ] をクリックします。 注意: [生成] をクリックすると、既存の生成コードは無効になります。 メールまたはアプリにアクセスできず、リカバリー コードを取得できない場合は、管理者に連絡して 2 要素認証をリセット してください。 マイ アプリケーション ユーザーが CMS 内で代理で操作することを承認したアプリケーションは、ここで表示できます。アプリケーションに関するご質問は、管理者にお問い合わせください。 現時点では、CMS では個々のユーザーにアプリケーションへのアクセスを取り消す方法を提供していません。 アプリケーション の削除をリクエストするには、管理者にお問い合わせください。 次へ… CMS のナビゲーション",
        "page_url": "output\/ja\/tour_user_access.html"
    },
    {
        "id": "troubleshooting",
        "content": "ユーザー サポート 管理者にお問い合わせください。",
        "page_url": "output\/ja\/troubleshooting.html"
    },
    {
        "id": "users_administration",
        "content": "ユーザー管理 Sigme では、 ユーザー名 と パスワード が指定された複数のユーザーが CMS に個別にアクセスできます。 ユーザーはスーパー管理者によって CMS に追加され、割り当てられた ユーザー タイプ と ユーザー グループ から CMS 内でのアクセス権が付与され、適用された 機能と共有 が継承されます。 ユーザーは 1 つまたは複数のユーザー グループに割り当てることができます。 ユーザーの所有権 個々のユーザーが CMS で作成したすべてのアイテムは、そのユーザーが所有します。アイテム (レイアウト、メディア ファイル、スケジュールされたイベントなど) の所有権により、そのユーザーには他のユーザーと共有する機能を含む完全な編集権限が与えられます。 ユーザー タイプ すべてのユーザーには、使用可能な 3 つのユーザー タイプのいずれかを割り当てる必要があります。 スーパー管理者ユーザー スーパー管理者ユーザーは、割り当てられたユーザー グループに設定されている継承された機能と共有オプションに関係なく、CMS のすべての部分にアクセスできます。これには、システムの他のユーザーが追加したすべてのメディア、レイアウト、スケジュールへのフル アクセスも含まれます。 インストール プロセス中にスーパー管理者ユーザーが作成され、CMS をセットアップするために CMS へのフル アクセス権限が与えられます。CMS システムの最後の連絡窓口として、少なくとも 1 人のスーパー管理者ユーザーを用意することをお勧めします。 グループ管理者ユーザー グループ管理者ユーザーは、自分が属するユーザー グループに割り当てられた CMS の部分のみにアクセスできます。さらに、そのユーザー グループに割り当てられた他のすべてのユーザーのすべてのメディア、レイアウト、スケジュール、および自分のメディア、レイアウト、スケジュールにアクセスできます。 ユーザー ユーザーは、自分が属するユーザー グループに割り当てられた CMS の部分のみにアクセスできるほか、自分のメディア、レイアウト、スケジュールにもアクセスできます。 ユーザー タイプは事前に設定されており、変更できません。 CMS へのユーザーの追加 CMS のメイン メニューの [ 管理 ] セクションの [ ユーザー ] をクリックすると、CMS でユーザーが管理されます。ユーザー グリッドが開き、ユーザーの追加と管理ができます。 必要に応じて CMS のサポートを提供できるように、デフォルトのユーザー アカウント cms_admin が変更または削除されていないことを確認してください。 新しいユーザーを追加するには、[ ユーザーの追加 ] ボタンをクリックします。 ユーザーを追加するには、オンボーディング ウィザードを使用して事前設定されたユーザー グループを使用するか、手動で追加するかの 2 つの方法があります。 オンボーディング ウィザードと事前設定されたグループは、新しい v4 インストールと、以前のバージョンでユーザー グループを使用したことのない v4 にアップグレードするユーザーに使用できます。 事前設定された ユーザー グループ のいずれかを選択し、 オンボーディング ウィザード の手順を続行するか、最後のオプションである ユーザーを手動で作成 を選択して ユーザーの追加 フォームに移動します。 オンボーディング ウィザード ユーザー グループ を選択し、 次へ をクリックします 機能 は、これらのグループの共通機能用に事前構成されています。これらは、ユーザー レコードを編集することで、さらに変更して適合させることができます。 ユーザー ログインとして使用され、CMS 内でユーザーを識別する ユーザー名 と パスワード を作成します。 パスワードは 8 文字以上で、大文字と小文字、および少なくとも 1 つの数字または特殊文字を含める必要があります。 このユーザーのメール アドレスを入力し、[ 次へ ] をクリックします。 ユーザーはログイン後、 ユーザー プロファイル からメール アドレスを入力\/編集できます。 フォルダー を選択すると、新しいユーザーとユーザー オブジェクトを簡単に共有できます。 複数のユーザーとユーザー オブジェクトを共有するプロセスを簡素化するには、フォルダーを使用することをお勧めします。フォルダーに含まれる、またはフォルダーに移動されるすべてのアイテムは、ユーザー\/ユーザー グループに対して有効になっている 共有 の表示、編集、削除のオプションを継承します。 フォルダーを右クリックして [ホームとして設定] オプションを選択すると、ユーザーに ホーム フォルダー をオプションで設定できます。 すべての変更を 保存 します。 他のユーザー (グループ管理者ユーザーなど) がオンボーディング ウィザードを使用してユーザーを追加できるようにする場合、表示および編集のためにユーザーとフォルダーを共有する必要がある場合は、 機能 で フォルダー が有効になっていることを確認してください。 ユーザー追加フォーム フォームを使用して、CMS にユーザーを手動で追加します: システムに新しいユーザーを追加するときに、オンボーディング ウィザードではなく、手動の ユーザー追加フォーム を常に表示するには、 ユーザー プロファイル の 設定 で利用可能なオプションを使用します! 各タブに必要な情報を入力します: ユーザー ログインとして使用され、CMS 内でユーザーを識別する ユーザー名 と パスワード を作成します。 パスワードは 8 文字以上で、大文字と小文字、および少なくとも 1 つの数字または特殊文字を含める必要があります! このユーザーが CMS から通知を受け取れるように、このユーザーのメール アドレスを入力して、[ 次へ ] をクリックします。 ユーザーはログイン後、 ユーザー プロファイル からメール アドレスを入力\/編集できます。 ドロップダウンを使用して ユーザー タイプ を選択します。 このユーザーのライブラリにアップロードできる ライブラリ クォータ の最大量を入力します。詳細は以下のセクションを参照してください。 このユーザーが所属する ユーザー グループ を選択して、役割に応じて CMS の関連部分にアクセスできるようにします。 CMS 内のどの部分にもアクセスする必要はないが、システム管理者としてシステムの問題が発生した場合に通知メールを必要とするユーザーの初期ユーザー グループとして システム通知 を使用します。 ドロップダウンを使用して、ユーザーのホームページの ダッシュボード の選択肢から選択し、CMS の関連部分へのアクセスのみを許可します。ユーザーは、最初のログイン後にこのダッシュボードに移動します。 ライブラリ クォータ Sigme にはライブラリ クォータ システムが含まれており、ユーザー\/ユーザー グループにクォータ (キロバイト単位) を割り当てて、ユーザー\/ユーザー グループがアップロードできるコンテンツの最大量を決定できます。値を 0 に設定すると、ユーザーには無制限のライブラリ クォータがあることを意味します。 ユーザーに対して解決できる最大のクォータは常に適用されるクォータであり、無制限のクォータは除外されます。 例: ユーザー A には、ユーザー レコードに 100 MB のクォータが割り当てられています。 グループ 1 には、グループ レコードに 50 MB のクォータが割り当てられています。 グループ 2 には、グループ レコードに割り当てられた 120 MB のクォータがあります。 ユーザー A はグループ 1 とグループ 2 に属しているため、ライブラリ クォータは 120 MB です (これは適用されている最大のクォータです)。 ユーザー A はグループ 2 を離れるため、ライブラリ クォータは 100 MB になります (適用されている最大のクォータです)。 ユーザー A には無制限のクォータ (0) が再割り当てされ、グループ 1 に属しているため、ライブラリ クォータは 50 MB になります (グループ 1 には 50 MB のクォータが適用されているため、無制限のクォータは除外されます)。 ホーム フォルダー ホーム フォルダー は、フォルダーを右クリック (または新しいフォルダーを作成) して [ホームとして設定] オプションを選択することで、ユーザーに対してオプションで設定できます。 参照 このタブは、ユーザーの参照情報をオプションで提供するために用意されています。追加されたら、この情報はユーザー グリッドおよび API 経由で表示できます。 通知 ユーザーが受け取る通知の種類 (該当する場合は システム または 表示 ) を選択します。 オプション 必要に応じて、ユーザーにさらにオプションを適用します。 サイド ナビゲーション バーを非表示にします。 ログイン時に新規ユーザー ガイドを非表示にします。 次回ログイン時にユーザーにパスワードの変更を強制します。 パスワードの変更を強制 オプション タブのこの機能を使用して、システムにアクセスするために最初に与えられたパスワードを「新規」ユーザーが変更するか、ユーザー アカウントのパスワードがリセットされていることを確認します。 ユーザーは、次回ログイン時にパスワードをリセットするページにリダイレクトされます。 ユーザーの編集 選択したユーザーの行メニューを使用して変更を行います。 このメニューから、 ユーザー グループ メンバーシップ、 ホーム フォルダー 、 機能 アクセスを簡単に管理できます。 ユーザー レコードに必要な変更を加えるには、[ 編集 ] をクリックします。 2 要素認証をリセットする ユーザーがメールや Google Authenticator アプリにアクセスできなくなり、保存されている回復コードにアクセスできない場合は、[ユーザーの編集] フォームのチェック ボックスを使用して [2 要素認証をリセット**] します。 チェックを入れると、この ユーザー プロファイル の 2 要素認証が「オフ」に設定され、保存されているシークレット コードはすべてクリアされます。ユーザーは、以前と同じように、ユーザー プロファイルから 2 要素認証 を設定できるようになりました。 列の表示ボタンを使用して、 2 要素 列をユーザー グリッドに追加します。これにより、ユーザーが設定した 2 要素認証の概要 (無効 \/ メール \/ Google 認証) が表示されます。 CMS にアクセスできない場合は、次の SQL をデータベースで直接実行して、指定したユーザー {yourUserId} の 2FA データをクリアします。userId はユーザー テーブルにあります。 UPDATE `user` SET `twoFactorSecret` = NULL, `twoFactorTypeId` = 0, `twoFactorRecoveryCodes` = NULL WHERE userId = {yourUserId} ユーザーの削除 行メニューを使用して、CMS からユーザーを削除します。確認フォームが開き、そのユーザーが現在所有しているアイテムに関する追加のオプションが表示されます。 ユーザーを削除すると元に戻すことはできず、メディア、レイアウト、スケジュールなど、そのユーザーが所有するすべてのアイテムがシステム内の他のユーザーによって使用されている場合でも削除されます。セレクターを使用して別のユーザーに アイテムを再割り当て すると、そのユーザーが削除するユーザーが現在所有するすべてのアイテムの新しい所有者になります。または、ユーザー編集フォームの下部にある 廃止 チェックボックスを使用して、ユーザーがログインできない状態でもアイテムがシステム内で引き続き使用されるようにします。 Sigme では、追加できるユーザーの数に制限はありません。 次へ… ユーザーグループ",
        "page_url": "output\/ja\/users_administration.html"
    },
    {
        "id": "users_dashboards",
        "content": "ユーザー ダッシュボード ダッシュボードは ユーザー \/ ユーザー グループ に割り当てられ、 ホームページ として機能し、割り当てられたユーザーに対して CMS の許可された部分のみへのアクセスを許可します。 ステータス ダッシュボード ステータス ダッシュボード は、 スーパー管理者ユーザー のデフォルトのユーザー ダッシュボードであり、管理目的でシステムの高レベル ビューとして意図されています。このダッシュボードには、CMS に接続された ディスプレイ 、追加された ユーザー の概要が表示され、ライブラリと帯域幅の使用状況、およびディスプレイ アクティビティに関する情報が提供されます。 ステータス ダッシュボードを下にスクロールして、 ディスプレイ ステータス と ディスプレイ コンテンツ ステータス を表示するその他のチャートにアクセスします。 これらのチャートのいずれかをクリックすると、さらに詳細な内訳が表示されます。 ディスプレイ ページ リンクを使用すると、CMS のディスプレイ グリッドに直接リダイレクトされます。 アイコン ダッシュボード アイコン ダッシュボード は、新しく割り当てられたすべての ユーザー に使用されるデフォルトのユーザー ダッシュボードであり、CMS の他の領域への ランチャー として意図されています。 このダッシュボード内に表示されるアイコンは、ユーザーに対して有効になっている 機能 アクセスによって管理されます。 メディア マネージャー ダッシュボード メディア マネージャー ダッシュボード では、CMS 内のライブラリ メディアの現在のステータスの概要が提供され、アイテムの数とサイズを簡単に確認できるほか、リリースされていないメディアや未使用のメディアも簡単に表示できます。 プレイリスト ダッシュボード プレイリスト ダッシュボード は、 プレイリスト ダッシュボード ユーザー グループ に属するユーザーに割り当てることができます。これにより、有効な 共有 オプションからアクセスを許可された プレイリスト 内のメディアのみをアップロードまたは置換できます。 プレイリスト ダッシュボードでは、CMS の非常に制限されたビューが提供され、ユーザーはドロップダウン メニューを使用して管理する特定のプレイリストのみを選択できます。 ユーザーがプレイリストにアップロードできるメディア ファイルの数を決定するには、 プレイリスト ウィジェット をプレイリストに追加してスポットを構成する必要があります。 注意: ユーザーが プレイリスト ダッシュボード を使用してメディアを追加\/置換できるようにするには、管理者は プレイリスト ウィジェット がスポットで構成され、レイアウト内のプレイリストに追加されていることを確認する必要があります。",
        "page_url": "output\/ja\/users_dashboards.html"
    },
    {
        "id": "users_features_and_sharing",
        "content": "機能と共有 すべてのシステム オブジェクトとユーザー オブジェクトの CMS へのアクセスは、次の 2 つの概念を使用してユーザー\/ユーザー グループに対して制御されます: 機能 - CMS 内でユーザーが表示および実行できる内容を制御します (システム オブジェクト) 共有 - フォルダー、メディア、レイアウト、ディスプレイ\/ディスプレイ グループなどのユーザー オブジェクトの表示、編集、および削除オプションを制御します (ユーザー オブジェクト) これらの概念を組み合わせて使用すると、適切なレベルのユーザー インタラクションが適用され、CMS の関連部分のみがユーザー\/ユーザー グループに表示されるようになります。 機能 機能は、ページとページ機能を制限して (ユーザーが CMS で表示および実行できる内容を制御して)、CMS 内でユーザーに必要なアクセスを設定するために使用されます。 推奨 : CMS 内の複数のユーザーに必要な機能アクセスを設定するには、ユーザー グループを利用し、その後、このグループにユーザーを追加して、有効な機能を継承することで、エラーが少なく、より簡単で安全なワークフローを実現します。 ユーザー グループ内の特定のユーザーにさらにアクセスを許可する必要がある場合は、これらをユーザーに直接割り当てます。 機能は、 ユーザー または ユーザー グループ の行メニューから構成されます: 機能は論理タブにグループ化されており、適切なアクセス領域を簡単に制御できます: ユーザー を表示すると、機能が既存の ユーザー グループ メンバーシップから継承されているかどうかを示す 継承済み 列が表示されます。 機能の列に表示される - は、その機能セット内の選択された機能のみが有効になっていることを示します。矢印を使用して機能を展開すると、セット内で利用可能なすべての機能が表示されます。 チェックマークは、そのセット内のすべての機能が有効になっていることを示します。 ユーザー\/ユーザー グループに必要な機能をオンにするには、[有効] 列をクリックします。 定義済みの ユーザー グループ を使用すると、新しいユーザーのオンボードが容易になります。このグループには、ユーザーのタイプに適した機能アクセスがすでに含まれています。 共有 共有オプションは、ユーザー用の CMS 内のユーザー オブジェクトの表示\/編集\/削除オプションを設定するために使用されます (ユーザー用のレイアウトやメディア ファイルなどのアイテムの操作レベルを制御します)。 フォルダーの共有オプションを設定する (推奨) 最も簡単で迅速な方法は、 フォルダー を作成して使用し、フォルダーに必要なアクセス権を直接設定することです。これにより、複数のアイテムに対して複数のオプションを個別に設定する必要がなくなります。フォルダーに含まれる、または後でフォルダーに移動されるすべてのオブジェクトは、ユーザー\/ユーザー グループに設定された表示\/編集\/削除オプションを自動的に継承します。 フォルダー を作成します フォルダーに含まれるすべてのオブジェクトに適用するユーザーの 共有 アクセスを設定します。 選択したアイテムの行メニューを使用してユーザーがアクセスする必要があるオブジェクトをフォルダーに移動\/保存し、 フォルダーの選択 をクリックするか、アイテムの作成\/アップロード時にフォルダーを選択します。 注: フォルダーの共有オプションは、スーパー管理者のみが設定できます。 重要: 共有する必要があるアイテムのすべての要素もフォルダーに移動する必要があります。これには、レイアウトに含まれるメディア ファイルやキャンペーン内のレイアウトの移動も含まれます。たとえば、ユーザーがそれらにアクセスする必要がある場合は、これらの移動も対象となります。 オブジェクトの共有オプションを設定する ユーザーのアクセス権は、オブジェクト自体から直接割り当てることもできます。 オブジェクトの行メニューを使用して、[共有] を選択します。 フォームを使用して、ユーザーの [表示]、[編集]、[削除] オプションを有効\/無効にします (ユーザー グループは太字で表示されます)。 注: ユーザーがシステムの他のユーザーとアイテムを 共有 できるようにするには、まず、 ユーザー 機能の ユーザー機能 サブセット内にある [すべてのユーザー オブジェクトの共有機能を許可する] 機能を有効にする必要があります。 ログインすると、 ユーザー は [共有] をクリックすると、自分のユーザー グループの他のユーザーのリストのみが表示されます。 スーパー管理者ユーザー は、システム内のすべてのユーザーを表示します。 ウィジェット の共有オプションは、レイアウト エディターの コンテキスト メニュー を使用して割り当てられます。 シナリオ: ユーザー グループのすべてのメンバーがデータセット データを編集する必要があり、特定の 1 人のユーザーのみがデータを 削除 できます。 ユーザー グループの行メニューを使用して、[機能] を選択します。 [コンテンツ] タブから、[ライブラリ] 機能セットを展開します。 「レイアウトとは別に、データセットに含まれるすべてのデータに対する編集（削除を含む）を許可する」チェックボックスをオンにします。 データセットをユーザー グループと共有されている フォルダー に移動します（表示および編集オプションが有効になっているため、データセットはそれらのオプションを継承します）。または、各データセットの行メニューを使用して共有を選択し、ユーザー グループの表示および編集オプションを有効にします。 ユーザー の 削除 にチェックを入れます（表示および編集はグループに対してすでに有効になっているため、ユーザーに対してチェックする必要はありません）。 ユーザーには常に最高の編集レベルが使用されます。ユーザーが 2 つのグループに属していて、一方のグループではオブジェクトに対して削除が有効になっていて、もう一方のグループでは有効になっていない場合、ユーザーはオブジェクトに対して削除アクセス権を持ちます。 アイテムに加えられた変更は「リアルタイム」で利用可能になります。つまり、ユーザーが次にオブジェクトを操作するときに、新しく設定されたオプションが適用されます。 グリッド の下部にある [選択済み] を使用して、共有に関する一括操作を実行します。 ユーザー オブジェクト の [共有] オプションは、所有者、グループ管理者、またはスーパー管理者が変更できます。 所有者がいない ディスプレイ および ディスプレイ グループ の [共有] オプションは、スーパー管理者のみが変更できます。",
        "page_url": "output\/ja\/users_features_and_sharing.html"
    },
    {
        "id": "users_groups",
        "content": "ユーザー グループ ユーザー グループを使用すると、特定のユーザー グループのメンバーである複数のユーザーに適用する 機能と共有 オプションを簡単に設定できます。 ユーザー グループを使用すると、新しいユーザーのオンボーディングやシステム アクセスの管理が簡単になります。ユーザーは、グループで有効になっている機能と共有オプションを継承します。 独自のユーザー グループを作成するには、CMS の一般的な機能を提供するために作成された、新規インストールで使用可能な事前設定された一連のグループから選択します。 注: 事前設定されたユーザー グループは、新しい v4 インストールと、以前のバージョンでユーザー グループを使用したことのない v4 にアップグレードするユーザーにご利用いただけます。 事前設定されたユーザー グループには、ユーザーが選択したロールを実行できるようにするために必要な機能がすでに有効になっています。必要に応じて、これらを変更できます。 注: これはスーパー管理者の高レベル機能であるため、ディスプレイ マネージャー ユーザー グループには新しいディスプレイを追加して承認する権限がありません。追加されたスーパー管理者ユーザーは、 フォルダー に新しいディスプレイを追加したり、ディスプレイ管理の目的でこのユーザー グループに 共有 アクセス権を付与したりできます。 ユーザー グループの作成 ユーザー グループは、メイン CMS メニューの [ 管理 ] セクションの [ ユーザー グループ ] から管理されます。ユーザー グループ グリッドが開き、ユーザー グループを追加および管理できます。 特定のニーズに合わせてユーザー グループを追加し、 新規ユーザー オンボーディング ウィザードに表示されるようにすると、最初から適切なユーザー グループにユーザーを簡単に追加できます。 新しいグループを追加するには、[ ユーザー グループの追加 ] ボタンをクリックし、各タブに必要な情報を入力します。 全般 CMS 内でユーザー グループを識別するための 名前 を付けます このユーザー グループのライブラリにアップロードできる ライブラリ クォータ の最大量を入力します。クォータを適用しない場合は 0 を入力します。 ユーザー グループが通知を受信する場合は、タイプ ( システム または 表示 ) を選択します。 説明 作成したグループを説明するオプションのテキストを入力します。 新しいユーザーのオンボーディングに表示するように有効にした場合、この説明 (グループの役割など) は選択しやすいように表示されます。 オンボーディング設定 このタブを使用して、新規ユーザーのオンボーディングのオプションを制御します: オンボーディング ウィザードを使用するときに、このユーザー グループを選択対象に含める場合はチェックを入れます。 ドロップダウンを使用して、このグループのすべてのメンバーのホームページとして使用される ダッシュボード を選択します。 [保存] をクリックします。 グループ メンバー グリッドに追加したら、行メニューを使用してユーザーをユーザー グループに追加します: [ メンバー ] をクリックします 選択した ユーザー グループ に属する ユーザー を選択します。 [保存] をクリックします。 共有とコラボレーションを容易にするために、ユーザーを 1 つ以上の ユーザー グループ に割り当てることができます! メンバーシップは、行メニューを使用して [ユーザー グループ] を選択し、[メンバーシップの管理] フォームを開くことで、ユーザー グリッドから制御することもできます。 機能 行メニューから 機能 を選択して、CMS の関連部分へのユーザー グループのアクセスを制御します。 コピー 行メニューから既存のユーザー グループの コピー を作成し、調整して、要件に合わせて新しいグループを簡単に作成します。 次へ… 機能と共有",
        "page_url": "output\/ja\/users_groups.html"
    },
    {
        "id": "users_notifications",
        "content": "通知 Sigme 通知システム は、CMS の他のユーザーに重要なシステム イベントやユーザーが作成した通知を通知するために使用されます。 通知がすでに有効になっているユーザーは、下の 通知ドロワー セクションに直接進んでください。 管理者の設定 機能 を使用して、ユーザー\/ユーザー グループの通知を有効にする必要があります。 [ ユーザー ] タブをクリックします。 通知 機能セットを展開し、適切なアクセスを有効にするためにチェックを入れます。 注意: 通知を有効にする前に、[CMS 設定] ページの ネットワーク タブに 送信メール アドレスが含まれていることを確認してください。 システム通知 Sigme は、システム全体の状態を報告するために、さまざまな システム通知 を発行します。 通知は、 ネットワーク タブの CMS 設定 で構成された 管理者 メール アドレスにメールで送信されます。 通知は、システム通知を受信するように構成されたユーザー グループに属するユーザー、またはこれらの通知を受信するように構成されたユーザー グループにも送信されます。システム通知は、ユーザー\/ユーザー グループの編集フォームから管理されます: 通知ドロワー ログインしたユーザーの通知は、画面の右上にあるアラーム ベル アイコンをクリックしてアクセスできる通知ドロワーに表示されます。 未読の通知の数も赤で表示されます! ドロワーには、受信した最新の 5 件の通知が表示されます。 未読の通知は黒のテキストで表示され、既読の通知は薄い灰色のテキストで表示されます。 通知は、リリース日が過ぎていて、ログインしているユーザーに通知が割り当てられている場合にのみ、通知ドロワーに表示されます (例: イベント リマインダーのスケジュール )。 通知 のタイトルをクリックして開き、通知メッセージ全体を読んでください。 通知の作成 通知は、ユーザーが通知ドロワーから 通知センター をクリックして作成します。 グリッドの右上にある 通知の追加 アクション ボタンをクリックします。 件名 のタイトルを追加します。 通知を公開する 日付 と時刻を選択します。 オプションで通知を メール として追加送信する場合は、チェックを入れます。 ユーザー レコードに入力されたメール アドレスが使用されます。この通知を受け取るユーザーは、[ Audience ] タブで定義されます。 [ Interrupt ] オプションを使用すると、通知全体が表示されるページにユーザーを自動的にリダイレクトできます。 このオプションは、重要なユーザー メッセージに便利です。ユーザーは、CMS のナビゲーションを続行するには、[続行] をクリックする必要があります。 [ Administration Settings ] ページの [ Maintenance ] タブで、[ Enable Email Alerts ] が有効になっていることを確認してください。不明な場合は、管理者に問い合わせてください。 [ Message ] タブで、テキスト エディターを使用して、通知のメッセージ本文を作成し、書式設定します。 Notification Widget を使用してメッセージを表示\/表示グループにターゲット設定する場合、書式設定はウィジェットから適用され、ここでエディターで使用されている書式設定から適用されません。 Audience タブから、この通知を受信する Users\/User Groups を選択します。 この通知を送信する CMS の非ユーザーのメール アドレスを入力します。 通知を表示する Display\/Display Groups を選択します。 Display\/Display Groups を正常にターゲットにするには、レイアウトがスケジュールに既に存在し、 Notification Widget が含まれている必要があります。 通知に添付するファイルをアップロードする必要がある場合は、添付ファイル タブを使用します。 添付ファイルは、ユーザーが通知センターからダウンロードできます。 注意: 通知に加えられた編集は、CMS 側のみに反映されます。すでに送信された生成されたメールは取り消されません。 通知ウィジェット レイアウト\/プレイリストに 通知ウィジェット を追加して、 通知センター から作成されたディスプレイにメッセージを表示します。 次へ… レイアウト",
        "page_url": "output\/ja\/users_notifications.html"
    }
]